const t={map:'[{"css":["1.0","5.12"],"flex":["1.5","1.6","1.7","1.8"],"clip":["1.22","43.8"],"es6":["3.0"],"定义":["3.2"],"用法":["3.3"],"默认导出与默认导入注意点":["3.4"],"按需导入与按需导出注意点":["3.5"],"js新增简单数据类型symbol":["4.0"],"dom":["5.0","5.2"],"什么是dom":["5.1"],"javascript和css会不会影响dom树构建和渲染":["5.3"],"javascript对dom树构建和渲染的影响":["5.4"],"规避javascript线程阻塞dom现象":["5.5"],"css对dom树构建和渲染的影响":["5.6"],"domcontentloaded":["5.7"],"dom文档加载的步骤为":["5.8"],"网页的渲染":["5.9"],"dom树的构建是文档加载完成开始的":["5.10"],"render":["5.11"],"js":["5.13","10.10"],"virtual":["5.14","5.15"],"vue的virtual":["5.16"],"vnode":["5.17"],"html八股文":["6.0"],"重绘":["6.12"],"避免重排重绘":["6.13"],"触发合成层":["6.15"],"层压缩":["6.16"],"层爆炸":["6.17"],"为什么要语义化":["6.19"],"seo":["7.0"],"什么是seo":["7.1"],"优化的三要素":["7.2"],"tdk是搜索引擎判断页面主题内容的关键":["7.3"],"提升页面关键词密度":["7.4"],"细枝末节但不可忽视的优化":["7.5"],"w3c标准":["8.0"],"概念":["8.1"],"体现":["8.2"],"意义":["8.3"],"http":["9.0"],"http概述":["9.1"],"http特点":["9.2"],"tcp":["9.3","9.20","9.24"],"http与https的区别":["9.4"],"http1":["9.5"],"url的组成":["9.6"],"http请求":["9.7"],"请求行":["9.8"],"get与post的区别":["9.9"],"什么情况下使用post请求":["9.10"],"请求头":["9.11"],"请求体":["9.12"],"http响应":["9.13"],"响应状态行":["9.14"],"常见状态码":["9.15"],"响应头":["9.16"],"浏览器输入url按回车背后经历了哪些":["9.17"],"url":["9.18"],"dns":["9.19"],"处理请求":["9.21"],"浏览器收到http响应":["9.22"],"渲染页面":["9.23"],"三次握手":["9.25"],"四次挥手":["9.26"],"javascript八股文":["10.0"],"async":["10.5"],"defer":["10.6"],"不同":["10.7"],"立即执行函数是闭包":["10.8"],"class类的函数默认是严格模式":["10.9"],"eventloop事件循环":["10.11"],"同步异步":["10.12"],"宏任务和微任务":["10.13"],"settimeout的误区":["10.14"],"nexttick":["10.15"],"深拷贝浅拷贝":["10.16"],"深拷贝":["10.17"],"浅拷贝":["10.18"],"赋值和浅拷贝的区别":["10.19"],"内存泄漏":["10.20"],"内存的生命周期":["10.21"],"垃圾回收机制":["10.22"],"执行上下文":["10.23"],"isnan":["10.24"],"hasownproperty":["10.25"],"valueof":["10.27"],"javascript变量在内存中具体存储形式":["10.28"],"javascript的装箱和拆箱":["10.29"],"装箱":["10.30"],"拆箱":["10.31"],"null和undefined的异同点有哪些":["10.32"],"为什么typeof":["10.33"],"与":["10.34"],"javascript的隐式转换规则":["10.35"],"双等号左右两边的转换规则":["10.36"],"undefined":["10.37"],"null":["10.38"],"为什么是":["10.39"],"什么是匿名函数":["10.41"],"绑定点击事件有几种方式":["10.42"],"addeventlistener的第三个参数是干嘛的":["10.43"],"函数声明和函数表达式的区别":["10.44"],"javascript的事件流模型有哪些":["10.45"],"ajax":["10.46"],"load":["10.47"],"如何阻止事件冒泡":["10.48"],"如何阻止事件默认行为":["10.49"],"什么是事件委托":["10.50"],"如何实现数组去重":["10.51"],"set":["10.52","10.53","10.54"],"转为数组":["10.55"],"所以set可以使用数组里的":["10.56"],"因此":["10.57"],"map":["10.58","10.60","20.30"],"属性方法":["10.59"],"object":["10.61","11.0","11.1","11.2","11.3","11.4","11.5","11.7","11.8","11.9","11.10","11.11","11.13","11.14","11.16","11.17","11.18","11.19","11.20","11.21","11.22","11.23","11.24","11.25","11.26","11.27","11.28","11.29","11.30","11.31","19.27","20.7","43.3"],"nan是什么":["10.62"],"javascript继承方式有几种":["10.63"],"创建一个对象的方式有哪几种":["10.64"],"this指向的四种情况":["10.65"],"数组常用方法":["10.66"],"math的常用方法有哪些":["10.67"],"哪些因素导致内存泄漏":["10.68"],"讲讲javascript的垃圾回收机制":["10.69"],"js中有哪些不同类型的弹出框":["10.70"],"如何将":["10.71"],"如何在js中编码和解码":["10.72"],"什么是bom":["10.73"],"bom":["10.74"],"js中的substr":["10.75"],"substr":["10.76"],"substring":["10.77"],"解释一下":["10.78"],"input标签":["10.79"],"属性":["10.80"],"语法":["11.6","11.12"],"instanceof":["11.15"],"promise":["12.0"],"reject和catch":["12.1"],"promise的状态":["12.2"],"resolve不同值的区别":["12.3"],"promise的实例方法":["12.4"],"then方法":["12.5"],"catch方法":["12.6"],"finally方法":["12.7"],"promise中的类方法":["12.8"],"运算符":["13.0"],"隐式转换":["13.2"],"node":["14.0","14.1"],"两种模块的差异":["14.2"],"两种模块的区分":["14.3"],"加载":["14.4"],"同时支持两种格式的模块":["14.5"],"存储的时间有效期不同":["15.1"],"存储的大小不同":["15.2"],"与服务端的通信":["15.3"],"操作":["15.4"],"对于浏览器的支持":["15.5"],"token":["15.7"],"是用来干嘛的":["15.8"],"token存在哪里":["15.9"],"最全前端八股文":["16.0"],"typescript":["17.0"],"数组":["17.1","36.0"],"函数":["17.2"],"参数":["17.3"],"函数重载":["17.4"],"元组":["17.5"],"元祖类型的解构赋值":["17.6"],"void":["17.7"],"never":["17.8"],"any":["17.9"],"unknown":["17.10"],"类型推断":["17.12"],"类型断言":["17.13"],"非空断言":["17.14"],"确定赋值断言":["17.15"],"字面量类型":["17.16"],"let和const分析":["17.17"],"接口":["17.18"],"可选":["17.19"],"任意属性":["17.20"],"鸭式辨型法":["17.21"],"绕开额外属性检查的方式":["17.22"],"索引签名":["17.23"],"interface":["17.24"],"objects":["17.25"],"other":["17.26"],"接口可以定义多次":["17.27"],"扩展":["17.28"],"泛型":["17.29"],"泛型约束":["17.30"],"泛型工具":["17.32"],"vue":["18.0","18.1","18.2","18.11","19.0","20.0"],"如何实现":["18.3"],"hash模式":["18.4"],"history模式":["18.5"],"路由跳转方式有哪些":["18.6"],"说一下路由守卫":["18.7"],"完整的导航解析流程":["18.8"],"懒加载":["18.9"],"懒加载实现":["18.10"],"路由元信息":["18.12"],"数据获取":["18.13"],"单页面应用":["19.1"],"vue生命周期":["19.2"],"vue父子组件生命周期":["19.3"],"注意":["19.4","21.4"],"v":["19.5","19.6","22.0","23.0","26.0","27.0"],"说一下computed和watch":["19.7"],"computed和methods的区别":["19.8"],"computed和watch使用场景":["19.9"],"computed的原理":["19.10"],"computed的两种定义方式":["19.11"],"computed属性的初始化":["19.12"],"依赖收集的时机":["19.13"],"watch和watcheffect区别和用法":["19.14"],"vue2和vue3区别":["19.15"],"vue插件使用":["19.16"],"vue插槽":["19.17"],"组件通信":["19.18"],"vuex":["19.19"],"pinia":["19.20"],"调用其他store":["19.21"],"vue自定义指令":["19.22","21.0"],"keep":["19.23"],"activated":["19.24"],"deactivated":["19.25"],"vue2混入":["19.26"],"vue3内置组件":["19.28"],"teleport":["19.29"],"suspense组件":["19.30"],"nexttick及原理":["19.31"],"vue中的nexttick是干什么用的":["19.32"],"vue虚拟dom":["19.33"],"什么是虚拟dom":["19.34"],"说一下diff算法":["19.35"],"props使用":["19.36"],"emit":["19.37"],"观察者模式和发布订阅模式":["20.1"],"什么是观察者模式":["20.2"],"什么是发布订阅模式":["20.3"],"vue2的响应式原理":["20.4"],"vue2":["20.5","20.6","20.11","20.14","20.24"],"definereactive":["20.8"],"observe":["20.9"],"数组是怎么做到响应式的":["20.10"],"watcher和数据之间的关系":["20.12"],"watcher依赖的数据改变方式有":["20.13"],"dep怎么收集依赖的":["20.15"],"vue3":["20.16","20.17","20.19","20.20","20.21","20.22"],"vue3的收集依赖":["20.18"],"副作用函数":["20.23"],"vue3响应式核心方法":["20.25"],"核心方法注意":["20.26"],"activeeffect和effect":["20.27"],"track函数":["20.28"],"trigger":["20.29"],"weakmap":["20.31"],"reactive":["20.32"],"reflect":["20.33"],"proxy和reflect":["20.34"],"什么是自定义指令":["21.1"],"自定义组件注册":["21.2"],"钩子函数":["21.3"],"指令的使用":["21.5"],"在":["21.6"],"常用自定义指令":["21.7"],"最全前端代码":["24.0"],"vue3响应式proxy":["25.0"],"创建对象":["28.0"],"直接创建":["28.1"],"new":["28.2"],"工厂方法1":["28.3"],"工厂方法2":["28.4"],"构造函数":["28.5"],"原型":["28.6"],"排序算法":["29.0"],"冒泡":["29.1"],"选择排序":["29.2"],"插入排序":["29.3"],"希尔排序":["29.4"],"快速排序":["29.5"],"哈希表":["30.0"],"哈希函数":["30.1"],"put":["30.2"],"get":["30.3","33.5"],"remove":["30.4","33.8"],"判断质数":["30.5"],"得到质数":["30.6"],"其他":["30.7"],"栈":["31.0"],"例子":["31.1","35.2"],"二叉搜索树":["32.0"],"什么是二叉搜索树":["32.1"],"二叉搜索树的特点":["32.2"],"二叉搜索树常见的操作":["32.3"],"创建二叉搜索树":["32.4"],"insert":["32.5","33.4"],"遍历二叉搜索树":["32.6"],"先序遍历":["32.7"],"中序遍历":["32.8"],"后序遍历":["32.9"],"最大最小值":["32.10"],"查找特定值":["32.11"],"二叉搜索树的删除":["32.12"],"情况一":["32.13"],"情况二":["32.14"],"情况三":["32.15"],"删除节点完整代码":["32.16"],"链表":["33.0"],"js普通构造函数":["33.1"],"增":["33.2"],"tostring":["33.3","37.2"],"indexof":["33.6"],"update":["33.7"],"removedata":["33.9"],"isempty":["33.10"],"js普通构造函数版本code":["33.11"],"class语法糖版本code":["33.12"],"优先级队列":["34.0"],"普通构造函数封装":["34.1","35.1"],"class语法糖封装":["34.2"],"队列":["35.0"],"array":["36.1","36.2","36.3","36.4","36.5","36.6","36.7","36.8","36.9","36.10","36.11","36.12","36.13","36.14","36.15","36.16","36.17","36.18","36.19","36.20","36.21","36.22","36.23","36.24","36.25","36.26","36.27","36.28","36.29","36.30","36.31","36.32"],"数组扁平化":["37.0"],"flat":["37.1"],"递归":["37.3"],"一层":["37.4"],"多层":["37.5"],"foreach递归":["37.6"],"reduce递归":["37.7"],"reduce":["38.0"],"累加":["38.1"],"最大值":["38.2"],"数组去重":["38.3"],"分类":["38.4"],"翻转字符串":["38.5"],"流光按钮":["39.0"],"展示效果":["39.1"],"全局挂载":["39.2","40.2","42.2"],"局部挂载":["39.3","40.3","42.3"],"禁用":["39.4","40.7"],"button":["40.0"],"效果展示":["40.1","42.1"],"类型":["40.4"],"朴素按钮":["40.5"],"圆角":["40.6"],"给按钮添加icon":["40.8"],"安装":["41.0"],"icon":["42.0"],"徽标提示":["42.4"],"颜色":["42.5"],"使用":["42.6"],"logo":["42.7"],"链接":["42.8"],"筛选":["42.9"],"点赞收藏":["42.10"],"声音":["42.11"],"箭头":["42.12"],"分享":["42.13"],"删除":["42.14"],"编写文字":["42.15"],"设置帮助":["42.16"],"bilibili错题":["43.0"],"定时器":["43.1"],"哪个样式在现代浏览器默认样式下设置宽度不生效":["43.2"],"obj对象里的箭头函数的this指向的是obj的上下文":["43.4"],"input标签的输入类型":["43.5"],"状态码":["43.6"],"影响原数组":["43.7"],"promise的catch":["43.9"],"对象键值":["43.10"],"分析":["43.11"],"总结":["43.12"],"let":["43.13"],"过渡效果transition":["43.14"],"input":["43.15"],"定位的top属性":["43.16"],"取余":["43.17"],"三栏布局":["43.18"],"leecode":["43.19"],"错题集":["44.0"],"介绍":["46.0"],"快速开始":["47.0"]},{"0":["1.7","10.40","13.2","29.2","33.11","33.12","34.1","36.13"],"1":["1.1","1.5","1.6","1.7","1.8","1.10","2.5","2.7","3.1","3.2","3.3","3.4","3.5","4.0","5.3","5.4","5.7","5.8","5.9","5.15","6.1","6.13","6.14","6.15","6.16","6.17","6.19","7.2","7.5","8.2","9.9","9.10","9.11","9.15","9.17","9.18","9.19","10.1","10.7","10.12","10.13","10.14","10.21","10.28","10.35","10.36","10.39","10.40","10.51","10.64","10.65","10.79","11.3","12.0","12.2","12.3","12.4","12.5","12.6","12.8","13.2","15.0","15.1","15.2","15.3","15.4","15.5","15.8","15.9","17.22","17.32","18.6","18.7","18.8","18.10","18.11","19.3","19.6","19.7","19.9","19.12","19.14","19.15","19.19","19.20","19.24","19.25","19.30","20.11","20.13","20.14","20.24","20.25","20.26","20.27","20.34","21.3","32.2","32.4","32.11","32.12","32.15","38.4","43.2","43.12","43.13","43.17"],"2":["1.2","1.11","2.7","3.6","4.0","6.2","6.13","8.2","9.15","10.2","11.3","12.8","15.6","17.32","18.8","20.13","32.4","32.12","43.13"],"3":["1.4","1.12","3.7","6.3","8.2","9.15","10.3","12.8","17.16","18.8","20.13","32.12"],"4":["1.9","3.8","6.4","9.15","10.4"],"5":["1.13","3.9","6.5","9.15"],"6":["1.14","3.10","6.6","43.17"],"7":["1.15","3.11","6.7"],"8":["1.16","1.17","3.12","6.8"],"9":["1.18","3.13","6.9"],"10":["1.19","6.10"],"11":["1.20","6.11"],"12":["1.21","6.14"],"13":["2.0","6.18"],"14":["2.1"],"15":["2.2"],"16":["2.3"],"17":["2.4"],"18":["2.5"],"19":["2.6"],"20":["2.7"],"100":["2.7"],"123":["43.10"],"200":["9.15"],"201":["9.15"],"202":["9.15"],"203":["9.15"],"204":["9.15"],"279":["43.19"],"405":["43.6"],"常见的水平垂直居中实现方案":["1.1"],"最简单的方案当然是flex布局":["1.1"],"css":["1.1","2.7","16.0"],"father":["1.1"],"display":["1.1","1.10","43.2"],"bfc问题":["1.2"],"触发bfc的元素":["1.2"],"auto":["1.6"],"none":["1.8","1.10"],"常规方法":["1.10"],"结构消失":["1.10"],"逃逸视窗":["1.11"],"position":["1.11","1.19","33.4","33.8"],"移行变换":["1.12"],"vw":["1.14"],"flex":["1.15"],"布局如何使用":["1.15"],"是":["1.15","15.7"],"grid布局":["1.16"],"如何用":["1.17"],"居中为什么要使用":["1.18"],"transform":["1.18","6.15"],"为什么不使用":["1.18"],"marginleft":["1.18"],"介绍下粘性布局":["1.19"],"sticky":["1.19"],"说出":["1.20"],"css3":["1.21","2.6"],"中":["1.21"],"transition":["1.21"],"和":["1.21","10.74","11.22","17.24","19.27"],"animation":["1.21"],"的属性分别有哪些":["1.21"],"path":["1.22","43.8"],"如何实现一个自适应的正方形":["2.1"],"清除浮动的方法":["2.2"],"clear":["2.2","33.10"],"清除浮动":["2.2"],"如何触发重排和重绘":["2.4"],"如何优化图片":["2.5"],"对于很多装饰类图片":["2.5"],"新增了那些东西":["2.6"],"选择器":["2.6"],"盒子模型属性":["2.6"],"实现三栏布局的7种方法":["2.7"],"浮动float":["2.7"],"calc":["2.7"],"div":["2.7","6.3"],"height":["2.7"],"100px":["2.7"],"left":["2.7"],"float":["2.7"],"width":["2.7"],"200px":["2.7"],"background":["2.7"],"color":["2.7","42.1"],"red":["2.7","42.1"],"middle":["2.7"],"400px":["2.7"],"green":["2.7"],"right":["2.7"],"blue":["2.7"],"margin":["2.7"],"负值":["2.7"],"新增了let":["3.6"],"const关键字":["3.6"],"作用域":["3.7"],"常见的作用域主要分为几个类型":["3.7"],"全局作用域":["3.7"],"新增了箭头函数":["3.9"],"es6新增了模块化":["3.12"],"新增简单数据类型symbol":["4.0"],"用于表示一个独一无二的值":["4.0"],"js":["4.0","10.3","10.25","10.31","10.48","10.49","10.51","10.56","10.57","10.61","10.64","10.65","10.71","11.26","12.1","12.3","12.5","12.6","12.7","12.8","13.2","14.0","14.1","14.3","17.3","17.4","17.7","17.23","19.20","20.4","20.8","20.9","20.15","20.17","20.19","20.21","20.29","20.32","21.3","21.6","22.0","25.0","26.0","28.1","28.3","28.4","28.5","28.6","29.1","29.3","29.5","30.1","30.2","30.3","30.4","30.5","30.6","30.7","31.0","31.1","32.5","32.7","32.8","32.9","32.10","32.11","32.16","33.1","33.2","33.3","33.4","33.5","33.6","33.7","33.8","33.9","33.10","33.11","33.12","34.1","34.2","35.1","35.2","36.17","37.0","37.1","37.2","37.4","37.5","37.6","37.7","38.1","38.2","38.3","38.4","38.5","39.2","39.3","40.2","40.3","42.2","42.3","43.1","43.10"],"const":["4.0","10.64","12.3","12.5","12.6","12.7","12.8","17.17","20.17","20.19","21.3","22.0","26.0","35.2","37.6","37.7","38.4"],"a":["4.0","10.3","10.26","13.2","17.1","20.17","29.2","42.12","43.10"],"symbol":["4.0","10.3","11.18"],"symbol创建实例不需要new":["4.0"],"console":["4.0","10.65","12.1"],"log":["4.0","10.65","12.1"],"不能在调用symbol时使用new关键字":["4.0"],"因为symbol是基本数据类型":["4.0"],"而不是对象":["4.0"],"唯一性":["4.0"],"使用symbol":["4.0"],"创建一个symbol类型的值并赋值给a变量后":["4.0"],"你就得到了一个在内存中独一无二的值":["4.0"],"数据类型的修饰":["4.0"],"文档对象模型":["5.1"],"从网络传给渲染引擎的":["5.1"],"树如何生成":["5.2"],"渲染引擎内部":["5.2"],"有一个叫html":["5.2"],"解析器":["5.2"],"htmlparser":["5.2"],"的模块":["5.2"],"它的职责就是负责将html":["5.2"],"字节流转换为":["5.2"],"结构":["5.2"],"html":["5.2","16.0"],"解析器并不是等整个文档加载完成之后再解析的":["5.2"],"而是网络进程加载了多少数据":["5.2"],"解析器便解析多少数据":["5.2"],"网络进程接收到响应头之后":["5.2"],"执行到":["5.4"],"javascript":["5.4","5.5","5.6"],"dom":["5.6","5.13","5.14","5.16","10.74","19.32","21.3"],"的过程中":["5.6"],"如果遇到了":["5.6"],"脚本":["5.6"],"那么需要先暂停":["5.6"],"解析去执行":["5.6"],"文档解析完毕":["5.7"],"加载js然后html和css":["5.9"],"构建":["5.10"],"树是":["5.11"],"的解析注意点":["5.12"],"操作真实":["5.13"],"的代价":["5.13"],"就是一个js对象模拟的dom树":["5.14"],"参考这篇":["5.14"],"虚拟":["5.14"],"就是为了解决浏览器性能问题而被设计出来的":["5.14"],"dom的实现":["5.15"],"模拟":["5.17"],"什么是":["6.1"],"title":["6.2"],"与":["6.2","10.24","10.27","10.58","11.22"],"h1":["6.2"],"行内元素和块级元素分别有哪些":["6.3"],"有何区别":["6.3"],"怎样转换":["6.3"],"常见的块级元素":["6.3"],"p":["6.3"],"label的作用是什么":["6.4"],"是怎么用的":["6.4"],"label元素不会向用户呈现任何特殊效果":["6.4"],"但是":["6.4"],"a元素除了用于导航外":["6.5"],"还有什么作用":["6.5"],"怎么处理html5新标签兼容问题":["6.7"],"html5新增了哪些新特性":["6.8"],"移除了哪些元素":["6.8"],"html5主要是关于图像":["6.8"],"位置":["6.8"],"网页的渲染":["6.9"],"渲染树":["6.10"],"当页面发生变化时浏览器会对页面重新绘制":["6.12"],"避免频繁使用":["6.13"],"style":["6.13"],"而是采用修改class的方式":["6.13"],"使":["6.13"],"合成层":["6.14"],"设置":["6.15"],"层隐式合成的例子":["6.16"],"同合成层重叠也会使元素提升为合成层":["6.17"],"谈谈html语义化":["6.18"],"页面结构":["6.19"],"使页面没有css的情况下":["6.19"],"seo":["7.1"],"所以要在title里面言简意赅的体现出页面的主要内容":["7.3"],"关键词密度":["7.4"],"页面上经常会有各种图片":["7.5"],"对于搜索引擎来说":["7.5"],"它是不识别图片上的内容的":["7.5"],"你可能知道代码中img标签的alt属性是为了图片加载失败的时候":["7.5"],"web标准简单来说可以分为结构":["8.1"],"需要声明":["8.2"],"doctype":["8.2"],"需要定义语言编码":["8.2"],"标签规范可以提高搜索引擎对页面的抓取效率":["8.3"],"对seo":["8.3"],"http":["9.1"],"hypertext":["9.1"],"transfer":["9.1"],"protocal":["9.1"],"全称为超文本传输协议":["9.1"],"支持客户端":["9.2"],"服务端模式":["9.2"],"简单快速":["9.2"],"ip":["9.3"],"http协议传输的数据都是未加密的":["9.4"],"也就是明文的":["9.4"],"可以用抓包工具直接抓下来并且可见":["9.4"],"而https则是利用了网景公司设计的ssl":["9.4"],"secure":["9.4"],"0与http2":["9.5"],"协议":["9.6"],"请求行包括三个方面":["9.8"],"请求方法":["9.8"],"请求地址":["9.8"],"协议版本":["9.8"],"方法名":["9.8"],"功能":["9.8"],"get":["9.8","9.9","20.33"],"向指定的资源发出":["9.8"],"一般用于信息获取":["9.9"],"使用url传递参数并且可见":["9.9"],"无法使用缓存文件":["9.10"],"请求头可用于传递一些附加信息":["9.11"],"格式为":["9.11"],"键":["9.11"],"值":["9.11"],"注意":["9.11","10.72"],"冒号后面有一个空格":["9.11"],"常见的请求":["9.11"],"header":["9.11"],"名称":["9.11"],"作用":["9.11","10.66","10.67"],"authorization":["9.11"],"用于设置身份认证信息":["9.11"],"user":["9.11"],"又叫请求正文":["9.12"],"http响应报文分为三个部分":["9.13"],"状态码":["9.14"],"对应的信息":["9.14"],"2xx":["9.15"],"成功":["9.15"],"服务器已成功处理了请求":["9.15"],"通常":["9.15"],"这表示服务器提供了请求的网页":["9.15"],"已创建":["9.15"],"请求成功并且服务器创建了新的资源":["9.15"],"已接受":["9.15"],"服务器已接受请求":["9.15"],"但尚未处理":["9.15"],"非授权信息":["9.15"],"但返回的信息可能来自另一来源":["9.15"],"无内容":["9.15"],"服务器成功处理了请求":["9.15"],"响应体":["9.16"],"参考这篇博文":["9.17"],"解析":["9.18"],"查询":["9.19"],"连接":["9.20"],"服务器处理收到的请求":["9.21"],"浏览器解码响应":["9.22"],"建立连接是三次握手":["9.24"],"three":["9.25"],"way":["9.25","9.26"],"handshake":["9.25","9.26"],"tcp":["9.26"],"的连接的拆除需要发送四个包":["9.26"],"因此称为四次挥手":["9.26"],"four":["9.26"],"js数据类型判断":["10.3"],"typeof":["10.3","17.32"],"检测基础数据类型和函数很好用":["10.3"],"它能准确判断出的数据类型有":["10.3"],"number":["10.3","10.24","17.11"],"string":["10.3","17.1","17.3","17.4","17.11","17.21"],"boolean":["10.3","17.11"],"undefined":["10.3","13.2"],"bigint":["10.3"],"function":["10.3","10.25","10.65","17.2","17.3","17.21","17.32","20.8","20.15","20.29","20.32","25.0","28.3","28.4","28.5","29.1","29.5","30.1","30.2","30.3","30.4","30.7","31.0","31.1","32.5","32.9","32.11","32.16","33.1","33.4","33.8","33.9","33.11","33.12","34.1","35.1","35.2","37.2","37.5","38.0"],"它的缺点就是不能准确判断":["10.3"],"null":["10.3","10.33","10.36","11.13","25.0","32.16","33.11","33.12"],"的类型":["10.3"],"而是返回":["10.3"],"object":["10.3","10.60","10.73","10.74","11.6","11.12","11.15","17.11","17.32","20.9","20.16","28.2"],"对于数组":["10.3"],"日期":["10.3"],"普通对象等数据":["10.3"],"统一返回":["10.3"],"所以在判断基本数据类型":["10.3"],"除了":["10.3"],"和函数类型时":["10.3"],"都会使用它":["10.3"],"num":["10.3","35.2"],"str":["10.3"],"true":["10.3","10.39","11.22","13.2","32.16"],"false":["10.3","11.22"],"func":["10.3"],"有":["10.5"],"如果一个script加了defer属性":["10.6"],"class类里的函数默认是严格模式":["10.9"],"执行机制":["10.10"],"同步任务执行完":["10.11"],"就会去任务队列中拿一个宏任务放到执行栈中执行":["10.11"],"执行完该宏任务中的所有微任务":["10.11"],"再到任务队列中拿宏任务":["10.11"],"同步任务":["10.12"],"指排队在主线程上依次执行的任务":["10.12"],"事件循环由宏任务和在":["10.13"],"settimeout的回调不一定在指定时间后能执行":["10.14"],"永远大于":["10.15"],"深拷贝是将一个对象从内存中完整的拷贝一份出来":["10.17"],"如果属性是基本类型":["10.18"],"赋值":["10.19"],"新对象改变":["10.19"],"比如":["10.20"],"从全局对象":["10.22"],"window":["10.22"],"函数在执行时":["10.23"],"isnan的区别":["10.24"],"找到静态方法定义在实例对象上的属性":["10.25"],"找不到实例方法定义在原型对象上的属性":["10.25"],"person":["10.25","10.65","17.19"],"tostring":["10.27","11.30","36.32"],"把基本数据类型转化为对应的引用数据类型的操作":["10.30"],"将引用数据类型转化为对应的基本数据类型的操作":["10.31"],"通过valueof或者tostring方法实现拆箱操作":["10.31"],"var":["10.31","11.26","33.4","33.11","33.12","43.10","43.13"],"objnum":["10.31"],"new":["10.31","10.64","12.3","12.5","12.8","25.0","33.11"],"都是空变量":["10.32"],"都是假值":["10.32"],"的区别":["10.34","10.58"],"按照双等号左右两边的转换规则":["10.39"],"匿名函数":["10.41"],"三种":["10.42"],"第三个变量传一个布尔值":["10.43"],"函数声明":["10.44","17.2"],"享受函数提升":["10.44"],"函数表达式":["10.44"],"事件冒泡":["10.45"],"axios":["10.46"],"document":["10.47","15.4"],"ready":["10.47"],"当所有子元素都需要绑定相同的事件的时候":["10.50"],"使用":["10.51","39.4"],"map":["10.51","10.56","10.61","36.9"],"去重":["10.51"],"是一种叫做集合的数据结构":["10.52"],"向":["10.52"],"加入值的时候":["10.52"],"不会发生类型转换":["10.52"],"实例属性":["10.53"],"constructor":["10.53","10.59","20.4","20.9","33.12","34.2"],"构造函数":["10.53","10.59"],"实例方法":["10.54","12.4"],"delete":["10.54"],"value":["10.54","20.9","20.26","30.2","34.2"],"存在即删除集合中value":["10.54"],"has":["10.54"],"array":["10.55","10.66"],"from方法可以将":["10.55"],"set":["10.55","10.57","20.22"],"结构转为数组":["10.55"],"filter":["10.56","36.14"],"方法":["10.56","10.66","10.67"],"很容易实现交集":["10.57"],"intersect":["10.57"],"并集":["10.57"],"union":["10.57"],"差集":["10.57"],"difference":["10.57"],"字典":["10.58"],"参考":["10.58","10.63","10.80","17.0","43.2"],"集合":["10.58"],"size":["10.59","33.10"],"转":["10.60","10.61"],"有什么特点":["10.62"],"object创建":["10.64"],"obj":["10.64","11.6","11.26","17.32","20.17"],"new操作符创建实例":["10.65"],"name":["10.65","17.19","19.20","40.8","42.1","42.7","42.8","42.9","42.10","42.12","42.13","42.14","42.15","42.16"],"this":["10.65","20.4","20.9","30.7","31.0","32.16","33.11","33.12","34.1","34.2","35.1"],"是否影响原数组":["10.66"],"push":["10.66","31.0","34.2","36.19"],"在数组后添加元素":["10.66"],"返回数组长度":["10.66"],"math":["10.67"],"max":["10.67"],"如何解决":["10.68"],"在js中有三种类型的弹出框可用":["10.70"],"日期转换为iso标准":["10.71"],"toisostring":["10.71"],"url":["10.72"],"encodeuri":["10.72"],"函数用于在js中对url进行编码":["10.72"],"它将url字符串作为参数并返回编码的字符串":["10.72"],"有哪些api":["10.73"],"bom就是browser":["10.73"],"model":["10.73"],"浏览器对象模型":["10.73"],"api":["10.73","20.17"],"的关系":["10.74"],"bom全称browser":["10.74"],"和substring":["10.75"],"函数的形式为substr":["10.76"],"函数的形式为substring":["10.77"],"use":["10.78"],"input":["10.79"],"prototype":["11.0","11.4","11.13","11.14","11.15","11.20","11.28","11.30","11.31","30.2","30.3","30.4","30.7","31.0","32.5","32.7","32.8","32.9","32.10","32.11","32.16","33.2","33.4","33.5","33.6","33.7","33.8","33.9","33.11","34.1","35.1","36.1","36.2","36.3","36.4","36.5","36.6","36.7","36.8","36.9","36.10","36.11","36.12","36.13","36.14","36.17","36.18","36.19","36.20","36.21","36.22","36.23","36.24","36.25","36.26","36.27","36.28","36.29","36.30","36.31","36.32","43.3"],"在":["11.1","17.9","19.21","20.24"],"创建一个新的":["11.2"],"assign":["11.3"],"通过复制一个或多个对象来创建一个新的对象":["11.3"],"浅拷贝":["11.3"],"create":["11.4"],"方法用于创建一个新的实例对象":["11.4"],"使用现有的对象来作为新创建实例对象的原型对象":["11.4"],"新创建实例对象":["11.4"],"proto":["11.4"],"defineproperty":["11.5","11.6","19.27","20.7","20.15"],"prop":["11.6","17.32"],"descriptor":["11.6"],"defineproperties":["11.7"],"给对象添加多个属性并分别指定它们的配置":["11.7"],"entries":["11.8","36.24"],"方法返回一个给定对象自身可枚举属性的键值对数组":["11.8"],"freeze":["11.9"],"fromentries":["11.10"],"getprototypeof":["11.11","11.12"],"要返回其原型的对象":["11.12"],"setprototypeof":["11.13"],"方法设置一个指定的对象的原型":["11.13"],"即":["11.13"],"内部":["11.13"],"属性":["11.13","20.4","20.21","40.8"],"到另一个对象或":["11.13"],"isprototypeof":["11.14"],"方法用于测试一个对象是否存在于另一个对象的原型链上":["11.14"],"针对对象本身":["11.14"],"不是":["11.14"],"对象":["11.14","20.19","20.21"],"prototypeobj":["11.14"],"运算符用于检测构造函数的":["11.15"],"属性是否出现在某个实例对象的原型链上":["11.15"],"在表达式":["11.15"],"getownpropertydescriptor":["11.16"],"方法返回指定对象上一个自有属性对应的属性描述符":["11.16"],"getownpropertynames":["11.17"],"getownpropertysymbols":["11.18"],"方法返回一个给定对象自身的所有":["11.18"],"属性的数组":["11.18"],"hasown":["11.19"],"如果指定的对象自身":["11.19"],"有指定的属性":["11.19"],"则":["11.19"],"静态方法":["11.19","12.8"],"hasownproperty":["11.20"],"方法会返回一个布尔值":["11.20"],"指示对象自身属性中是否具有指定的属性":["11.20"],"也就是":["11.20"],"是否有指定的键":["11.20"],"is":["11.21","11.22"],"方法判断两个值是否为同一个值":["11.21"],"不同":["11.22"],"运算符在判断相等前对两边的变量":["11.22"],"如果它们不是同一类型":["11.22"],"进行强制转换":["11.22"],"这种行为将":["11.22"],"判断为":["11.22"],"而":["11.22"],"isextensible":["11.23"],"isfrozen":["11.24"],"keys":["11.25","20.9","36.22"],"values":["11.26","36.23"],"方法返回一个给定对象自身的所有可枚举属性值的数组":["11.26"],"值的顺序与使用":["11.26"],"for":["11.26"],"in":["11.26"],"循环的顺序相同":["11.26"],"区别在于":["11.26"],"循环枚举原型链中的属性":["11.26"],"foo":["11.26"],"preventextensions":["11.27"],"seal":["11.29"],"方法返回一个表示该对象的字符串":["11.30"],"该方法旨在重写":["11.30"],"自定义":["11.30"],"派生类对象的类型转换的逻辑":["11.30"],"默认情况下":["11.30"],"valueof":["11.31"],"的":["11.31"],"promise是es6处理异步的一种方式":["12.0"],"它的本质是一个对象":["12.0"],"一":["12.1"],"promise":["12.1","12.3","12.5","12.6","12.8"],"then":["12.1"],"res":["12.1"],"catch":["12.1"],"err":["12.1"],"它有三种状态分别为":["12.2"],"初始状态pending":["12.2"],"已完成fulfilled":["12.2"],"已失败rejected":["12.2"],"如果resolve传入一个普通的值或者对象":["12.3"],"只能传递接受一个参数":["12.3"],"那么这个值会作为then回调的参数":["12.3"],"resolve":["12.3","12.5","12.8"],"then方法可以接受参数":["12.5"],"一个参数为成功的回调":["12.5"],"另一个参数为失败的回调":["12.5"],"reject":["12.5","12.8"],"request":["12.5"],"catch的多次调用":["12.6"],"无论promise状态是fulfilled还是rejected都会执行一次finally方法":["12.7"],"ice":["12.8"],"等价于":["12.8"],"error":["12.8"],"all":["12.8"],"fulfilled状态":["12.8"],"promise1":["12.8"],"settimeout":["12.8","43.1"],"相等运算符":["13.1","13.2"],"最终转换为数字进行比较":["13.2"],"nan":["13.2"],"如何处理":["14.1"],"es6":["14.1","14.4"],"语法上面":["14.2"],"commonjs":["14.2","14.4"],"node":["14.3","33.11","33.12"],"要求":["14.3"],"模块import命令":["14.4"],"可以":["14.4"],"是在package":["14.5"],"json文件的exports字段":["14.5"],"指明两种格式模块各自的加载入口":["14.5"],"cookie":["15.4"],"cookie的创建":["15.4"],"修改和创建相同":["15.4"],"创建同样名称会覆盖之前的":["15.4"],"username":["15.4"],"john":["15.4"],"使用token机制的身份验证方法":["15.8"],"客户端使用用户名和密码请求登录":["15.8"],"客户端":["15.8"],"这里是":["16.0"],"的面试题":["16.0"],"ts":["17.1","17.2","17.6","17.10","17.13","17.17","17.19","17.20","17.21","17.25","17.32"],"let":["17.1","17.6","17.10","17.13","25.0","30.2","30.4","32.16","37.4","38.1","38.2","38.3","38.5"],"arr":["17.1","29.1","31.0","34.1","34.2","35.1","37.4","37.5","37.6","37.7"],"sun":["17.2"],"可选参数":["17.3"],"buildnmae":["17.3"],"firstname":["17.3"],"函数重载或方法重载是使用相同名称和不同参数数量或类型创建多个方法的一种能力":["17.4"],"方法就是为同一个函数提供多个函数类型定义来进行函数重载":["17.4"],"编译器会根据这个列表去处理函数的调用":["17.4"],"type":["17.4","17.24","40.1","43.15"],"combinable":["17.4"],"元组是":["17.5"],"typescript":["17.5","17.16","17.17","17.24","17.32"],"中特有的类型":["17.5"],"void表示没有任何类型":["17.7"],"和其他类型是平等关系":["17.7"],"不能直接赋值":["17.7"],"never类型表示的是那些永不存在的值的类型":["17.8"],"值会永不存在的两种情况":["17.8"],"如果一个函数执行时抛出了异常":["17.8"],"那么这个函数永远不存在返回值":["17.8"],"因为抛出异常会直接中断程序运行":["17.8"],"这使得程序运行不到返回值那一步":["17.8"],"即具有不可达的终点":["17.8"],"也就永不存在返回了":["17.8"],"函数中执行无限循环的代码":["17.8"],"死循环":["17.8"],"unknown与any一样":["17.10"],"所有类型都可以分配给unknown":["17.10"],"unknown与any的最大区别是":["17.10"],"任何类型的值可以赋值给any":["17.10"],"同时any类型的值也可以赋值给任何类型":["17.10"],"任何类型的值都可以赋值给它":["17.10"],"但它只能赋值给unknown和any":["17.10"],"notsure":["17.10"],"小":["17.11"],"代表的是所有非原始类型":["17.11"],"也就是说我们不能把":["17.11"],"我们把":["17.12"],"尖括号":["17.13"],"语法":["17.13"],"在上下文中当类型检查器无法断定类型时":["17.14"],"一个新的后缀表达式操作符":["17.14"],"允许在实例属性和变量声明后面放置一个":["17.15"],"号":["17.15"],"从而告诉":["17.15"],"支持":["17.16"],"将":["17.17"],"定义为一个不可变更的常量":["17.17"],"在缺省类型注解的情况下":["17.17"],"推断出它的类型直接由赋值字面量的类型决定":["17.17"],"在面向对象语言中":["17.18"],"只读属性":["17.19"],"interface":["17.19","17.21","17.23"],"readonly":["17.19","20.25"],"有时候我们希望一个接口中除了包含必选和可选属性之外":["17.20"],"还允许有其他的任意属性":["17.20"],"这时我们可以使用":["17.20"],"索引签名":["17.20"],"的形式来满足上述要求":["17.20"],"所谓的鸭式辨型法就是像鸭子一样走路并且嘎嘎叫的就叫鸭子":["17.21"],"即具有鸭子特征的认为它就是鸭子":["17.21"],"也就是通过制定规则来判定对象是否实现这个接口":["17.21"],"labeledvalue":["17.21"],"label":["17.21"],"props":["17.23","19.36"],"functions":["17.25"],"两者都可以用来描述对象或函数的类型":["17.25"],"但是语法不同":["17.25"],"types":["17.26"],"与接口不同":["17.26"],"类型别名还可以用于其他类型":["17.26"],"如基本类型":["17.26"],"原始值":["17.26"],"类型别名不可以":["17.27"],"与类型别名不同":["17.27"],"两者的扩展方式不同":["17.28"],"但并不互斥":["17.28"],"接口可以扩展类型别名":["17.28"],"同理":["17.28"],"类型别名也可以扩展接口":["17.28"],"接口的扩展就是继承":["17.28"],"通过":["17.28","20.17"],"用了一个":["17.29"],"类型":["17.29"],"t":["17.29","17.32"],"这个":["17.29"],"类型约束使用":["17.30"],"extends":["17.30","17.32"],"关键字":["17.30"],"的主要用途是在类型上下文中获取变量或者属性的类型":["17.32"],"keyof":["17.32"],"操作符是在":["17.32"],"版本引入的":["17.32"],"该操作符可以用于获取某种类型的所有键":["17.32"],"其返回类型是联合类型":["17.32"],"k":["17.32"],"key":["17.32","20.33","30.2","30.4","32.3","32.5","32.11","32.16"],"return":["17.32","19.20","30.7","34.1","34.2"],"在以上代码中":["17.32"],"我们使用了":["17.32"],"的泛型和泛型约束":["17.32"],"首先定义了":["17.32"],"类型并使用":["17.32"],"关键字约束该类型必须是":["17.32"],"router":["18.0","18.1"],"router是什么":["18.2"],"描述一下它的原理":["18.2"],"vue":["18.3","19.12","21.0","21.1"],"即url中的":["18.4"],"以及后面部分":["18.4"],"html5":["18.5"],"mode是html5新增":["18.5"],"所以也称为history":["18.5"],"为什么":["18.7"],"如果需要用户登陆":["18.7"],"我们来守卫页面":["18.7"],"强制用户跳转到登录页面":["18.7"],"路由守卫分为全局路由守卫":["18.7"],"路由独享守卫":["18.7"],"组件路由守卫":["18.7"],"全局路由守卫":["18.7"],"全局前置守卫beforeeach":["18.7"],"导航被触发":["18.8"],"在失活的组件里调用":["18.8"],"beforerouteleave":["18.8"],"守卫":["18.8"],"为给客户更好的客户体验":["18.9"],"router路由懒加载的方式":["18.11"],"router配置路由":["18.11"],"将任意信息附加到路由上":["18.12"],"有时候":["18.13"],"进入某个路由后":["18.13"],"单页应用":["19.1"],"vue2":["19.2","19.18"],"选项式api":["19.2"],"vue3":["19.2","19.18"],"渲染过程":["19.3"],"父beforecreate":["19.3"],"如果子组件是异步组件的话它们的执行顺序会发生改变":["19.4"],"if和v":["19.5"],"for和v":["19.6"],"if优先级":["19.6"],"computed是计算属性":["19.7"],"当一个属性受一个或者多个属性影响的时候可以使用":["19.7"],"watch是侦听器":["19.7"],"当我们需要根据一个属性的变化而做出一些处理的时候":["19.7"],"computed和methods的差异是它具备缓存性":["19.8"],"计算属性computed常用场景是简化在template模板中的复杂表达式":["19.9"],"computed":["19.10","19.12","19.13"],"一种是方法":["19.11"],"在创建":["19.12"],"属性时候":["19.12"],"遍历computed属性":["19.12"],"为每个computed属性都创建一个watcher":["19.12"],"watch":["19.14"],"写法上的区别":["19.15"],"vue2使用的是options":["19.15"],"选项":["19.15"],"将组件实例挂载到全局":["19.16"],"插槽slot可以理解为占坑":["19.17"],"当使用一个组件的时候":["19.17"],"在组件标签里的对应的":["19.17"],"内容就会替换":["19.17"],"掉这个组件中的":["19.17"],"slot标签":["19.17"],"插槽分为默认插槽":["19.17"],"具名插槽":["19.17"],"作用域插槽":["19.17"],"默认插槽":["19.17"],"子组件中用slot标签来确定渲染位置":["19.17"],"方式":["19.18"],"父传子":["19.18","19.36"],"vuex是vue中的全局状态管理框架":["19.19"],"它可以管理应用的所有组件的状态":["19.19"],"并不是每个项目都需要引入vuex的":["19.19"],"创建store":["19.20"],"import":["19.20","39.2","40.2","40.3","42.2"],"definestore":["19.20"],"from":["19.20","36.15","39.2","40.2","42.2"],"exporet":["19.20"],"default":["19.20"],"mystore":["19.20"],"id":["19.20"],"ljt":["19.20"],"state":["19.20","20.21"],"孙悟空":["19.20"],"action":["19.21"],"里调用其他":["19.21"],"store":["19.21"],"里的":["19.21"],"也比较简单":["19.21"],"引入对应的":["19.21"],"alive":["19.23"],"keepalive":["19.23"],"是一个内置组件":["19.23"],"它的功能是在多个组件间动态切换时缓存被移除的组件实例":["19.23"],"首次执行执行顺序":["19.24"],"mixin":["19.26"],"混入":["19.26"],"proxy":["19.27","20.17","20.19"],"vue3新增了两个内置组件分别是teleport和suspense":["19.28"],"可以称之为传送门":["19.29"],"作用将其插槽内容渲染到":["19.29"],"suspense":["19.30"],"在下次":["19.32"],"diff算法":["19.33"],"每当我们用原生js或者jq操作dom时":["19.34"],"对比两棵vdom":["19.35"],"树":["19.35"],"找到有差异的部分":["19.35"],"透传":["19.36"],"在父组件里引用的子组件上使用":["19.36"],"v":["19.36"],"bind":["19.36"],"定义一个方法":["19.37"],"将参数hide传递给父组件":["19.37"],"父组件通过":["19.37"],"的响应式":["20.0"],"当对象之间存在一对多的依赖关系时":["20.2"],"其中一个对象的状态发生改变":["20.2"],"基于一个事件":["20.3"],"主题":["20.3"],"通道":["20.3"],"希望接收通知的对象":["20.3"],"大意":["20.4"],"通过observe里的definereactive方法里面的object":["20.4"],"defineproperty方法的get":["20.4"],"读取数据触发":["20.4"],"收集依赖":["20.4"],"和set":["20.4"],"修改数据触发":["20.4"],"派发更新依赖":["20.4"],"进行响应式的绑定":["20.4"],"在set里数据变了":["20.4"],"监听到了就去更新视图":["20.4"],"details":["20.4","33.11","33.12"],"显示代码":["20.4"],"响应式数据处理":["20.4"],"构造一个响应式对象":["20.4"],"class":["20.4","20.9","33.12","34.2"],"observer":["20.4","20.9"],"data":["20.4","20.8","33.4","33.9","33.11","33.12"],"walk":["20.4","20.9"],"遍历对象的每个":["20.4"],"已定义":["20.4"],"分别执行":["20.4"],"响应系统":["20.5"],"其核心有三点":["20.5"],"observe":["20.5","20.6"],"响应式":["20.5"],"watcher":["20.5","20.11"],"数据劫持":["20.7"],"数据代理":["20.7"],"被object":["20.7"],"defineproperty绑定过的对象":["20.7"],"我们需要一个全局的变量来保存这个属性的值":["20.8"],"value使用了参数默认值":["20.8"],"如果obj有多个属性呢":["20.9"],"我们可以新建一个类observer来遍历该对象":["20.9"],"vue中用observer类来管理上述响应式化object":["20.9"],"defineproperty的过程":["20.9"],"改写了array":["20.10"],"dep收集的依赖就是watcher":["20.11"],"watcher订阅一个或多个数据":["20.12"],"直接渲染render":["20.13"],"有通过computed计算属性改变":["20.13"],"常见的场景有下面这几个":["20.13"],"数据变":["20.13"],"使用数据的视图变":["20.13"],"使用数据的计算属性变":["20.13"],"使用计算属性的视图变":["20.13"],"dep":["20.14"],"使用发布订阅者模式":["20.14"],"每个属性拥有自己的消息订阅器":["20.14"],"dep类里的this":["20.14"],"subs":["20.14"],"我们如何知道data中的某个属性被使用了":["20.15"],"答案就是object":["20.15"],"因为读取某个属性就会触发get方法":["20.15"],"可以将代码进行如下改造":["20.15"],"的响应式原理":["20.16"],"因为":["20.16"],"的响应式原理依赖了":["20.17"],"这个核心":["20.17"],"可以劫持对象的某些操作":["20.17"],"get时":["20.18"],"收集不同代理对象不同属性所依赖的副作用函数":["20.18"],"set时":["20.18"],"取出当前属性所依赖的所有副作用函数":["20.18"],"重新执行":["20.18"],"内部的执行过程":["20.18"],"reactive":["20.19","20.25"],"会返回如下一个":["20.19"],"effect":["20.20","20.21","25.0"],"首先定义全局的":["20.20"],"activeeffect":["20.20","25.0"],"它永远指向当前正在执行的":["20.20"],"track":["20.21"],"会建立一个":["20.21"],"counter":["20.21"],"的一个依赖关系":["20.21"],"trigger":["20.22"],"数据变化的时候就会触发代理对象的":["20.22"],"如果函数依赖于外部的状态":["20.23"],"3的响应式原理比较":["20.24"],"响应式数据声明的核心api":["20.25"],"ref":["20.25","20.26"],"shallowref":["20.25"],"shallowreactive":["20.25"],"shallowreadonly":["20.25"],"shallow浅层作用形式":["20.25"],"虽然常常有文章说一般只用来":["20.26"],"声明基础数据的响应式":["20.26"],"但是其实所有的数据类型声明响应式时都可以使用ref":["20.26"],"只是内部为了同时实现基础数据的响应式处理":["20.26"],"封装成了一个具有":["20.26"],"activeeffect自动把effect函数收集起来放进对应的dep里":["20.27"],"track函数用来把effect函数收集起来放进dep里":["20.28"],"dep为什么用set呢":["20.28"],"因为set可以自动去重":["20.28"],"搜集起来之后":["20.28"],"以后只要变量一改变":["20.28"],"就执行trigger函数通知dep里所有依赖money变量的effect函数执行":["20.28"],"对象里每一个属性都有一个dep":["20.30"],"来存储每个对象对应的map":["20.31"],"receiver相当于proxy代理的对象":["20.32"],"替代原对象target":["20.32"],"在receiver上访问和修改":["20.32"],"target":["20.33"],"vue中指令的注册和组件的注册一样":["21.2"],"提供了全局注册和局部注册两种方式":["21.2"],"全局注册就是指我们定义的指令可以在项目中任意地方都可以使用":["21.2"],"局部注册则意味着只能在注册的当前组件中使用":["21.2"],"接下来我们就来学习这两种注册指令的方式":["21.2"],"我们通过app":["21.2"],"directive的方式全局注册指令":["21.2"],"它有两个参数":["21.2"],"directive的第二个参数是钩子函数对象":["21.3"],"mydirective":["21.3"],"在绑定元素的":["21.3"],"attribute":["21.3"],"前":["21.3"],"或事件监听器应用前调用":["21.3"],"created":["21.3"],"el":["21.3","22.0","26.0"],"binding":["21.3","22.0","26.0"],"vnode":["21.3"],"prevvnode":["21.3"],"下面会介绍各个参数的细节":["21.3"],"在元素被插入到":["21.3"],"前调用":["21.3"],"beforemount":["21.3","22.0","26.0"],"当在组件上使用自定义指令时":["21.4"],"main":["21.6"],"中引入指令文件":["21.6"],"copy":["22.0","26.0"],"vcopy":["22.0","26.0"],"copycontent":["22.0","26.0"],"debounce":["23.0","27.0"],"fn":["25.0"],"targetmap":["25.0"],"weakmap":["25.0"],"创建":["28.2"],"createperson2":["28.4"],"待定":["28.6"],"不多说闭着眼也写得出来":["29.1"],"bubblesort":["29.1"],"从":["29.2"],"i":["29.2"],"开始从后面挑一个比":["29.2"],"小的且是最小的数与":["29.2"],"默认第一个元素被排好序":["29.3"],"从第二个元素开始依次与之前的元素比较":["29.3"],"指到比较到如果大于当前的的元素则退出循环":["29.3"],"插入到当前的的元素的下一位":["29.3"],"取一个增量gap":["29.4"],"然后将所有距离为gap的元素分在同一组":["29.4"],"并对每一组的元素进行直接插入排序":["29.4"],"然后再取一个比第一增量小的整数作为第二增量":["29.4"],"重复上述操作":["29.4"],"当增量的大小减到1时":["29.4"],"就相当于整个序列被分到一组":["29.4"],"找到一个主元pivot的key和value":["29.5"],"一般是中间的":["29.5"],"让数组形成左边是小于key右边是大于key":["29.5"],"然后左边的和右边的递归继续排序":["29.5"],"quicksort":["29.5"],"hashfunc":["30.1","30.4"],"hashtable":["30.2","30.3","30.4","30.5","30.7"],"index":["30.2","30.4"],"isempty":["30.7"],"count":["30.7"],"普通构造函数封装":["31.0"],"stack":["31.0"],"element":["31.0"],"十进制转二进制":["31.1"],"dec2bin":["31.1"],"二叉搜索树":["32.1"],"bst":["32.1"],"insert":["32.3"],"向树中插入一个新的键":["32.3"],"封装binaryserachtree的构造函数":["32.4"],"还需要封装一个用于保存每一个结点的类node":["32.4"],"插入叶子结点":["32.5"],"binaryserachtree":["32.5","32.7","32.8","32.9","32.10","32.11","32.16"],"从根节点开始":["32.7"],"preordertraversal":["32.7"],"从左子树开始":["32.8"],"根节点在中间":["32.8"],"根节点在最后":["32.9"],"postordertraversal":["32.9"],"min":["32.10"],"search":["32.11"],"递归法":["32.11"],"删除节点要从查找要删的节点开始":["32.12"],"找到节点后":["32.12"],"需要考虑三种情况":["32.12"],"该节点是也结点":["32.12"],"没有子节点":["32.12","32.13"],"比较简单":["32.12"],"该节点有一个子节点":["32.12"],"也相对简单":["32.12"],"这种情况相对比较简单":["32.13"],"我们需要检测current的left以及right是否都为null":["32.13"],"都为null之后还要检测一个东西":["32.13"],"一个子节点":["32.14"],"warning":["32.14"],"caution":["32.14"],"tip":["32.14"],"danger":["32.14"],"这种情况也不是很难":["32.14"],"要删除的current结点":["32.14"],"只有2个连接":["32.14"],"两个子节点":["32.15"],"又分三种情况":["32.15"],"如果我们要删除的节点有两个子节点":["32.15"],"甚至子节点还有子节点":["32.15"],"这种情况下我们需要从下面的子节点中找到一个节点":["32.15"],"来替换当前的节点":["32.15"],"但是找到的这个节点有什么特征呢":["32.15"],"应该是current节点下面所有节点中最接近current节点的":["32.15"],"要么比current节点小一点点":["32.15"],"要么比current节点大一点点":["32.15"],"总结你最接近current":["32.15"],"你就可以用来替换current的位置":["32.15"],"比current小一点点的节点":["32.15"],"一定是current左子树的最大值":["32.15"],"删除":["32.16"],"remove":["32.16"],"current":["32.16","33.11","33.12"],"root":["32.16"],"parent":["32.16"],"isleftchild":["32.16"],"查找删除的节点current":["32.16"],"while":["32.16"],"if":["32.16","33.11","33.12"],"append":["33.2","33.11","33.12"],"linkedlist":["33.2","33.3","33.4","33.5","33.6","33.7","33.8","33.9","33.11","33.12"],"完整代码":["33.11"],"next":["33.11","33.12"],"head":["33.11","33.12"],"length":["33.11","33.12"],"增":["33.11","33.12"],"newnode":["33.11","33.12"],"第一个节点为空":["33.11","33.12"],"把新节点放在第一个节点":["33.11","33.12"],"最后一个节点":["33.11","33.12"],"else":["33.11","33.12"],"当current":["33.11","33.12"],"next不为空时":["33.11","33.12"],"让current指到下一个data":["33.11","33.12"],"直到current":["33.11","33.12"],"next为空":["33.11"],"最后把新节点赋值给current":["33.11"],"全部代码":["33.12"],"queue":["34.1","34.2","35.1","35.2"],"dequeue":["34.1","34.2"],"shift":["34.1","34.2","36.20"],"front":["34.1","34.2"],"enqueue":["34.2"],"myqueue":["35.2"],"numlist":["35.2"],"every":["36.1"],"判断是否符合条件":["36.1","36.2"],"有一个不符合就不行":["36.1"],"some":["36.2"],"有一个符合就行":["36.2"],"find":["36.3"],"找到符合条件的第一个数":["36.3"],"findlast":["36.4"],"findindex":["36.5"],"找到":["36.5"],"indexof":["36.6"],"lastindexof":["36.7"],"foreach":["36.10"],"方法对数组的每个元素执行一次给定的函数":["36.10"],"flat":["36.11"],"flatmap":["36.12"],"方法对数组中的每个元素应用给定的回调函数":["36.12"],"然后将结果展开一级":["36.12"],"返回一个新数组":["36.12"],"fill":["36.13","42.1"],"用一个固定值填充一个数组中从起始索引":["36.13"],"默认为":["36.13"],"静态方法从可迭代或类数组对象创建一个新的浅拷贝的数组实例":["36.15"],"of":["36.16"],"方法通过可变数量的参数创建一个新的":["36.16"],"实例":["36.16"],"而不考虑参数的数量或类型":["36.16"],"join":["36.17"],"方法用于将数组中的元素连接成字符串":["36.17"],"pop":["36.18"],"方法用于删除数组中的最后一个元素":["36.18"],"方法用于添加一个或多个元素到数组的末尾":["36.19"],"方法从数组中删除第一个元素":["36.20"],"并返回该元素的值":["36.20"],"unshift":["36.21"],"方法将一个或多个元素添加到数组的开头":["36.21"],"方法返回一个包含数组中每个索引键的":["36.22"],"方法返回一个新的":["36.23"],"返回一个新的数组迭代器对象":["36.24"],"reduceright":["36.26"],"方法接受一个函数作为累加器":["36.26"],"reverse":["36.27"],"方法将数组中元素的位置颠倒":["36.27"],"slice":["36.28"],"方法返回一个新的数组对象":["36.28"],"sort":["36.29"],"方法用原地算法对数组的元素进行排序":["36.29"],"并返回数组":["36.29"],"splice":["36.30","43.7"],"tolocalestring":["36.31"],"返回一个字符串表示数组中的元素":["36.31"],"方法返回一个字符串":["36.32"],"flatten":["37.2"],"flatten2":["37.5"],"eachflatten":["37.6"],"deep":["37.6"],"reduceflat":["37.7"],"arr2":["38.4"],"flowing":["39.1"],"createapp":["39.2","40.2","42.2"],"disabled":["39.4","40.7"],"给按钮添加禁用功能":["39.4"],"按钮":["40.0"],"普通按钮":["40.1"],"l":["40.1"],"button":["40.1"],"默认":["40.1"],"primary":["40.1"],"success":["40.1"],"info":["40.1"],"可以选择想要的类型":["40.4"],"例如":["40.4"],"给按钮添加":["40.5","40.6","40.7","40.8"],"plain":["40.5"],"round":["40.6"],"icon":["40.8"],"选择自己喜欢的":["40.8"],"npm":["41.0"],"licon":["42.1","42.7","42.8","42.9","42.10","42.11","42.12","42.13","42.14","42.15","42.16"],"apple":["42.1"],"line":["42.1"],"apps":["42.1","42.9"],"我们可以设置dot属性后":["42.4"],"我们可以设置color属性更改你想要的颜色":["42.5"],"dianzan":["42.10"],"xiala2":["42.12"],"bianji":["42.15"],"shezhi":["42.16"],"宏任务的定时器谁先到时间谁先执行":["43.1"],"table":["43.2"],"row":["43.2"],"table标签":["43.2"],"类似于":["43.2"],"别再错了指向的是obj的上下文":["43.4"],"指不到里面的":["43.4"],"输入类型":["43.5"],"promise的catch只会执行第一个":["43.9"],"和then不同不会传递到最后":["43.9"],"b":["43.10"],"c":["43.10"],"情况一转为字符串后相当于重复赋值":["43.11"],"object对象转换为字符串和判断数据类型都是直接调用":["43.12"],"let块级作用域输出0":["43.13"],"若过渡起始值或过渡开始值为auto":["43.14"],"top属性规定内部元素的顶部边缘":["43.16"],"flex方法时":["43.18"],"你可上点心吧":["44.0"],"通过vitepress和github":["46.0"],"从这里开始你的":["47.0"]},{"0":["1.12","6.15","11.22","11.26","29.1","30.7","33.4","33.8","34.2","35.2","43.13"],"1":["1.18","2.1","3.6","3.9","6.9","6.10","8.1","9.26","10.3","10.24","10.47","10.56","10.57","18.2","19.5","19.23","19.27","20.9","20.17","20.18","31.0","36.12","37.4","37.6","37.7"],"2":["3.5","5.8","5.9","6.14","6.19","9.9","10.3","10.12","10.14","10.40","10.57","10.64","10.65","10.79","12.0","12.2","15.4","15.8","18.6","18.11","19.7","19.9","19.12","19.19","19.20","19.30","20.9","20.11","20.14","20.26","20.27","32.15","37.4","38.4","42.8","43.2","43.17"],"3":["2.7","4.0","6.13","10.57","15.4","17.32","20.14","37.4","38.4"],"4":["2.7","4.0","8.2","17.10","17.32","18.8"],"5":["10.52"],"6":["9.15","37.4"],"7":["9.15"],"10":["5.14"],"16":["36.29"],"22":["12.3"],"42":["11.26"],"123":["10.31"],"205":["9.15"],"206":["9.15"],"300":["9.15"],"301":["9.15"],"1000":["12.8"],"2000":["12.8"],"3000":["12.8"],"flex":["1.1","1.16"],"justify":["1.1"],"content":["1.1","5.2"],"center":["1.1"],"align":["1.1"],"items":["1.1","10.55"],"bfc":["1.2"],"块级格式化上下文":["1.2"],"属于普通流":["1.2"],"felx是哪些属性的缩写":["1.4"],"对应的属性代表什么含义":["1.4"],"隐藏元素的属性有哪些":["1.9"],"会触发回流重绘性能消耗较大":["1.10"],"非继承属性":["1.10"],"子孙节点消失由于元素从渲染树消失造成":["1.10"],"通过修改子孙节点属性无法显示":["1.10"],"visibility":["1.10"],"hidden":["1.10"],"left":["1.11","32.16"],"top":["1.11","1.18"],"利用绝对定位":["1.11"],"scale":["1.12"],"skew":["1.12"],"px":["1.13"],"和":["1.13","1.20","4.0","17.11","36.16","36.28"],"vh":["1.14"],"是什么":["1.14"],"flexible":["1.15"],"box":["1.15","2.6"],"的缩写":["1.15"],"意为":["1.15"],"弹性布局":["1.15"],"指定容器display":["1.15"],"那就是":["1.16"],"css":["1.17","1.21","2.5","5.6"],"或":["1.17","5.13","19.36"],"属于合成属性":["1.18"],"composite":["1.18"],"中的":["1.19"],"值是":["1.19"],"css3":["1.19","2.1"],"新增的":["1.19"],"space":["1.20"],"between":["1.20"],"过渡动画":["1.21"],"property":["1.21","20.17"],"指定过渡的":["1.21"],"属性":["1.21","10.3","11.3"],"属性使用裁剪方式创建元素的可显示区域":["1.22"],"如何用":["2.0"],"利用":["2.1"],"添加空div法":["2.2"],"在浮动元素下方添加空div":["2.2"],"并给该元素写css样式":["2.2"],"两种盒模型以及区别":["2.3"],"重绘":["2.4"],"添加":["2.4"],"删除":["2.4"],"尽量不用图片":["2.5"],"因为这类修饰图片完全可以用":["2.5"],"去代替":["2.5"],"border":["2.6","43.2"],"radius":["2.6"],"shadow":["2.6"],"image":["2.6"],"圣杯布局":["2.7"],"核心思想":["2.7"],"利用浮动":["2.7"],"外边距负值和相对定位来实现":["2.7"],"父级元素设置左右的padding":["2.7"],"三列均设置向左浮动":["2.7"],"中间一列放在最前面":["2.7"],"宽度设置为父级元素的宽度":["2.7"],"因此后面两列都被挤到了下一行":["2.7"],"再通过设置margin负值将其移动到上一行":["2.7"],"什么是es6模块化":["3.1"],"每个":["3.2","18.7"],"默认导出与默认导入":["3.3"],"每个模块中":["3.4"],"每个模块中可以使用多次按需导出":["3.5"],"var允许重复声明":["3.6"],"let":["3.6","4.0","10.56","10.57","17.7","17.21","20.15","20.28","20.29","28.1","28.2","28.4","29.3","29.4","29.5","30.1","30.3","32.5","32.10","32.12","33.6","33.9","35.2","36.1","36.2","36.3","36.10","36.15","36.17","36.19","36.21","36.22","36.24","36.32","37.0","37.1","37.5","38.0"],"const不允许":["3.6"],"函数作用域":["3.7"],"块状作用域":["3.7"],"动态作用域":["3.7"],"对象":["3.7","36.22","36.23"],"新增的解构赋值":["3.8"],"解构赋值针对数组或者对象进行模式匹配":["3.8"],"箭头函数和普通函数的区别":["3.9"],"js新增简单数据类型symbol":["3.10"],"新增了class关键字":["3.11"],"与node":["3.12"],"js的commonjs不同":["3.12"],"es6新增esmoudule":["3.12"],"新增promise":["3.13"],"里面的参数a又是怎么回事呢":["4.0"],"字符串a表示一种修饰":["4.0"],"对你当前创建的symbol类型的一种修饰":["4.0"],"作为区分使用":["4.0"],"与其他数据类型之间的转换":["4.0"],"symbol不能用四则运算进行操作":["4.0"],"否则报错":["4.0"],"它只能用显示的方式转为字符串和布尔值":["4.0"],"string":["4.0","10.31","17.6","17.8","17.17","17.19","17.20","17.23"],"boolean":["4.0","11.14"],"作为对象的属性":["4.0"],"msmymbol":["4.0"],"第一种写法":["4.0"],"html":["5.1"],"文件字节流是无法直接被渲染引擎理解的":["5.1"],"所以要将其转化":["5.1"],"会根据请求头中的":["5.2"],"type字段来判断文件的类型":["5.2"],"比如":["5.2"],"type":["5.2","8.2","17.26","17.32","40.4"],"的值是":["5.2"],"text":["5.2","21.0","43.15"],"那么浏览器就会判断这是一个":["5.2"],"类型的文件":["5.2"],"然后为该请求选择或者创建一个渲染进程":["5.2"],"渲染进程准备好之后":["5.2"],"网络进程和渲染进程之间会建立一个共享数据的管道":["5.2"],"网络进程接收到数据后就往这个管道里面放":["5.2"],"而渲染进程则从管道的另外一端不断地读取数据":["5.2"],"css不会阻塞dom树的解析":["5.3"],"但是会影响":["5.3"],"标签时":["5.4"],"暂停整个":["5.4"],"dom":["5.4","5.10","5.11","5.17","19.29"],"脚本设置为异步加载":["5.5"],"因为":["5.6"],"有可能会修改当前状态下的":["5.6"],"不过在执行":["5.6"],"脚本之前":["5.6"],"如果页面中包含了外部":["5.6"],"当页面引用的所有":["5.7"],"js":["5.7","5.15","10.23","10.42","10.53","10.55","10.60","10.72","11.3","11.4","11.7","11.10","11.13","11.14","11.16","11.18","11.20","11.25","14.4","14.5","17.8","19.17","19.21","20.7","20.28","28.2","29.2","29.4","32.12","32.15","36.1","36.2","36.3","36.7","36.10","36.11","36.15","36.18","36.19","36.21","36.22","36.23","36.24","36.26","36.30","36.32","38.0","40.4","40.5","40.6","40.7","42.5","43.4","43.9","43.13"],"同步代码执行完毕":["5.7"],"解析html结构":["5.8"],"设置defer和acync时js和html异步加载":["5.9","6.9"],"html转换为dom":["5.9"],"原生":["5.13"],"jq":["5.13"],"如前":["5.14"],"若一次操作中有":["5.14"],"次更新":["5.14"],"的动作":["5.14"],"用":["5.15"],"树":["5.17"],"doctype":["6.1"],"有何作用":["6.1"],"的区别":["6.2"],"b":["6.2","10.26","17.1","17.4","17.32","20.9"],"strong":["6.2"],"form":["6.3"],"ul":["6.3"],"li":["6.3"],"ol":["6.3"],"table":["6.3"],"h1":["6.3"],"h2":["6.3"],"它为鼠标用户改进了可用性":["6.4"],"当我们在label元素内点击文本时就会触发此控件":["6.4"],"也就是说":["6.4","14.3"],"当用户选择该标签时":["6.4"],"浏览器就会自动将焦点转到和标签相关的表单控件上":["6.4"],"href属性中的url可以是浏览器支持的任何协议":["6.5"],"所以a标签可以用来手机拨号":["6.5"],"a":["6.5","11.18","11.26","17.4","17.7","17.32","20.9"],"你知道seo中的tdk吗":["6.6"],"主要有两种方式":["6.7"],"实现标签被识别":["6.7"],"通过document":["6.7"],"存储":["6.8","15.0"],"多任务等功能的增加":["6.8"],"语义化标签":["6.8"],"如":["6.8","9.11"],"article":["6.8"],"加载js然后html和css":["6.9"],"从根元素开始检查哪些元素可见":["6.10"],"以及样式":["6.10"],"重排":["6.11"],"回流":["6.11"],"不可避免":["6.12"],"documentfragment":["6.13"],"提升为合成层":["6.13"],"合成层的位图":["6.13"],"会交由":["6.13"],"合成就是将页面的各个部分分成多个层":["6.14"],"最后把它们合成为一个页面的技术":["6.14"],"合成层拥有单独的图层":["6.14"],"translatez":["6.15"],"如果使用":["6.15"],"可能简单的重叠就会产生大量的合成层":["6.16"],"这样会占用很多无辜的":["6.16"],"cpu":["6.16"],"虽然有浏览器的层压缩机制":["6.17"],"但是也有很多无法进行压缩的情况":["6.17"],"语义元素可以清楚地向浏览器和开发者描述其意义":["6.18"],"即元素本身传达了关于标签所包含内容类型的一些信息":["6.18"],"例如":["6.18","11.22","11.30","18.13","40.5","40.6","40.7","42.5"],"也能够":["6.19"],"呈现出很好的内容结构":["6.19"],"search":["7.1","32.1","32.3"],"engine":["7.1"],"标题":["7.2"],"如果主体比较多":["7.3"],"简单理解就是关键词在所有文字内容中出现的比例":["7.4"],"给用户看的":["7.5"],"这个属性表明了这张图的内容":["7.5"],"其实搜索引擎在分析页面的时候":["7.5"],"也会根据这个词去判断图片的内容":["7.5"],"所以要给页面上有意义的图片都加上alt属性":["7.5"],"表现和行为":["8.1"],"javascript定义":["8.2"],"script":["8.2"],"css定义":["8.2"],"style":["8.2"],"搜索引擎优化":["8.3"],"很有帮助":["8.3"],"http是一个客户端终端":["9.1"],"用户":["9.1"],"和服务器端":["9.1"],"网站":["9.1"],"请求和应答的标准":["9.1"],"客户向服务器请求服务时":["9.2"],"只需要传送请求方法和路径":["9.2"],"由于http协议简单":["9.2"],"使得通信速度比较快":["9.2"],"transmission":["9.3"],"control":["9.3"],"protocol":["9.3"],"sockets":["9.4"],"layer":["9.4"],"协议对http协议传输的数据进行加密":["9.4"],"ssl":["9.4"],"依靠证书来验证服务器的身份":["9.4"],"并为浏览器和服务器之间的通信加密":["9.4"],"0的区别":["9.5"],"http":["9.5"],"主机名":["9.6"],"显示":["9.8"],"请求":["9.8","9.15"],"使用":["9.8"],"方法应该只用在读取数据上":["9.8"],"而不应该用于产生":["9.8"],"副作用":["9.8"],"的操作中":["9.8"],"传递参数数量有限":["9.9"],"post":["9.9","9.12"],"一般用于提交数据":["9.9"],"参数不可见":["9.9"],"更新服务器上的文件或数据库":["9.10"],"get能请求缓存":["9.10"],"agent":["9.11","9.15"],"用户标识":["9.11"],"os":["9.11"],"和浏览器的类型和版本":["9.11"],"if":["9.11","17.3","20.4","20.21","22.0","25.0","26.0","30.2","30.4","32.5","33.4","33.5","33.7","33.8","37.7"],"modified":["9.11"],"since":["9.11"],"值为上一次服务器返回的last":["9.11"],"modified值":["9.11"],"用于确定某个资源是否被更改过":["9.11"],"没有更改过就从缓存中读取":["9.11"],"none":["9.11"],"是":["9.12"],"响应状态行":["9.13"],"1xx":["9.14"],"提示信息":["9.14"],"表示请求已接收":["9.14"],"但没有返回任何内容":["9.15"],"重置内容":["9.15"],"部分内容":["9.15"],"服务器成功处理了部分":["9.15"],"get":["9.15","19.11","20.17","20.19","20.32","25.0"],"3xx":["9.15"],"重定向":["9.15"],"多种选择":["9.15"],"针对请求":["9.15"],"服务器可执行多种操作":["9.15"],"服务器可根据请求者":["9.15"],"user":["9.15"],"选择一项操作":["9.15"],"或提供操作列表供请求者选择":["9.15"],"永久移动":["9.15"],"url":["9.17","18.5"],"解析":["9.17"],"地址解析":["9.18"],"首先判断你输入的是一个合法的":["9.18"],"浏览器缓存":["9.19"],"浏览器会先检查是否在缓存中":["9.19"],"没有则调用系统库函数进行查询":["9.19"],"ip":["9.20"],"分为四层":["9.20"],"在发送数据时":["9.20"],"将数据返回至浏览器":["9.21"],"如果响应可以缓存":["9.22"],"而断开连接是四次挥手":["9.24"],"其实就是指建立一个tcp连接时":["9.25"],"需要客户端和服务器总共发送3个包":["9.25"],"进行三次握手的主要作用就是为了确认双方的接收能力和发送能力是否正常":["9.25"],"指定自己的初始化序列号为后面的可靠性传送做准备":["9.25"],"刚开始客户端处于":["9.25"],"客户端或服务器均可主动发起挥手动作":["9.26"],"第一次挥手":["9.26"],"客户端发送一个":["9.26"],"fin":["9.26"],"报文":["9.26"],"js的基础类型":["10.1"],"基础类型有":["10.1"],"typeof和instanceof的区别":["10.2"],"arr":["10.3","10.51","10.67","29.2","29.3","29.4","29.5","36.1","36.2","36.3","36.17","37.2","38.1","38.2","38.3"],"obj":["10.3","10.61","11.7","11.13","11.18","11.24","20.4","20.9","20.15"],"nul":["10.3"],"不能准确判断":["10.3"],"date":["10.3"],"reg":["10.3"],"error":["10.3","12.5"],"constructor":["10.3"],"返回实例对象的构造函数":["10.3"],"构造函数的原型对象上会有一个":["10.3"],"指向了构造函数自身":["10.3"],"所以实例对象通过原型链访问":["10.3"],"就能找到自己的构造函数":["10.3"],"也就是自己的类型了":["10.3"],"instanceof":["10.3"],"沿着原型链去找":["10.3"],"它的作用是检测实例对象是不是属于某个构造函数":["10.3"],"可以用来做数据类型的检测":["10.3"],"缺点":["10.3"],"不能检测基本数据类型":["10.3"],"原型链可能被修改":["10.3"],"导致检测结果不准确":["10.3"],"只要能在原型链上找到构造函数":["10.3"],"就返回":["10.3"],"所以类型可能不准确":["10.3"],"没有":["10.4","43.5"],"defer":["10.4"],"即使放在head里面":["10.6"],"defer是html4的async是html5新增的":["10.7"],"因为立即执行":["10.8"],"类中的方法的this不是固定的":["10.9"],"即一个宏任务":["10.11"],"所有微任务":["10.11"],"渲染":["10.11"],"一个宏任务":["10.11"],"异步任务":["10.12"],"不进入主线程":["10.12"],"而进入任务队列的任务":["10.12"],"执行宏任务期间产生的所有微任务":["10.13"],"组成":["10.13"],"而是在指定时间后":["10.14"],"将回调函数放入事件循环的队列中":["10.14"],"promise":["10.15","12.7","43.9"],"从堆内存中开辟一个新的区域存放新对象":["10.17"],"拷贝的就是基本类型的值":["10.18"],"如果属性是引用类型":["10.18"],"会影响":["10.19"],"原对象":["10.19"],"意外的全局变量":["10.20"],"分配内存":["10.21"],"开始":["10.22"],"顺着引用表能找到的都不是内存垃圾":["10.22"],"引擎会创建执行上下文":["10.23"],"除了判断nan为true":["10.24"],"name":["10.25","10.64","12.3","17.20","17.23","28.3","28.4","28.5","42.11"],"this":["10.25","11.31","17.13","17.17","30.2","30.3","30.4","32.5","32.7","32.8","32.9","32.10","32.11","33.4","33.8","33.9"],"方法用于返回指定对象的原始值":["10.27"],"若对象没有原始值":["10.27"],"则将返回对象本身":["10.27"],"基本数据类型":["10.28"],"number":["10.31","11.30","17.2","17.4","17.6","17.19","17.20","31.1"],"objstr":["10.31"],"转布尔值都是false":["10.32"],"null":["10.32","11.12","13.2","17.11","17.14","33.9"],"undefined":["10.32","10.36","17.11"],"是object":["10.33"],"在比较过程中会存在隐式转换":["10.34"],"转成string类型":["10.35"],"字符串连接符":["10.35"],"为":["10.36","20.20"],"true":["10.36","11.19"],"为什么是":["10.37","10.38"],"false":["10.37","11.4","13.2","32.16","33.11","33.12"],"优先级高于":["10.39"],"不是假值":["10.39"],"所以先转换成":["10.39"],"就是没有函数名的函数":["10.41"],"xxx":["10.42","20.26"],"需不需要阻止冒泡":["10.43"],"归类于变量声明":["10.44"],"享受变量提升":["10.44"],"函数提升优先级":["10.44"],"由最具体的元素接收":["10.45"],"fetch有啥区别":["10.46"],"domcontentloaded的区别":["10.47"],"dom文档加载的步骤为":["10.47"],"function":["10.48","10.49","10.51","10.60","10.61","11.4","11.13","11.14","17.4","17.8","17.29","20.21","28.6","29.2","29.3","29.4","30.5","32.7","32.8","32.10","32.12","33.2","33.3","33.5","33.6","33.7","33.10","37.6","43.1"],"stopbubble":["10.48"],"stopdefault":["10.49"],"可以把事件绑定在父元素上":["10.50"],"quchong1":["10.51"],"const":["10.51","10.55","10.65","11.3","11.4","11.10","11.16","11.20","19.20","19.21","19.36","20.8","20.9","20.21","20.32","31.1","43.4"],"newarr":["10.51"],"所以5和":["10.52"],"是两个不同的值":["10.52"],"内部判断两个值是否不同":["10.52"],"使用的算法叫做":["10.52"],"same":["10.52"],"size":["10.53","30.1","30.7","34.1","34.2"],"元素数量":["10.53"],"判断集合中是否存在":["10.54"],"clear":["10.54"],"清空集合":["10.54"],"keys":["10.54","17.32","20.4"],"new":["10.55","10.56","10.57","10.65","12.6","12.7","20.9","20.17","20.19","20.21","20.28","31.1","32.5","33.2","33.4","35.2"],"set":["10.56","10.59","25.0"],"set1":["10.57"],"set2":["10.57"],"共同点":["10.58"],"可以储存不重复的值":["10.58"],"不同点":["10.58"],"返回字典中所包含的元素个数":["10.59"],"key":["10.59","20.4","20.8","20.9","20.15","20.21","20.29","25.0","30.3","32.12"],"value":["10.59","20.8","22.0","26.0"],"map2obj":["10.60"],"obj2map":["10.61"],"nan不等于自身":["10.62"],"也就是":["10.62"],"object":["10.64","20.4","20.15"],"ljt":["10.64","10.65"],"字面量创建":["10.64"],"this指向当前person实例对象":["10.65"],"指向window":["10.65"],"fn":["10.65"],"pop":["10.66","31.0","36.20"],"删除数组最后一项":["10.66"],"返回被删除项":["10.66"],"shift":["10.66"],"删除数组第一项":["10.66"],"并返回被删除项":["10.66"],"unshift":["10.66"],"取arr中的最大值":["10.67"],"min":["10.67"],"分别是":["10.70"],"方法用于将js日期转换为iso标准":["10.71"],"它使用iso标准将js":["10.71"],"date对象转换为字符串":["10.71"],"不会编码类似这样字符":["10.72"],"如果需要编码这些字符":["10.72"],"请使用encodeuricomponent":["10.72"],"用法":["10.72"],"var":["10.72","11.7","11.18","15.4","29.1","33.2"],"作用":["10.73"],"代表方法或属性":["10.73"],"window":["10.73"],"history":["10.73","18.5"],"操纵浏览器的记录":["10.73"],"back":["10.73"],"model":["10.74"],"即浏览器对象模型":["10.74"],"主要处理浏览器窗口和框架":["10.74"],"没有统一遵循的标准":["10.74"],"dom全称document":["10.74"],"函数有什么区别":["10.75"],"startindex":["10.76","10.77"],"length":["10.76","29.5","31.0","33.8","34.1","34.2","36.13"],"endindex":["10.77"],"strict":["10.78"],"标签规定了用户可以在其中输入数据的输入字段":["10.79"],"javascript":["11.1","14.1"],"方法将所有可枚举":["11.3"],"从一个或多个源对象复制到目标对象":["11.3"],"返回修改后的对象":["11.3"],"target":["11.3","20.17","20.19","20.21","20.29","20.32","25.0"],"传入的对象":["11.4"],"person":["11.4","17.20","28.5"],"ishuman":["11.4"],"printintroduction":["11.4"],"console":["11.4","11.26","12.3","12.5","12.8","17.21","19.20","20.17","43.1","43.10"],"要定义属性的对象":["11.6"],"要定义或修改的属性的名称或":["11.6"],"symbol":["11.6"],"其排列与使用":["11.8"],"for":["11.8","29.1","29.2","29.3","35.2","37.5","43.13"],"in":["11.8","17.32"],"循环遍历该对象时返回的顺序一致":["11.8"],"区别在于":["11.8"],"方法可以冻结一个对象":["11.9"],"方法把键值对列表转换为一个对象":["11.10"],"entries":["11.10"],"返回值":["11.12","11.14"],"给定对象的原型":["11.12"],"如果没有继承属性":["11.12"],"则返回":["11.12"],"要设置其原型的对象":["11.13"],"该对象的新原型":["11.13"],"一个对象或":["11.13"],"human":["11.13"],"在该对象的原型链上搜寻":["11.14"],"表示调用对象是否在另一个对象的原型链上":["11.14"],"foo":["11.14"],"bar":["11.14","11.26"],"afunction":["11.15"],"中":["11.15"],"的原型链是针对":["11.15"],"自有属性指的是直接赋予该对象的属性":["11.16"],"不需要从原型链上进行查找的属性":["11.16"],"返回":["11.19","36.6"],"如果属性是继承的或者不存在":["11.19"],"该方法返回":["11.19"],"属性值为null或undefind时也会返回true":["11.20"],"有值就会返回true":["11.20"],"object1":["11.20"],"property1":["11.20"],"返回一个布尔值":["11.21"],"value1":["11.21"],"value2":["11.21"],"不会强制转换两边的值":["11.22"],"也不相同":["11.22"],"差别是它们对待有符号的零和":["11.22"],"nan":["11.22"],"运算符":["11.22"],"也包括":["11.22"],"将数字":["11.22"],"视为相等":["11.22"],"而将":["11.22"],"方法会返回一个由一个给定对象的自身可枚举属性组成的数组":["11.25"],"数组中属性名的排列顺序和正常循环遍历该对象时返回的顺序一致":["11.25"],"baz":["11.26"],"log":["11.26","12.3","12.5","12.8","17.21","19.20","20.17","43.1","43.10"],"array":["11.26","17.1"],"like":["11.26"],"propertyisenumerable":["11.28"],"不接受任何参数":["11.30"],"然而":["11.30"],"继承自":["11.30"],"的对象可能用它们自己的实现重写它":["11.30"],"这些实现可以接受参数":["11.30"],"方法将":["11.31"],"值转换为一个对象":["11.31"],"此方法旨在用于自定义类型转换的逻辑时":["11.31"],"当我们new一个promise":["12.0"],"此时我们需要传递一个回调函数":["12.0"],"方法可以捕获到":["12.1"],"之前整条":["12.1"],"链路上所有抛出的异常":["12.1"],"二":["12.1"],"pending":["12.2"],"待定":["12.2"],"执行了executor":["12.2"],"状态还在等待中":["12.2"],"没有被兑现":["12.2"],"也没有被拒绝":["12.2"],"reject":["12.3","12.6"],"ice":["12.3"],"age":["12.3","17.19","17.20","17.23","28.3","28.4","28.5"],"then":["12.3","12.5","12.8"],"res":["12.3","12.5","12.8"],"存放在promise":["12.4"],"prototype上的方法":["12.4"],"也就是promise的原型对象上":["12.4"],"success":["12.5"],"rej":["12.5"],"resolve":["12.6"],"hi":["12.8"],"promise2":["12.8"],"panda":["12.8"],"promise3":["12.8"],"grizzly":["12.8"],"all方法的参数传入为一个可迭代对象":["12.8"],"返回一个promise":["12.8"],"只有":["12.8"],"三个都为resolve状态的时候才会调用":["12.8"],"then方法":["12.8"],"检查其两个操作数是否相等":["13.1"],"转换为布尔值":["13.2"],"模块":["14.1","14.4"],"学习":["14.1"],"模块使用require":["14.2"],"加载一个模块对象和module":["14.2"],"exports输出一个模块对象":["14.2"],"es6":["14.3","16.0"],"模块采用":["14.3"],"mjs后缀文件名":["14.3"],"但是只能整体加载":["14.4"],"不能只加载单一的输出项":["14.4"],"但是可以这样写":["14.4"],"import":["14.4","21.6","39.3","42.3"],"exports":["14.5"],"require":["14.5"],"cookie的有效期是可以设置的":["15.1"],"cookie的存储是4kb左右":["15.2"],"cookie会参与到与服务端的通信中":["15.3"],"doe":["15.4"],"cookie的读取":["15.4"],"x":["15.4","17.2","17.25"],"cookie的删除":["15.4"],"cookie出现的时间较早":["15.5"],"什么是token":["15.6"],"令牌":["15.7"],"服务端":["15.8"],"服务端收到请求":["15.8"],"验证用户名和密码":["15.8"],"服务端验证":["15.8"],"存localstorage里":["15.9"],"jvavscript":["16.0"],"arr2":["17.1"],"y":["17.2"],"lastname":["17.3"],"return":["17.3","20.4","20.17","20.19","22.0","25.0","26.0","31.0","32.7","32.8","32.9","32.11","32.16","33.11","33.12","37.2"],"add":["17.4"],"元组最重要的特性是可以限制数组元素的个数和类型":["17.5"],"它特别适合用来实现多值返回":["17.5"],"ts":["17.5","17.26","17.27","17.28","17.29","19.21"],"employee":["17.6"],"使得程序永远无法运行到函数返回值那一步":["17.8"],"永不存在返回":["17.8"],"异常":["17.8"],"err":["17.8"],"msg":["17.8"],"ok":["17.8","17.10"],"typescript":["17.9","17.12","17.15","17.19"],"uncertain":["17.10"],"any":["17.10","17.13","17.32"],"symbol等":["17.11"],"原始类型赋值给":["17.11"],"在严格模式下":["17.11"],"类型也不能赋给":["17.11"],"这种基于赋值表达式推断类型的能力称之为类型推断":["17.12"],"somevalue":["17.13"],"is":["17.13","17.17"],"可以用于断言操作对象是非":["17.14"],"该属性会被明确地赋值":["17.15"],"为了更好地理解它的作用":["17.15"],"我们来看个具体的例子":["17.15"],"种字面量类型":["17.16"],"字符串字面量类型":["17.16"],"数字字面量类型":["17.16"],"布尔字面量类型":["17.16"],"str":["17.17","30.1","33.11","33.12","38.5"],"interfaces":["17.18"],"是一个很重要的概念":["17.18"],"只读属性用于限制只能在对象刚刚创建的时候修改其值":["17.19"],"此外":["17.19"],"interface":["17.20","17.25"],"printlabel":["17.21"],"labeledobj":["17.21"],"myobj":["17.21"],"鸭式辨型法":["17.22"],"的核心原则之一是对值所具有的结构进行类型检查":["17.24"],"而接口的作用就是为":["17.24"],"这些类型命名":["17.24"],"point":["17.25"],"联合类型":["17.26"],"元组":["17.26"],"primitive":["17.26"],"会被自动合并为单个接口":["17.27"],"extends":["17.28"],"来实现":["17.28"],"类型别名的扩展就是交叉类型":["17.28"],"接口扩展接口":["17.28"],"是一个抽象类型":["17.29"],"只有在调用的时候才确定它的值":["17.29"],"这就不用我们复制粘贴无数份代码了":["17.29"],"简单来说就是你定义一个类型":["17.30"],"然后让":["17.30"],"t":["17.30"],"类型的子类型":["17.32"],"然后使用":["17.32"],"操作符获取":["17.32"],"类型的所有键":["17.32"],"最后利用":["17.32"],"关键字约束":["17.32"],"类型必须为":["17.32"],"联合类型的子类型":["17.32"],"用来遍历枚举类型":["17.32"],"c":["17.32"],"p":["17.32","20.17"],"infer":["17.32"],"在条件类型语句中":["17.32"],"官方文档":["18.0"],"router是vue官方的路由管理器":["18.2"],"有hash和history两种模式":["18.2"],"hash模式是通过监听hashchange事件来实现更新页面部分内容的操作":["18.2"],"router中有个监听器":["18.3"],"用来监听history的变化":["18.3"],"相当于一个锚点":["18.4"],"后面的内容就是锚点值":["18.4"],"当监听锚点值的变化就会改变局部的页面数据":["18.4"],"模式":["18.5"],"模式改变":["18.5"],"内置组件跳转":["18.6"],"接收to":["18.7"],"from":["18.7","40.3"],"next三个参数":["18.7"],"路由跳转前都会触发":["18.7"],"登录验证时用的比较多":["18.7"],"当一个导航触发时":["18.7"],"全局前置守卫按照创建顺序调用":["18.7"],"守卫是异步解析执行":["18.7"],"此时导航在所有守卫":["18.7"],"调用全局的":["18.8"],"beforeeach":["18.8"],"在重用的组件里调用":["18.8"],"beforerouteupdate":["18.8"],"首屏组件加载速度更快一些":["18.9"],"懒加载实现的前提":["18.10"],"es6的动态加载模块":["18.10"],"使用vue的异步组件技术":["18.11"],"可以实现懒加载":["18.11"],"此时一个组件会生成一个js文件":["18.11"],"component":["18.11"],"如过渡名称":["18.12"],"需要从服务器获取数据":["18.13"],"在渲染用户信息时":["18.13"],"spa":["19.1"],"setup":["19.2"],"描述":["19.2"],"beforecreate":["19.2"],"父created":["19.3"],"父beforemount":["19.3"],"子beforecreate":["19.3"],"会先执行完父组件的生命周期然后再执行子组件的生命周期":["19.4"],"show":["19.5"],"开发过程中一般不建议同时将v":["19.6"],"if放在一个标签中使用":["19.6"],"可以使用watch来对这个属性进行监听":["19.7"],"computed具有缓存的特点":["19.7"],"即当它所依赖的属性发生改变的时候它才会重新执行内部逻辑":["19.7"],"如下代码":["19.7"],"如果依赖项不变时不会重新计算":["19.8"],"模板中出现太多逻辑判断会造成模板不易维护":["19.9"],"的实现是基于":["19.10"],"另一种是":["19.11"],"对每个computed属性进行get劫持":["19.12"],"get劫持是最关键的步骤":["19.12"],"将computed":["19.12"],"watcher添加到data属性值的订阅者队列":["19.12"],"在前":["19.12"],"收集时机和":["19.13"],"data":["19.13","33.2","33.6","33.7"],"那样接收一个明确的数据源":["19.14"],"watcheffect":["19.14"],"api":["19.15"],"vue3的是composition":["19.15"],"当然vue3也兼容composition":["19.15"],"vue实例会有一个use函数":["19.16"],"它接受的是一个带有install函数的对象和一个可选的选项对象":["19.16"],"父组件使用它时直接在子组件的标签内写入内容即可":["19.17"],"子组件":["19.17","19.37"],"template":["19.17"],"slot":["19.17"],"父组件":["19.17"],"child":["19.17"],"div":["19.17"],"props":["19.18"],"子传父":["19.18"],"emit":["19.18"],"emits":["19.18"],"当我们的项目有很多个页面":["19.19"],"并且这些页面共享着多个数据状态":["19.19"],"此时我们可以引入vuex":["19.19"],"获取":["19.20"],"地址":["19.20"],"pinia解构方法":["19.20"],"storetorefs":["19.20"],"响应式解构":["19.20"],"后即可访问其内部的方法了":["19.21"],"src":["19.21"],"app":["19.21","39.2","40.2","42.2"],"export":["19.21"],"useappstore":["19.21"],"通常我们切换组件的时候":["19.23"],"上一个组件就会被销毁":["19.23"],"而当我们使用":["19.23"],"created":["19.24"],"mounted":["19.24","21.3"],"使用了keep":["19.25"],"提供了一种非常灵活的方式":["19.26"],"来分发":["19.26"],"vue":["19.26","20.24","23.0","27.0","39.2","40.2","42.2"],"组件中的可复用功能":["19.26"],"区别":["19.27"],"中的另一个位置":["19.29"],"接收两个参数to":["19.29"],"组件用于协调对组件树中嵌套的异步依赖的处理":["19.30"],"它一般用于包裹多个异步组件处理多个异步组件加载前与完成后的统一状态":["19.30"],"更新循环结束之后执行延迟回调":["19.32"],"在修改数据之后立即使用这个方法":["19.32"],"浏览器会从头开始进行dom树的构建":["19.34"],"频繁的操作dom开销是很大的":["19.34"],"在vue中是当状态发生改变":["19.35"],"用来计算改变后的虚拟dom与改变前的虚拟dom之间的差异的算法":["19.35"],"diff算法的本质是找出两个对象之间的差异":["19.35"],"目的是尽可能复用节点":["19.35"],"传给子组件":["19.36"],"子组件用":["19.36"],"defineprops":["19.36"],"isshow":["19.36"],"hide监听并接收参数":["19.37"],"可透传":["19.37"],"children":["19.37"],"所有依赖它的对象都会收到通知":["20.2"],"这就是观察者模式":["20.2"],"subscriber":["20.3"],"通过自定义事件订阅主题":["20.3"],"被激活事件的对象":["20.3"],"publisher":["20.3"],"definereactive":["20.4","20.9","20.15"],"typeof":["20.4"],"foreach":["20.4","20.9"],"为对象的每个属性重新设置":["20.4"],"getter":["20.4"],"setter":["20.4"],"val":["20.4","20.15"],"每个属性都有单独的":["20.4"],"dep":["20.4","20.5","20.8","20.15"],"依赖管理":["20.4","20.5"],"依赖":["20.5"],"在":["20.5"],"响应式":["20.6","20.7"],"会变成":["20.7"],"化":["20.7"],"也就是改变这个对象的时候会触发get和set事件":["20.7"],"进而触发一些视图更新":["20.7"],"prototype叫arraymothods":["20.10"],"observe中在数据被读的时候":["20.11"],"触发getter方法":["20.11"],"执行dep来收集watcher":["20.11"],"数据称为wacther的依赖":["20.12"],"数据变化时":["20.12"],"开发者主动注册的watch回调函数执行":["20.13"],"常见三个场景":["20.13"],"对应三种watcher":["20.13"],"负责敦促视图更新的render":["20.13"],"watcher":["20.13"],"执行敦促计算属性更新的computed":["20.13"],"用户注册的普通watcher":["20.13"],"watch":["20.13"],"api或watch属性":["20.13"],"watcher就是类似中介的角色":["20.13"],"数组里存放所有订阅了该属性的观察者对象watcher":["20.14"],"我们通过definereactive方法将data中的数据进行响应式后":["20.14"],"dep就是帮我们收集watcher究竟要通知到哪里":["20.14"],"依赖收集":["20.14"],"data的属性变化":["20.14"],"依赖集合":["20.15"],"defineporperty":["20.16"],"只能对":["20.16"],"对象的已知属性":["20.16"],"进行操作":["20.16"],"receiver":["20.17","20.33"],"调用":["20.18"],"reactive":["20.18"],"返回一个":["20.18"],"proxy":["20.18","20.24"],"代理对象":["20.18"],"并劫持对象的":["20.18"],"副作用函数":["20.20"],"targetmap":["20.21","20.28"],"weakmap":["20.21","20.28"],"activeeffect":["20.21"],"操作":["20.22"],"从而调用":["20.22"],"方法":["20.22","43.12"],"无法保证输出相同":["20.23"],"就会带来副作用":["20.23"],"中体现最为明显的一点就是":["20.24"],"代理对象之后不仅可以拦截对象属性的读取":["20.24"],"整个定义":["20.25"],"类似深拷贝与浅拷贝的区别":["20.25"],"即只处理首层数据":["20.25"],"代表假设使用":["20.25"],"shadowref":["20.25"],"声明的对象":["20.25"],"如果对象的某个属性也是对象":["20.25"],"则":["20.25"],"只有当这个属性的引用地址发生改变时才会触发更新":["20.25"],"属性的对象":["20.26"],"所以我们访问时必须通过":["20.26"],"的形式访问":["20.26"],"函数内部执行时会创建一个":["20.26"],"effect副作用函数":["20.27"],"实现依赖变量的更新":["20.28"],"用map用来存储dep":["20.30"],"handler":["20.32","32.7","32.8","32.9"],"个人理解就是":["20.33"],"访问target的key属性":["20.33"],"但是this是指向receiver":["20.33"],"proxy和reflect的方法都是一一对应的":["20.34"],"官方提供了v":["21.0"],"允许开发者自定义指令":["21.1"],"一个是指令名称":["21.2"],"一个是钩子函数对象":["21.2"],"指令名称":["21.2"],"短横线":["21.2"],"my":["21.2"],"focus":["21.2"],"驼峰式":["21.2"],"myfocus":["21.2"],"在绑定元素的父组件及他自己的所有子节点都挂载完成后调用":["21.3"],"绑定元素的父组件更新前调用":["21.3"],"beforeupdate":["21.3"],"在绑定元素的父组件及他自己的所有子节点都更新后调用":["21.3"],"updated":["21.3"],"绑定元素的父组件卸载前调用":["21.3"],"beforeunmount":["21.3"],"它会始终应用于组件的根节点":["21.4"],"和透传":["21.4"],"全局挂载":["21.6"],"createapp":["21.6"],"addeventlistener":["22.0","26.0"],"click":["22.0","26.0"],"track":["25.0"],"depsmap":["25.0"],"createperson":["28.3"],"person2":["28.6"],"i":["29.1","35.2","37.5","43.13"],"交换位置":["29.2"],"selectsort":["29.2"],"insertsort":["29.3"],"进行一次直接插入排序":["29.4"],"排序完成":["29.4"],"shellsort":["29.4"],"gap":["29.4"],"pivotindex":["29.5"],"math":["29.5"],"floor":["29.5"],"hash":["30.1"],"hashfunc":["30.2","30.3"],"limit":["30.2","30.4"],"bucket":["30.2","30.4"],"storage":["30.2","30.4"],"index":["30.3"],"prototype":["30.5","30.6","32.12","33.3","33.10"],"isprime":["30.5"],"num":["30.5"],"hashtable":["30.6"],"peek":["31.0"],"stack":["31.1"],"binary":["32.1"],"二叉搜索树的特点就是相对较小的值总是保存在左结点上":["32.2"],"在树中查找一个键":["32.3"],"该类包含三个属性":["32.4"],"结点对应的key":["32.4"],"指向的左子树":["32.4"],"newnode":["32.5","33.2","33.4"],"node":["32.5","32.10","32.11","33.2","33.4"],"root":["32.5","32.9","32.10","32.11"],"preordertraversalnode":["32.7"],"inordertraversal":["32.8"],"inordertraversalnode":["32.8"],"postordertraversalnode":["32.9"],"searchnode":["32.11"],"该节点有两个子节点":["32.12"],"情况比较复杂":["32.12"],"查找删除的节点current":["32.12"],"binaryserachtree":["32.12","32.15"],"remove":["32.12"],"current":["32.12","32.14","33.9"],"就是是否current就是根":["32.13"],"都为null":["32.13"],"并且为跟根":["32.13"],"那么相当于要清空二叉树":["32.13"],"当然":["32.13"],"如果有两个子结点":["32.14"],"就是三个连接了":["32.14"],"一个连接父节点":["32.14"],"一个连接唯一的子节点":["32.14"],"需要从这三者之间":["32.14"],"爷爷":["32.14"],"自己":["32.14"],"儿子":["32.14"],"将自己":["32.14"],"称为current节点的前驱":["32.15"],"比current大一点点的节点":["32.15"],"一定是current右子树的最小值":["32.15"],"称为current节点的后继":["32.15"],"也就是为了能够删除有两个子节点的current":["32.15"],"要么找到它的前驱":["32.15"],"要么找到它的后继":["32.15"],"删除的树":["32.15"],"寻找后继的代码实现":["32.15"],"寻找后继":["32.15"],"delnode要删除的节点":["32.15"],"successor后继节点":["32.15"],"successorparent后继节点的父节点":["32.15"],"else":["32.16"],"right":["32.16"],"操作删除的节点的父节点parent":["32.16"],"情况1":["32.16"],"叶子结点":["32.16"],"linkedlist":["33.1","33.10"],"position":["33.5","33.7","33.11","33.12","40.8"],"head":["33.9"],"previous":["33.9"],"新节点就加入到了最后":["33.11","33.12"],"while":["33.11","33.12"],"tostring":["33.11","33.12","34.1","34.2","43.3"],"insert":["33.11","33.12"],"情况一":["33.11"],"把插入的data放在首位":["33.11"],"next为空":["33.12"],"最后把新节点赋值给current":["33.12"],"isempty":["34.1","34.2"],"class类js构造函数继承":["34.2"],"enqueue":["35.1"],"element":["35.1"],"push":["35.1","43.7"],"返回true或false":["36.1","36.2"],"不改变原数组":["36.3","36.4","36.9","36.14"],"反方向查找":["36.4"],"找到符合条件的第一个数":["36.4"],"符合条件":["36.5"],"的第一个数的索引":["36.5"],"里面为回调函数":["36.5"],"某个元素":["36.6"],"的第一个索引":["36.6"],"方法返回指定元素在数组中的最后一个的索引":["36.7"],"includes":["36.8"],"判断是否包含某个元素":["36.8"],"将数组中的每个元素映射到另一个数组中":["36.9"],"产生一个新的数组":["36.9"],"不产生数组":["36.10"],"对原数组也没影响":["36.10"],"方法创建一个新的数组":["36.11"],"并根据指定深度递归地将所有子数组元素拼接到新的数组中":["36.11"],"它等价于在调用":["36.12"],"map":["36.12"],"方法后再调用深度为":["36.12"],"的":["36.12"],"flat":["36.12","37.6"],"到终止索引":["36.13"],"内的全部元素":["36.13"],"返回一个过滤后的新数组":["36.14"],"arrfrom":["36.15"],"构造函数之间的区别在于对单个参数的处理":["36.16"],"result18":["36.17"],"返回删除后的元素":["36.18"],"改变原数组":["36.18","36.19","36.20","36.21"],"并返回该数组的新长度":["36.19","36.21"],"iterator":["36.22","36.23"],"该对象包含数组每个索引的值":["36.23"],"类似generater函数":["36.24"],"reduce":["36.25","38.3"],"accumulator":["36.26"],"和数组的每个值":["36.26"],"从右到左":["36.26"],"将其减少为单个值":["36.26"],"并返回该数组":["36.27"],"数组的第一个元素会变成最后一个":["36.27"],"数组的最后一个元素变成第一个":["36.27"],"该方法会改变原数组":["36.27"],"这一对象是一个由":["36.28"],"begin":["36.28"],"end":["36.28"],"决定的原数组的浅拷贝":["36.28"],"默认排序顺序是在将元素转换为字符串":["36.29"],"然后比较它们的":["36.29"],"utf":["36.29"],"代码单元值序列时构建的":["36.29"],"方法通过删除或替换现有元素或者原地添加新的元素来修改数组":["36.30"],"并以数组形式返回被修改的内容":["36.30"],"此方法会改变原数组":["36.30"],"数组中的元素将使用各自的":["36.31"],"方法转成字符串":["36.31"],"这些字符串将使用一个特定语言环境的字符串":["36.31"],"表示指定的数组及其元素":["36.32"],"arr3":["37.0"],"result":["37.5","37.6","38.5"],"deep":["37.7"],"result1":["38.1"],"result2":["38.2"],"result3":["38.3"],"wolder":["38.5"],"button":["39.1","39.3","39.4"],"flowing":["39.4"],"朴素按钮":["40.1"],"plain":["40.1"],"lbutton":["40.3"],"primary":["40.4"],"变为朴素按钮":["40.5"],"变为圆角按钮":["40.6"],"变为不可选中状态":["40.7"],"就可以在按钮上添加":["40.8"],"如果":["40.8"],"想放在右侧只需要添加":["40.8"],"install":["41.0"],"arrow":["42.1"],"up":["42.1"],"down":["42.1"],"artboard":["42.1"],"attachment":["42.1","42.8"],"licon":["42.3"],"让我们图标右上角展示一个小红点":["42.4"],"设置badge属性后":["42.4"],"apple":["42.7"],"line":["42.7"],"color":["42.7"],"fill":["42.9"],"shaixuan":["42.9"],"shandian":["42.10"],"shengyinguanbi":["42.11"],"jinru":["42.12"],"dianhua":["42.13"],"shanchu":["42.14"],"bofangjilu":["42.15"],"pinglun":["42.15"],"saoyisao":["42.16"],"table可设置宽高":["43.2"],"margin":["43.2"],"padding等属性":["43.2"],"属性值的单位可以使用px":["43.2"],"百分比值":["43.2"],"table的宽度默认由内容的宽高撑开":["43.2"],"如果table设置了宽度":["43.2"],"宽度默认被它里面的td平均分":["43.2"],"如果给某一个td设置宽度":["43.2"],"请求中的方法不允许使用":["43.6"],"情况二symbol是唯一的b和c不一样":["43.11"],"情况三":["43.11"],"tostirng":["43.12"],"得到的结果都是":["43.12"],"则浏览器不会自己计算成具体数字值":["43.14"],"而是不发生过渡效果":["43.14"],"定义了一个定位元素的上外边距与其包含块的上内边距":["43.16"],"display":["43.18"],"pages在这里记录我的学习blog":["46.0"],"这里有什么":["46.0"],"面试题":["47.0"],"之旅":["47.0"]},{"0":["1.8","2.2","2.7","9.5","30.1","30.4","31.0","31.1","33.5","33.7","33.9","33.10","37.5","37.7","43.9"],"1":["6.11","6.18","9.20","10.11","10.27","10.55","10.73","11.22","11.26","17.6","17.17","18.13","20.7","21.2","29.3","29.5","36.1","36.2","36.3","36.10","36.11","36.18","36.19","36.21","36.26","36.27","36.29","36.30","36.32","37.0","38.0","43.1"],"2":["2.5","3.3","3.9","5.3","6.9","6.10","7.2","7.5","9.5","9.10","9.17","9.19","9.26","10.7","10.21","10.24","10.35","10.36","10.39","10.47","10.55","10.56","11.26","12.3","12.5","17.22","18.2","18.7","19.6","19.23","19.24","19.27","20.18","20.25","21.3","29.4","29.5","32.2","36.1","36.2","36.3","36.10","36.18","36.19","36.21","36.26","36.29","36.30","36.32","37.0","42.1"],"3":["2.5","3.5","5.8","5.9","6.19","7.5","10.40","10.55","10.56","10.64","10.65","12.2","15.8","18.7","19.9","19.12","19.20","19.30","20.11","32.4","36.1","36.2","36.3","36.29","36.32","43.2","43.13"],"4":["10.57","36.1","36.2","36.3","37.4"],"5":["4.0","8.2","17.32","18.8","37.4","38.4"],"6":["8.2","18.8","38.4"],"7":["18.8","36.16"],"10":["17.21"],"23":["10.25"],"25":["11.22"],"42":["11.16","11.20"],"110":["6.5"],"123":["43.11"],"302":["9.15","43.6"],"303":["9.15"],"304":["9.15"],"1970":["15.4"],"2000":["43.1"],"son":["1.1"],"绝对定位配合margin":["1.1"],"auto":["1.1"],"的实现方案":["1.1"],"position":["1.1"],"是一块独立的渲染区域":["1.2"],"内部元素不会影响外部的元素":["1.2"],"如何触发":["1.2"],"根元素":["1.2"],"flex在浏览器中查看分别是":["1.4"],"flex":["1.4","43.18"],"对应的是1":["1.5","1.6"],"对应的是0":["1.7","1.8"],"结构保留":["1.10"],"占据空间":["1.10","1.12"],"仅触发重绘":["1.10"],"不会触发事件":["1.10"],"无法选中":["1.10"],"性能消耗较少":["1.10"],"设置":["1.11"],"absolute":["1.11"],"或":["1.11","6.15","9.15","10.4"],"90deg":["1.12"],"通过2d变换来达到隐藏":["1.12"],"em":["1.13","6.2"],"的区别":["1.13","1.20"],"和":["1.14","6.16","11.30","20.5","20.26"],"是":["1.14","10.74","19.35"],"flex即可":["1.15"],"容器有以下属性":["1.15"],"direction":["1.15"],"wrap":["1.15"],"布局是一维布局":["1.16"],"grid":["1.16"],"布局是二维布局":["1.16"],"js":["1.17","3.2","3.8","10.44","10.52","11.6","11.8","11.12","11.15","11.19","11.22","11.30","11.31","18.11","19.7","19.37","20.13","20.22","20.27","21.2","32.13","32.14","36.4","36.5","36.8","36.9","36.13","36.14","36.20","36.27","36.28","36.29","36.31","40.8"],"实现多行文本溢出省略效果":["1.17"],"property":["1.18"],"对合成属性进行":["1.18"],"transition":["1.18"],"animation":["1.18"],"动画将会创建一个合成层":["1.18"],"设置了":["1.19"],"值后":["1.19"],"在屏幕范围":["1.19"],"viewport":["1.19"],"around":["1.20"],"duration":["1.21"],"指定过渡所需的完成时间":["1.21"],"timing":["1.21"],"function":["1.21","3.7","10.42","11.15","11.31","20.9","20.22","20.28","30.6","32.15","43.13"],"指定过渡函数":["1.21"],"区域内的部分显示":["1.22"],"区域外的隐藏":["1.22"],"css":["2.0","5.11","8.2"],"的":["2.1"],"vw":["2.1"],"单位":["2.1"],"both":["2.2"],"height":["2.2"],"overflow":["2.2","2.7"],"hidden":["2.2","2.7"],"w3c盒模型和ie盒模型":["2.3"],"更新dom节点":["2.4"],"通过display":["2.4"],"none隐藏一个dom节点":["2.4"],"将多个图标文件整合到一张图片中":["2.5"],"雪碧图":["2.5"],"背景":["2.6"],"background":["2.6"],"size":["2.6","17.21","31.0"],"origin":["2.6"],"再利用相对定位":["2.7"],"定位到两边":["2.7"],"注意":["2.7","9.9","10.3"],"圣杯布局中间列的宽度不能小于两边任意列的宽度":["2.7"],"而双飞翼布局则不存在这个问题":["2.7"],"html":["2.7","6.4","10.74"],"class":["2.7","20.13"],"container":["2.7"],"中间":["2.7"],"左边":["2.7"],"右边":["2.7"],"padding":["2.7"],"es6":["3.1","14.2"],"文件都是一个独立的模块":["3.2"],"只允许使用唯一的一次export":["3.4"],"按需导入的成员名称必须和按需导出的名称保持一致":["3.5"],"var会提升变量的声明到作用域的顶部":["3.6"],"但let和const不会":["3.6"],"类型":["3.7","17.19"],"global":["3.7"],"window":["3.7"],"然后对其中的变量进行赋值":["3.8"],"普通函数存在着变量的提升":["3.9"],"箭头函数没有":["3.9"],"symbol":["3.10","43.10"],"class关键字是es5构造函数":["3.11"],"原型模式创建对象的语法糖":["3.11"],"根据功能封装模块":["3.12"],"通过import导入":["3.12"],"然后通过export导出":["3.12"],"promise":["3.13"],"mysymbol":["4.0"],"hello":["4.0"],"第二种写法":["4.0"],"第三种写法":["4.0"],"object":["4.0","10.31","17.21","17.26","20.8","28.4","43.12"],"defineproperty":["4.0","20.4"],"value":["4.0","10.52","10.58","20.17","21.3"],"以上的都可以得到":["4.0"],"symbol属性的遍历":["4.0"],"它可以被专门的object":["4.0"],"为渲染引擎能够理解的内部结构":["5.1"],"这个结构就是":["5.1"],"并同时将读取的数据":["5.2"],"喂":["5.2"],"给":["5.2","10.20"],"你可以把这个管道想象成一个":["5.2"],"水管":["5.2"],"网络进程接收到的字节流像水一样倒进这个":["5.2"],"而":["5.2","36.16"],"的另外一端是渲染进程的":["5.2"],"它会动态接收字节流":["5.2"],"并将其解析为":["5.2"],"javascript的运行":["5.3"],"的解析":["5.4"],"执行":["5.4"],"代码":["5.4"],"通过":["5.5","20.4"],"文件的引用":["5.6"],"或者通过style":["5.6"],"标签内置了":["5.6"],"内容":["5.6"],"那么渲染引擎还需要将这些内容转换为":["5.6"],"cssom":["5.6"],"因为javascript":["5.6"],"有修改":["5.6"],"dom树构建完成":["5.7"],"触发":["5.7"],"加载外部脚本和样式表文件":["5.8","10.47"],"css转换为cssom":["5.9","6.9"],"树是一个渐进过程":["5.10"],"为达到更好的用户体验":["5.10"],"树和":["5.11"],"的解析是从右往左逆向解析的":["5.12"],"操作":["5.13","20.18"],"时":["5.13","9.15"],"不会立即操作":["5.14"],"而是将这":["5.14"],"次更新的":["5.14"],"diff":["5.14","19.35"],"对象模拟":["5.15"],"dom":["5.15"],"树":["5.15"],"利用":["5.17"],"createelement":["5.17","6.7","22.0","26.0"],"doctype是html5的文档声明":["6.1"],"通过它可以告诉浏览器":["6.1"],"使用哪一个html版本标准解析文档":["6.1"],"i":["6.2","11.4","29.3","30.1","30.4"],"h3":["6.3"],"h4":["6.3"],"h5":["6.3"],"h6":["6.3"],"dl":["6.3"],"dt":["6.3"],"dd":["6.3"],"常见的行级元素":["6.3"],"最常用label的地方就是表单中的性别单选框了":["6.4"],"当点击文字时也能够自动聚焦绑定的表单控件":["6.4"],"form":["6.4"],"label":["6.4"],"href":["6.5"],"tel":["6.5"],"在seo中":["6.6"],"tdk其实就是title":["6.6"],"tagname":["6.7"],"footer":["6.8"],"header":["6.8"],"nav等":["6.8"],"视频video":["6.8"],"音频audio":["6.8"],"画布canvas":["6.8"],"html转换为dom":["6.9"],"忽略不可见的元素":["6.10"],"重绘":["6.11"],"重排一定重绘":["6.12"],"gpu":["6.13"],"合成":["6.13"],"cpu":["6.13"],"处理要快":["6.13"],"当需要":["6.13"],"不影响其他图层":["6.14"],"而其他不是合成层的渲染层":["6.14"],"则和其第一个拥有图层":["6.14"],"graphicslayer":["6.14"],"translatex":["6.15"],"translatey":["6.15"],"内存资源":["6.16"],"严重影响了页面的性能":["6.16"],"也就是说除了我们显式的声明的合成层":["6.17"],"还可能由于重叠原因不经意间产生一些不在预期的合成层":["6.17"],"极端一点可能会产生大量的额外合成层":["6.17"],"当浏览器解析到标签时":["6.18"],"它将该标签解释为包含这一块内容的最重要的标题":["6.18"],"有利于seo":["6.19"],"爬虫依赖标签来确定关键字的权重":["6.19"],"因此可以帮助爬虫抓取更多的有效信息":["6.19"],"optimization":["7.1"],"汉译为搜索引擎优化":["7.1"],"言简意赅的体现出页面的主要内容":["7.2"],"可以用一些符号把不同的主题词隔开":["7.3"],"但是关键词不要太多":["7.3"],"提升关键词的密度":["7.4"],"写清楚图片索要反映的内容":["7.5"],"外链":["7.5"],"友情链接":["7.5"],"结构":["8.1","8.3"],"主要是有html标签组成":["8.1"],"text":["8.2"],"和数量单位":["8.2"],"不要在注释内容中使用":["8.2"],"所有标签的元素和属性的名字都必须使用小写":["8.2"],"尽量使用外链css样式表和js脚本":["8.3"],"表现和行为分为三块":["8.3"],"通常":["9.1"],"由http客户端发起一个请求":["9.1"],"创建一个到服务器指定端口":["9.1"],"默认是80端口":["9.1"],"的tcp连接":["9.1"],"灵活":["9.2"],"http允许传输任意类型的数据对象":["9.2"],"正在传输的类型由content":["9.2"],"type加以标记":["9.2"],"internet":["9.3"],"传输控制协议":["9.3"],"抓包工具抓下来的是密文":["9.4"],"大幅增加了中间人攻击的成本":["9.4"],"简单来说":["9.4"],"https协议是由ssl":["9.4"],"http协议构建的可进行加密传输":["9.4"],"身份认证的网络协议":["9.4"],"路径":["9.6"],"post":["9.8"],"指定资源提交数据":["9.8"],"请求服务器进行处理":["9.8"],"例如提交表单或者上传文件":["9.8"],"数据被包含在请求文本中":["9.8"],"这个请求可能会创建新的资源或者修改现有资源":["9.8"],"或两者皆有":["9.8"],"put":["9.8"],"传递参数数量无限制":["9.9"],"安全性讲":["9.9"],"get和post都一样":["9.9"],"没啥所谓的哪个更安全":["9.9"],"post不能":["9.10"],"match":["9.11"],"值为上一次服务器返回的":["9.11"],"etag":["9.11"],"一般会和if":["9.11"],"cookie":["9.11","15.0"],"已有的cookie":["9.11"],"referer":["9.11"],"标识请求引用自哪个地址":["9.11"],"比如你从页面":["9.11"],"a":["9.11","11.3","11.25","17.13","36.24","42.13","43.4"],"跳转到页面":["9.11"],"请求方式中的请求参数":["9.12"],"以":["9.12"],"响应头":["9.13"],"继续处理":["9.14"],"2xx":["9.14"],"用于表示请求已被成功接收":["9.14"],"请求的网页已永久移动到新位置":["9.15"],"服务器返回此响应":["9.15"],"对":["9.15"],"head":["9.15","33.2","33.6","33.8"],"请求的响应":["9.15"],"会自动将请求者转到新位置":["9.15"],"临时移动":["9.15"],"服务器目前从不同位置的网页响应请求":["9.15"],"但请求者应继续使用原有位置来进行以后的请求":["9.15"],"查看其他位置":["9.15"],"请求者应当对不同的位置使用单独的":["9.15"],"请求来检索响应时":["9.15"],"服务器返回此代码":["9.15"],"未修改":["9.15"],"自从上次请求后":["9.15"],"请求的网页未修改过":["9.15"],"服务器返回此响应时":["9.15"],"不会返回网页内容":["9.15"],"dns":["9.17"],"还是一个待搜索的关键词":["9.18"],"并且根据你输入的内容进行自动完成":["9.18"],"字符编码等操作":["9.18"],"操作系统缓存":["9.19"],"操作系统也有自己的":["9.19"],"每层都要对数据进行封装":["9.20"],"应用层":["9.20"],"则存入缓存":["9.22"],"closed":["9.25"],"的状态":["9.25"],"服务端处于":["9.25"],"listen":["9.25"],"状态":["9.25"],"等待服务端的确认":["9.26"],"此时客户端处于fin":["9.26"],"wait1状态":["9.26"],"服务端收到":["9.26"],"之后":["9.26"],"boolean":["10.1","13.2"],"string":["10.1","17.5","17.13","17.26"],"typeof能识别所有的值类型":["10.2"],"bool":["10.3","17.17"],"array":["10.3","17.19","34.1","34.2","38.5"],"und":["10.3"],"regexp":["10.3"],"async":["10.4"],"加载和渲染后续文档元素的过程将和":["10.5"],"script":["10.5"],"它也会在html页面解析完毕之后再去执行":["10.6"],"所以定义在return上":["10.8"],"以方法形式调用this是当前实例":["10.9"],"不是所有微任务之后都会执行渲染":["10.11"],"如此形成循环":["10.11"],"又分为宏任务和微任务":["10.12"],"宏任务":["10.12"],"完成当下的宏任务后":["10.13"],"会立刻执行所有在此期间入队的微任务":["10.13"],"如果时间到了":["10.14"],"js引擎还在执行同步任务":["10.14"],"这个回调函数需要等待":["10.14"],"then":["10.15"],"新旧对象不共享同一块内存":["10.17"],"拷贝的就是内存地址":["10.18"],"新旧对象共享同一块内存":["10.18"],"赋值后原对象改变":["10.19"],"也会影响":["10.19"],"不会被回收掉":["10.22"],"只有那些找不到的对象才是内存垃圾":["10.22"],"才会在适当的时机被":["10.22"],"该执行上下文会包含函数的":["10.23"],"作用域链":["10.23"],"还会把不能转成数字的判断为true":["10.24"],"例如字符串":["10.24"],"xxx":["10.24"],"prototype":["10.25","28.6","32.15"],"age":["10.25","11.20"],"const":["10.25","11.6","11.8","11.12","11.19","11.25","14.4","19.37","20.4","20.7"],"new":["10.25","10.53","10.61","11.10","17.8","20.4","20.8","28.3","28.4"],"a为真时执行b":["10.26"],"返回一个代表该对象的字符串":["10.27"],"valueof偏向于运算":["10.27"],"tostring偏向于显示":["10.27"],"存在栈内存里":["10.28"],"console":["10.31","10.44","12.6","13.2","17.32","19.21","22.0","26.0","36.17","36.22","36.23"],"log":["10.31","10.44","11.4","13.2","17.32","19.21","22.0","26.0","36.17"],"typeof":["10.31","20.9"],"为":["10.32"],"true":["10.32","10.38","17.8","20.4","20.15","32.12","33.11","33.12","39.4"],"不同的数据类型在底层都是通过二进制表示的":["10.33"],"需要类型相同":["10.34"],"如果有一个操作数是布尔值":["10.36"],"则在比较相等性之前先将其转换为数值":["10.36"],"按照隐式转换规则":["10.37","10.38"],"false":["10.39","11.19","30.4","32.11","33.4","33.8"],"右边为布尔值":["10.39"],"对吗":["10.40"],"不对":["10.40"],"onclick":["10.42"],"默认是false":["10.43"],"变量提升优先级":["10.44"],"并往上传播":["10.45"],"事件捕获":["10.45"],"是对xmlhttprequest对象":["10.46"],"xhr":["10.46"],"解析html结构":["10.47"],"e":["10.48","10.49"],"if":["10.48","10.49","10.51","20.9","20.28","32.11","32.13","32.14","33.2","34.2","38.3"],"这就是事件委托":["10.50"],"优点有":["10.50"],"reduce":["10.51","38.1","38.2"],"pre":["10.51","38.1","38.2","38.3"],"next":["10.51"],"zero":["10.52"],"equality":["10.52"],"它类似于精确相等运算符":["10.52"],"主要的区别是nan等于自身":["10.52"],"而精确相等运算符认为nan不等于自身":["10.52"],"let":["10.53","10.60","10.61","17.2","17.5","17.15","17.20","20.7","20.21","28.3","29.2","30.5","30.7","32.15","33.8","33.11","33.12","34.1","34.2","36.4","36.5","36.7","36.9","36.11","36.13","36.14","36.18","36.23","36.26","36.27","36.29","36.30","36.31","38.4"],"返回一个包含集合中所有键的迭代器":["10.54"],"values":["10.54"],"返回一个包含集合中所有值得迭代器":["10.54"],"entries":["10.54"],"返回一个包含set对象中所有元素得键值对迭代器":["10.54"],"是以":["10.58"],"的形式储存元素":["10.58"],"key":["10.58","20.19","20.28","20.32","43.11"],"向字典中添加新元素":["10.59"],"get":["10.59","20.4","20.18","20.21","20.26","20.29","33.11","33.12"],"通过键查找特定的数值并返回":["10.59"],"obj":["10.60","20.7","28.2","43.4"],"nan":["10.62"],"浏览器window":["10.65"],"node里global":["10.65"],"对象调用方法":["10.65"],"target":["10.65","20.4","20.22","20.28"],"数组开头添加元素":["10.66"],"返回新数组长度":["10.66"],"reserve":["10.66"],"反转一个数组":["10.66"],"返回修改后的数组":["10.66"],"sort":["10.66"],"排序一个数组":["10.66"],"取arr中的最小值":["10.67"],"ceil":["10.67"],"小数":["10.67"],"小数向上取整":["10.67"],"alert":["10.70"],"如":["10.71"],"var":["10.71","29.2","33.3"],"date":["10.71"],"uri":["10.72"],"my":["10.72","11.4"],"profile":["10.72"],"php":["10.72"],"name":["10.72","11.4","11.13","11.20","17.26","19.21","28.1","28.6"],"sammer":["10.72"],"go":["10.73"],"innerheight":["10.73"],"获取浏览器窗口的高":["10.73"],"即文档对象模型":["10.74"],"和xml":["10.74"],"它从startindex返回子字符串并返回":["10.76"],"个字符数":["10.76"],"它返回从startindex到endindex":["10.77"],"1的子字符串":["10.77"],"是es5中引入的js指令":["10.78"],"元素在":["10.79"],"中":["11.1","17.9"],"几乎所有的对象都是":["11.1"],"对象":["11.2","20.3"],"b":["11.3","11.18","11.26","13.2","17.7","36.24"],"source":["11.3"],"is":["11.4"],"this":["11.4","11.13","19.20","28.5","32.12","33.1","33.2","33.5","33.6","33.7","33.10"],"am":["11.4"],"要定义或修改的属性描述符":["11.6"],"object1":["11.6","11.12","11.16","11.19","11.25"],"循环还会枚举原型链中的属性":["11.8"],"一个被冻结的对象再也不能被修改":["11.9"],"冻结了一个对象则不能向这个对象添加新的属性":["11.9"],"map":["11.10","25.0","37.2"],"foo":["11.10"],"bar":["11.10"],"prototype1":["11.12"],"level":["11.13"],"superhero":["11.13"],"baz":["11.14"],"create":["11.14"],"进行检查的":["11.15"],"car":["11.15"],"make":["11.15"],"model":["11.15"],"year":["11.15"],"property1":["11.16"],"方法返回一个由指定对象的所有自身属性的属性名":["11.17"],"for":["11.18","21.0","30.1","30.2","30.4"],"prop":["11.19"],"exists":["11.19"],"null":["11.20","30.2","30.4","32.11","32.12"],"undefined":["11.20","17.14"],"如果满足以下任意条件则两个值相等":["11.21"],"都是":["11.21"],"number":["11.22","13.2","17.7","17.10","17.15","17.23","17.25","17.28","17.32"],"视为不相等":["11.22"],"case":["11.22"],"evaluation":["11.22"],"result":["11.22","37.4"],"the":["11.22"],"same":["11.22"],"as":["11.22"],"using":["11.22"],"somestring":["11.25"],"c":["11.26"],"with":["11.26"],"random":["11.26"],"bigint":["11.30"],"方法接受一个可选的":["11.30"],"radix":["11.30"],"参数":["11.30"],"重写派生类对象":["11.31"],"mynumbertype":["11.31"],"n":["11.31"],"这个函数为立即执行的":["12.0"],"称之为":["12.0"],"executor":["12.0"],"fulfilled":["12.2"],"已兑现":["12.2"],"执行了resolve函数则代表了已兑现状态":["12.2"],"rejected":["12.2"],"已拒绝":["12.2"],"执行了reject函数则代表了已拒绝状态":["12.2"],"如果resolve中传入的是另外一个promise":["12.3"],"那么这个新promise会决定原promise的状态":["12.3"],"当我new":["12.4"],"promise的时候":["12.4"],"会把返回的该对象的":["12.4"],"如果只捕获错误":["12.5"],"还可以这样写":["12.5"],"因为第二个参数是捕获异常的":["12.5"],"第一个可以写个null或":["12.5"],"占位":["12.5"],"ice":["12.6"],"error":["12.6","17.7","17.8"],"catch":["12.6"],"err":["12.6"],"resolve":["12.7","18.7","18.11"],"reject":["12.7"],"只要有一个promise的状态为rejected":["12.8"],"则会回调":["12.8"],"catch方法":["12.8"],"rejected状态":["12.8"],"返回一个布尔值结果":["13.1"],"要注意":["13.2"],"语言":["14.1"],"你会发现它有两种格式的模块":["14.1"],"br":["14.1"],"模块使用import引入具体数据和export导出指定数据":["14.2"],"只要脚本文件里面使用import或者export命令":["14.3"],"那么就必须采用":["14.3"],"mjs后缀名":["14.3"],"packagemain":["14.4"],"from":["14.4","21.6","39.3","42.3"],"package":["14.4"],"index":["14.5","33.9","33.11","33.12"],"import":["14.5","18.10","19.21","21.2"],"默认的情况下是关闭浏览器后失效":["15.1"],"存储量较小":["15.2"],"一般会携带在http请求的头部中":["15.3"],"expires":["15.4"],"thu":["15.4"],"01":["15.4"],"jan":["15.4"],"00":["15.4"],"目前见到的浏览器都支持":["15.5"],"token是用来干嘛的":["15.6"],"的意思":["15.7"],"token是服务端生成的一串字符串":["15.7"],"生成token":["15.8"],"验证成功后":["15.8"],"服务端会生成一个token":["15.8"],"然后把这个token发送给客户端":["15.8"],"后期每次请求接口都需要把他当做一个字段传给后台":["15.9"],"vue":["16.0","19.16","19.36","19.37","20.23","21.6"],"typescript":["16.0"],"定义联合类型":["17.1"],"return":["17.2","20.9","20.21","30.4","33.4","33.8","33.10","35.1","37.7"],"函数表达式":["17.2"],"else":["17.3","32.5","32.14"],"默认参数":["17.3"],"x":["17.5","17.15","17.26","17.27","17.28"],"semlinker":["17.6"],"throw":["17.8"],"loopforever":["17.8"],"while":["17.8","29.4","31.1","32.10","32.12","32.15","33.9","35.2"],"任何类型都可以被归为":["17.9"],"大object":["17.11"],"代表所有拥有":["17.11"],"tostring":["17.11"],"hasownproperty":["17.11"],"方法的类型":["17.11"],"所以所有原始类型":["17.11"],"在":["17.12"],"strlength":["17.13"],"和非":["17.14"],"ts":["17.15","17.30"],"对应的字符串字面量":["17.16"],"数字字面量":["17.16"],"布尔字面量分别拥有与其值一样的字面量类型":["17.16"],"num":["17.17"],"它是对行为的抽象":["17.18"],"而具体如何行动需要由类":["17.18"],"还提供了":["17.19"],"readonlyarray":["17.19"],"t":["17.19"],"它与":["17.19"],"propname":["17.20"],"any":["17.20"],"tom":["17.20"],"ok":["17.21"],"money":["17.23"],"和为你的":["17.24"],"代码或第三方代码":["17.24"],"定义数据模型":["17.24"],"y":["17.25"],"partialpointx":["17.26"],"interface":["17.27","17.28","17.30","17.32"],"point":["17.27","17.28"],"pointx":["17.28"],"identity":["17.29"],"arg":["17.29","17.32"],"实现这个接口即可":["17.30"],"sizeable":["17.30"],"可以用":["17.32"],"声明一个类型变量并且对它进行使用":["17.32"],"returntype":["17.32"],"args":["17.32","36.12"],"r":["17.32"],"有时候我们定义的泛型不想过于灵活或者说想继承某些类等":["17.32"],"可以通过":["17.32"],"关键字添加泛型约束":["17.32"],"lengthwise":["17.32"],"length":["17.32","29.1","29.2","29.3","29.4","33.4","33.7","33.9","33.10","35.2","37.5"],"loggingidentity":["17.32"],"url后面会带有":["18.2"],"号":["18.2"],"history模式则是通过监听popstate事件来实现更新页面部分内容的操作原理和hash模式差不多":["18.2"],"浏览器地址改变":["18.3"],"当浏览器向服务器发送请求时":["18.4"],"只会把":["18.4"],"的方式会导致浏览器向服务器发送请求":["18.5"],"但是history":["18.5"],"模式可以传输复杂一些的数据":["18.5"],"而且比hash模式美观":["18.5"],"router":["18.6"],"完之前一直处于等待中":["18.7"],"to目标路由对象":["18.7"],"from当前导航正要离开的路由对象":["18.7"],"next函数":["18.7"],"全局解析守卫beforeresolve":["18.7"],"在路由配置里调用":["18.8"],"beforeenter":["18.8"],"解析异步路由组件":["18.8"],"在被激活的组件里调用":["18.8"],"解决白屏问题":["18.9"],"调用import":["18.10"],"require":["18.11"],"放入需要加载的路由地址":["18.11"],"谁可以访问路由等":["18.12"],"你需要从服务器获取用户的数据":["18.13"],"我们可以通过两种方式来实现":["18.13"],"single":["19.1"],"page":["19.1"],"实例创建前":["19.2"],"created":["19.2"],"实例创建后":["19.2"],"beforemount":["19.2"],"子created":["19.3"],"子beforemount":["19.3"],"子mounted":["19.3"],"父mounted":["19.3"],"if表示一个dom元素是否被创建":["19.5"],"vue2中v":["19.6"],"for的优先级会更高":["19.6"],"template":["19.7"],"div":["19.7"],"addsum":["19.7"],"computed不支持异步":["19.9"],"watcher":["19.10"],"set":["19.11","20.4","20.17","20.18","20.21"],"属性":["19.11"],"将render":["19.12"],"在后":["19.12"],"这样就能实现":["19.12"],"当data属性值变化后":["19.12"],"一样":["19.13"],"也是一个监听器":["19.14"],"它只接收一个回调函数":["19.14"],"options":["19.15"],"api中methods":["19.15"],"compute":["19.15"],"data等api都是分散的":["19.15"],"而composition":["19.15"],"当我们使用":["19.16"],"具名插槽顾名思义就是具有名字的插槽":["19.17"],"子组件中可以用name熟悉对slot命名":["19.17"],"父组件在使用的时候":["19.17"],"一定要通过template":["19.17"],"中的v":["19.17"],"name或者":["19.17"],"name来定义这个插槽中的内容":["19.17"],"attrs":["19.18"],"listeners":["19.18"],"vuex有三个核心的概念":["19.19"],"state":["19.19"],"mutations":["19.19"],"actions":["19.19","19.20","19.21"],"修改state":["19.20"],"建议通过":["19.20"],"去修改":["19.20"],"action":["19.20"],"里可以直接通过":["19.20"],"访问":["19.20"],"definestore":["19.21"],"id":["19.21"],"setdata":["19.21"],"将其包裹的话这个组件就会被缓存":["19.23"],"当这个组件再一次被显示时就会保留之前的状态":["19.23"],"alive就不会调用beforedestroy":["19.25"],"一个混入对象可以包含任意组件选项":["19.26"],"当组件使用混入对象时":["19.26"],"所有混入对象的选项将被":["19.26"],"只能代理属性":["19.27"],"代理的是对象":["19.27"],"要去的位置":["19.29"],"和disabled":["19.29"],"是否留在原位置":["19.29"],"获取更新后的":["19.32"],"而虚拟dom就是为了减少这些操作的":["19.34"],"虚拟dom首先会通过状态生成一个虚拟节点树":["19.34"],"也就是通过移动代替新增":["19.35"],"两棵树的":["19.35"],"接收":["19.36"],"可透传":["19.36"],"在上级组件中的属性可以直接传给最底层的根组件":["19.36"],"最底层的根组件可以直接接收到父组件的属性":["19.36"],"父组件":["19.36"],"father":["19.36"],"在观察者模式中":["20.2"],"只有两种主体":["20.2"],"目标对象":["20.2"],"通过发布主题事件的方式通知各个订阅该主题的":["20.3"],"发布订阅模式中有三个角色":["20.3"],"进行操作代理定义":["20.4"],"enumerable":["20.4","20.15"],"configurable":["20.4","20.15"],"值的读取操作":["20.4"],"进行依赖收集":["20.4"],"depend":["20.4"],"值的更新操作":["20.4"],"触发依赖更新":["20.4"],"newval":["20.4"],"初始化数据":["20.5"],"data":["20.5","20.9","20.13","20.16","33.1"],"computed":["20.5"],"数据过程中":["20.5"],"val":["20.7"],"修改":["20.8"],"observe":["20.8"],"如果obj内有嵌套的属性呢":["20.9"],"我们可以使用递归来完成嵌套属性的数据劫持":["20.9"],"入口函数":["20.9"],"调用observer":["20.9"],"以array":["20.10"],"依赖":["20.11"],"此时watcher在dep集合里":["20.11"],"dep使用发布订阅模式":["20.11"],"setter方法":["20.12"],"通知watcher":["20.12"],"watcher能够控制自己属于哪个":["20.13"],"是data中的属性的还是watch":["20.13"],"或者是computed":["20.13"],"watcher自己有统一的更新入口":["20.13"],"只要你通知它":["20.13"],"就会执行对应的更新方法":["20.13"],"watcher必须要有的2个方法":["20.13"],"一个就是通知变化":["20.13"],"另一个就是被收集起来到dep中去":["20.13"],"constructor":["20.13"],"dep收集到了一个依赖watcher":["20.14"],"这个依赖就是用来管理data中数据变化的":["20.14"],"使用watch时":["20.14"],"自定义的监听某个data中属性的变化":["20.14"],"属性变化时通知watch执行回调函数":["20.14"],"dep收集到了第二个个依赖":["20.14"],"第二个依赖就是用来管理watch中message变化的":["20.14"],"所有才会导致":["20.16"],"没有在":["20.16"],"中进行声明的对象属性直接赋值时无法触发视图更新":["20.16"],"reflect":["20.17","20.19"],"与":["20.18"],"effect":["20.18"],"receiver":["20.19","20.32"],"res":["20.19"],"fn":["20.20"],"创建一个内部的副作用函数":["20.20"],"然后立即执行":["20.20"],"此时会触发对象的":["20.20"],"depsmap":["20.21","20.29"],"通过一个副作用":["20.23"],"更新":["20.24"],"方法调用之外":["20.24"],"对整个对象的新增":["20.24"],"删除":["20.24"],"至于":["20.25"],"shallowreadobly":["20.25"],"的话":["20.25"],"其实就是读取什么返回什么":["20.25"],"基本没有别的处理了":["20.25"],"接受一个内部值":["20.25"],"返回一个响应式的":["20.25"],"可更改的":["20.25"],"refimpl":["20.26"],"类型的实例":["20.26"],"其中的":["20.26"],"就保存响应式数据":["20.26"],"并定义了对象的":["20.26"],"函数收集起来放进dep里":["20.27"],"track":["20.28","20.32"],"activeeffect":["20.28"],"targetmap":["20.29"],"访问时收集依赖":["20.32"],"所以实际是访问的值是receiver的key的值":["20.33"],"但是这可不是直接访问":["20.33"],"在proxy里使用reflect会提高语义化":["20.34"],"v":["21.0"],"钩子函数对象":["21.2"],"我们会在下面介绍":["21.2"],"全局注册app":["21.2"],"createapp":["21.2"],"绑定元素的父组件卸载后调用":["21.3"],"unmounted":["21.3"],"钩子参数el":["21.3"],"指令绑定到的元素":["21.3"],"这可以用于直接操作":["21.3"],"一个对象":["21.3"],"包含以下属性":["21.3"],"attributes":["21.4"],"app":["21.6"],"没有要复制的内容":["22.0","26.0"],"textarea":["22.0","26.0"],"document":["22.0","26.0"],"readonly":["22.0","26.0"],"dep":["25.0"],"current":["28.1","32.15","33.6","33.8"],"o":["28.3","28.4"],"j":["29.1"],"math":["29.4","30.5"],"floor":["29.4"],"pivotvalue":["29.5"],"splice":["29.5"],"判断是否是修改":["30.2"],"limit":["30.3"],"bucket":["30.3"],"storage":["30.3"],"temp":["30.5"],"parseint":["30.5"],"getprime":["30.6"],"resize":["30.7"],"newlimit":["30.7"],"oldstorage":["30.7"],"isempty":["31.0"],"tree":["32.1"],"也称二叉排序树或二叉查找树":["32.1"],"二叉搜索树是一颗二叉树":["32.1"],"相对较大的值总是保存在右结点上":["32.2"],"如果结点存在":["32.3"],"则返回true":["32.3"],"如果不存在":["32.3"],"则返回false":["32.3"],"指向的右子树":["32.4"],"对于binaryserachtree来说":["32.4"],"只需要保存根结点即可":["32.4"],"insertnode":["32.5"],"root":["32.7","32.8","32.12"],"node":["32.7","32.9","33.1"],"left":["32.10"],"parent":["32.12"],"isleftchild":["32.12"],"只是清空了根":["32.13"],"因为只有它":["32.13"],"否则就把父节点的left或者right字段设置为null即可":["32.13"],"剪短":["32.14"],"让爷爷直接连接儿子即可":["32.14"],"这个过程要求改变父节点的left或者right":["32.14"],"指向要删除节点的子节点":["32.14"],"当然":["32.14"],"在这个过程中还要考虑是否current就是根":["32.14"],"getsuccessor":["32.15"],"delnode":["32.15"],"successor":["32.15"],"right":["32.15","40.8"],"successorparent":["32.15"],"情况2":["32.16"],"非叶子结点":["32.16"],"只有一个节点":["32.16"],"右为空":["32.16"],"第一个节点为空":["33.2"],"把新节点放在第一个节点":["33.2"],"str":["33.3"],"情况一":["33.4","33.12"],"把插入的data放在首位":["33.4","33.12"],"新插入的newnode":["33.4","33.11","33.12"],"next指向原来的第一个":["33.11","33.12"],"head指向新插入的":["33.11","33.12"],"情况二":["33.11","33.12"],"后一个":["33.11","33.12"],"prev":["33.11","33.12"],"前一个":["33.11","33.12"],"从头开始找位置":["33.11","33.12"],"priorityqueue":["34.1","34.2"],"创建一个内部类":["34.1"],"queueelement":["34.1","34.2"],"element":["34.1","34.2"],"priority":["34.1","34.2"],"enqueue":["34.1","35.2"],"extends":["34.2"],"super":["34.2"],"dequeue":["35.1"],"不改变原数组":["36.5","36.6"],"里面是一个值":["36.6"],"result12":["36.7"],"返回true或false":["36.8"],"arr8":["36.10"],"arr":["36.11","36.12","38.0"],"方法":["36.12"],"但比分别调用这两个方法稍微更高效一些":["36.12"],"它返回修改后的数组":["36.13"],"改变原数组":["36.13"],"填充一个数到最后":["36.13"],"result15":["36.13"],"result13":["36.14"],"foobar":["36.15"],"result16":["36.15","37.1"],"创建一个具有单个元素":["36.16"],"的数组":["36.16"],"arr4":["36.18"],"arr5":["36.19","36.22","36.23"],"有着和":["36.20"],"shift相似的行为":["36.20"],"但是是作用在数组的最后一个元素上的":["36.20"],"arr15":["36.21"],"result21":["36.22"],"result23":["36.23"],"arr6":["36.24"],"累加":["36.25"],"arr9":["36.26"],"arr10":["36.27"],"包括":["36.28"],"不包括end":["36.28"],"原始数组不会被改变":["36.28"],"arr13":["36.29"],"arr14":["36.30"],"例如一个逗号":["36.31"],"隔开":["36.31"],"arr17":["36.32"],"arr3":["37.1"],"split":["37.2"],"item":["37.2","37.6"],"foreach":["37.6"],"cur":["38.3"],"result5":["38.5"],"流光按钮":["39.1","39.4"],"ljt":["39.2","39.3","40.2","40.3","41.0","42.2","42.3"],"添加圆角":["40.1"],"round":["40.1"],"btn":["40.3"],"在组件内挂载之后只需要引用下面这行代码":["40.3"],"success":["40.4"],"事例":["40.4"],"l":["40.4","40.5","40.6","40.7","40.8"],"button":["40.5","40.6","40.7","40.8"],"type":["40.5","40.6","40.7","40.8"],"例如上面展示的效果":["40.8"],"primary":["40.8"],"award":["42.1"],"auction":["42.1"],"aixin":["42.1","42.10"],"会在图标右上角展示相应的徽标":["42.4"],"例如":["42.4"],"licon":["42.5"],"red":["42.7"],"artboard":["42.9"],"fanhui":["42.12"],"arrow":["42.12"],"guanbi":["42.14"],"shuaxin":["42.15"],"sousuo":["42.15"],"shangchuan":["42.16"],"bangzhu":["42.16"],"那么table剩余的宽度会被其他的td平均分":["43.2"],"有点类似flex布局":["43.2"],"给table设置的高度起到的作用只是min":["43.2"],"height的作用":["43.2"],"当内容的高度高于设置的高度时":["43.2"],"table的高度会被撑高":["43.2"],"tr标签":["43.2"],"call":["43.3"],"telphone":["43.5"],"pop":["43.7"],"rehect":["43.9"],"settimeout":["43.13"],"所以要过渡某些属性":["43.14"],"首先需要将其重置成具体数字值":["43.14"],"change事件和inpute事件":["43.15"],"面试题":["46.0"],"代码手撕":["46.0","47.0"],"等不及了从这里开始你的":["47.0"]},{"0":["1.1","1.5","10.39","29.5","30.2","33.6"],"1":["3.12","5.2","9.4","9.25","10.53","19.26","20.5","32.7","32.8","32.9","33.11","33.12","35.2","36.17","36.20","36.28","36.31","43.4"],"2":["3.2","5.7","5.15","6.11","6.15","6.17","8.1","9.11","9.18","10.11","10.13","10.27","10.28","10.53","15.1","15.5","20.5","20.34","31.1","36.11","36.12","36.17","36.20","36.27","36.28","36.31","38.0","43.12"],"3":["3.6","6.9","6.14","9.17","10.47","10.53","12.0","19.19","19.35","21.3","36.10","36.11","36.12","36.17","36.18","36.19","36.21","36.26","36.27","36.30","36.31","37.0","38.0","43.17"],"4":["5.8","5.9","6.9","11.3","12.8","15.8","20.11","20.14","36.10","36.11","36.18","36.19","36.21","36.26","36.27","36.29","36.30","36.32"],"5":["11.3","36.1","36.2","36.3","36.10","36.13","36.18","36.19","36.21","36.26","36.29","36.30","36.32"],"6":["17.32","36.1","36.2","36.3","36.10","36.19","36.21","36.26","36.29","36.30","36.32"],"7":["8.2","36.1","36.2","36.3","36.26","36.29"],"8":["8.2","18.8","36.1","36.2","36.3","36.29"],"9":["18.8"],"24":["4.0"],"35":["17.32"],"42":["11.8","11.10","11.25"],"123":["17.10"],"305":["9.15"],"307":["9.15"],"400":["9.15"],"401":["9.15"],"403":["9.15"],"relative":["1.1","2.7"],"absolute":["1.1"],"top":["1.1","22.0","26.0"],"float属性不是none":["1.2"],"position为absolute或者fixed":["1.2"],"display为inline":["1.2"],"grow":["1.4"],"设置了对应元素的增长系数":["1.4"],"相当于可扩大":["1.5","1.6"],"可缩小":["1.6"],"相当于不可扩大":["1.7","1.8"],"auto":["1.8"],"是继承属性":["1.10"],"子孙节点消失由于继承了hidden":["1.10"],"通过设置visibility":["1.10"],"visible":["1.10"],"可以让子孙节点显式":["1.10"],"opacity":["1.10"],"fixed":["1.11","22.0","26.0"],"同时":["1.11"],"不可交互":["1.12"],"注意":["1.12"],"此方法对行内元素无效":["1.12"],"px全称pixel像素":["1.13"],"是相对于屏幕分辨率而言的":["1.13"],"css3":["1.14"],"新单位":["1.14"],"即":["1.14"],"flow":["1.15"],"justify":["1.15"],"content":["1.15","9.11","19.17"],"align":["1.15"],"items":["1.15"],"布局一次只能处理一个维度上的元素布局":["1.16"],"考虑兼容性":["1.17"],"layer":["1.18"],"这使得被动画元素在一个独立的层中进行动画":["1.18"],"通常情况下":["1.18"],"浏览器会将一个层的内容先绘制进一个位图中":["1.18"],"时该元素的位置并不受到定位影响":["1.19"],"设置是top":["1.19"],"left等属性无效":["1.19"],"当该元素的位置将要移出偏移范围时":["1.19"],"定位又会变成fixed":["1.19"],"这个是":["1.20"],"flex":["1.20"],"布局的内容":["1.20"],"delay":["1.21"],"指定过渡的延迟时间":["1.21"],"关键帧动画":["1.21"],"name":["1.21","4.0","11.30","17.32","19.17","42.5"],"指定要绑定到选择器的关键帧的名称":["1.21"],"可以指定一些特定形状":["1.22"],"裁剪一张图像":["1.22"],"实现一个三角形":["2.0"],"会把视口的宽度平均分为":["2.1"],"给浮动元素父级设置高度":["2.2"],"父级同时浮动":["2.2"],"需要给父级同级元素添加浮动":["2.2"],"父级设置成":["2.2"],"主要区别是二者的盒子宽高是否包括元素的边框和内边距":["2.3"],"触发重排和重绘":["2.4"],"通过visibility":["2.4"],"webp":["2.5"],"格式的浏览器尽量使用":["2.5"],"格式":["2.5"],"clip":["2.6"],"文本效果":["2.6"],"text":["2.6"],"word":["2.6"],"wrap":["2.6"],"position":["2.7","22.0","26.0"],"双飞翼布局":["2.7"],"浮动":["2.7"],"外边距负值":["2.7"],"双飞翼布局相对于圣杯布局来说":["2.7"],"左右位置的保留是通过中间列的margin值来实现的":["2.7"],"而不是通过父元素的padding来实现的":["2.7"],"模块化规范是":["3.1"],"按需导出与按需导入":["3.3"],"default":["3.4","19.30"],"按需导入时":["3.5"],"只要作用域内存在let":["3.6"],"const":["3.6","10.58","11.30","12.2","17.10","17.32","20.22","21.2","39.2","40.2","42.2"],"它们所声明的变量或常量就会自动":["3.6"],"局部作用域":["3.7"],"块级作用域":["3.7"],"this":["3.7","11.15","11.30","17.16","20.13","32.14","33.3"],"let":["3.8","10.52","10.54","17.16","17.19","20.27","31.0","33.5","33.7","36.6","36.8","36.12","36.20","36.28"],"a":["3.8","6.3","10.52","11.8","17.19","20.7","37.7"],"普通函数的this指向":["3.9"],"谁调用指向谁":["3.9"],"创建类的方式":["3.11"],"也可以使用export":["3.12"],"default导出":["3.12"],"getownpropertysymbols":["4.0"],"方法遍历出来":["4.0"],"该方法返回一个数组":["4.0"],"包含了当前对象的所有用作属性名的symbol值":["4.0"],"var":["4.0","10.76","10.77","11.14"],"s1":["4.0"],"s2":["4.0"],"b":["4.0","9.11","11.8","11.25","37.7"],"江左梅郎":["4.0"],"function":["4.0","10.64","11.30","17.10","17.30","20.25","32.4"],"s":["4.0"],"dom":["5.1"],"提供了对":["5.1"],"需要三个阶段":["5.2"],"通过分词器将字节流转换为":["5.2"],"token":["5.2","15.8"],"v8":["5.2"],"编译":["5.2"],"javascript":["5.2","5.3"],"过程中的第一步是做词法分析":["5.2"],"将":["5.2"],"先分解为一个个":["5.2"],"解析":["5.2","5.4"],"如果要下载javascript代码":["5.4"],"下载过程会阻塞dom":["5.4"],"async":["5.5"],"的能力":["5.6"],"所以在执行":["5.6"],"之前":["5.6"],"还需要依赖":["5.6"],"也就是说":["5.6"],"在部分情况下也会阻塞":["5.6"],"事件":["5.7"],"解析并执行脚本代码":["5.8","10.47"],"将dom和cssom合并成一棵渲染render树":["5.9","6.9"],"对渲染树进行reflow":["5.9"],"渲染引擎会尽快将内容显示在屏幕上":["5.10"],"样式表构建完毕后才开始构建的":["5.11"],"嵌套标签越多":["5.12"],"浏览器会从构建":["5.13"],"树开始从头到尾执行一遍流程":["5.13"],"需要更新":["5.13"],"内容保存到本地一个":["5.14"],"js":["5.14","10.5","10.54","10.58","10.76","10.77","12.2","16.0","18.5","19.29","19.36","32.4","36.6","36.12","39.4","42.4","42.8","42.9","42.10","42.11","42.12","42.13","42.14","42.15","42.16"],"对象中":["5.14"],"最终将这个":["5.14"],"对象一次性":["5.14"],"attch":["5.14"],"diff算法比较两棵虚拟":["5.15"],"方法创建":["5.17"],"在浏览器发展的过程中":["6.1"],"html出现过很多版本":["6.1"],"属性表示网页的标题":["6.2"],"元素则表示层次明确的页面内容标题":["6.2"],"对页面信息的抓取也有很大的影响":["6.2"],"span":["6.3"],"img":["6.3"],"button":["6.3","40.4"],"input":["6.3","6.4"],"select":["6.3"],"块级元素":["6.3"],"for":["6.4","10.25","10.61","29.4","29.5","30.5","30.7","34.1","34.2","37.4"],"male":["6.4","17.20"],"男":["6.4"],"也可以用来发送短信":["6.5"],"description":["6.6"],"方法可以让浏览器识别新的标签":["6.7"],"浏览器支持新标签后":["6.7"],"还可以为新标签添加css样式":["6.7"],"表单控件":["6.8"],"calemdar":["6.8"],"date":["6.8"],"time":["6.8"],"email":["6.8"],"display":["6.10"],"none":["6.10"],"计算渲染树中的元素大小和位置":["6.11"],"重绘不一定重排":["6.12"],"repaint":["6.13"],"时":["6.13","9.11"],"只需要":["6.13"],"本身":["6.13"],"不会影响到其他的层":["6.13"],"的父层共用一个":["6.14"],"它使用":["6.14"],"gpu":["6.14"],"元素将会被绘制在普通文档流中":["6.15"],"demo":["6.15"],"这一点浏览器也考虑到了":["6.16"],"因此就有了层压缩":["6.16"],"出现层爆炸的现象":["6.17"],"非语义元素":["6.18"],"div":["6.18","19.37"],"提升用户体验":["6.19"],"例如title":["6.19"],"alt可以用于解释名称或者解释图片信息":["6.19"],"搜索引擎优化是一种":["7.1"],"利用搜索引擎的搜索规则来提高目前网站在有关搜索引擎内的自然排名的方式":["7.1"],"关键词":["7.2"],"最多不要超过五个":["7.3"],"有利于提升搜索引擎针对对应关键词的搜索排名":["7.4"],"内容质量":["7.5"],"内容质量不能乱写":["7.5"],"原创":["7.5"],"躲避搜索引擎的文章对比机制":["7.5"],"关键词密度":["7.5"],"所有的属性必须用引号":["8.2"],"括起来":["8.2"],"把所有":["8.2"],"和":["8.2","19.23","19.30","20.2","21.3","43.11"],"符合规范":["8.3"],"同时提高页面渲染速度":["8.3"],"http服务器则在那个端口监听客户端的请求":["9.1"],"一旦收到请求":["9.1"],"服务器会向客户端返回一个状态":["9.1"],"比如":["9.1","17.17"],"无连接":["9.2"],"每次连接只处理一个请求":["9.2"],"服务器处理完客户请求":["9.2"],"网际协议":["9.3"],"是指能够在多个不同网络间实现信息传输的协议簇":["9.3"],"要比http协议安全":["9.4"],"主要区别":["9.4"],"http的url由":["9.4"],"http":["9.4","9.20"],"的出现":["9.5"],"相比于":["9.5"],"参数":["9.6"],"向指定资源位置上传其最新内容":["9.8"],"delete":["9.8","10.59"],"请求服务器删除":["9.8"],"request":["9.8"],"uri":["9.8"],"所标识的资源":["9.8"],"options":["9.8"],"使服务器传回该资源所支持的所有http请求方法":["9.8"],"get请求参数在url地址上":["9.9"],"直接暴露":["9.9"],"post请求的参数放request":["9.9"],"body部分":["9.9"],"按f12也直接暴露了":["9.9"],"向服务器发送大量数据":["9.10"],"post":["9.10"],"值为页面":["9.11"],"的地址":["9.11"],"host":["9.11","10.73"],"请求的主机和端口号":["9.11"],"请求和响应常见通用的":["9.11"],"type":["9.11","17.28"],"key":["9.12","10.25","11.26","17.23","20.22","32.10"],"value":["9.12","10.57","11.6","11.7","11.26","20.4","20.25"],"响应体":["9.13"],"理解":["9.14"],"接收":["9.14"],"3xx":["9.14"],"使用代理":["9.15"],"请求者只能使用代理访问请求的网页":["9.15"],"如果服务器返回此响应":["9.15"],"还表示请求者应使用代理":["9.15"],"临时重定向":["9.15"],"4xx":["9.15"],"客户端错误":["9.15"],"错误请求":["9.15"],"服务器不理解请求的语法":["9.15"],"未授权":["9.15"],"请求要求身份验证":["9.15"],"对于需要登录的网页":["9.15"],"服务器可能返回此响应":["9.15"],"禁止":["9.15"],"服务器拒绝请求":["9.15"],"查询":["9.17"],"会使用":["9.18"],"dns缓存":["9.19"],"但在这之前":["9.19"],"会向检查域名是否存在本地的":["9.19"],"发送":["9.20"],"请求":["9.20","10.12"],"进行三次握手判断服务端的接收":["9.25"],"发送能力":["9.25"],"客户端的接收":["9.25"],"发送能力是否是正常的":["9.25"],"会发送":["9.26"],"ack":["9.26"],"表明已经收到客户端的报文了":["9.26"],"此时服务端处于":["9.26"],"close":["9.26"],"number":["10.1","11.31","17.1","17.5","17.13","17.26","17.27","17.30"],"undefined":["10.1","11.21","43.3"],"识别函数":["10.2"],"prototype":["10.3","12.4"],"tostring":["10.3","31.0"],"它是一个专门检测数据类型的方法":["10.3"],"它返回的值是一个形如":["10.3"],"的字符串":["10.3"],"通常会编写一个函数":["10.3"],"对返回的字符串从第8位做一个截取":["10.3"],"截取到倒数第一位":["10.3"],"再去做类型比较":["10.3"],"call":["10.3","11.13"],"浏览器会立即加载并执行指定的脚本":["10.4"],"立即":["10.4"],"也就是类似于把这个script放在了页面底部":["10.6"],"执行时间不同":["10.7"],"所以是闭包":["10.8"],"以普通函数形式调时严格模式下this指向undefined":["10.9"],"浏览器的事件循环由一个宏任务队列":["10.11"],"多个微任务队列组成":["10.11"],"首先":["10.11"],"渲染事件":["10.12"],"script":["10.12"],"settimeout":["10.12","12.3"],"这种设计是为了给高优先级任务一个插队的机会":["10.13"],"如果当前事件循环的队列里还有其他回调":["10.14"],"需要等其他回调执行完":["10.14"],"且修改新对象不会影响原对象":["10.17"],"所以如果其中一个对象改变了这个地址":["10.18"],"就会影响到另一个对象":["10.18"],"新对象":["10.19"],"就像是一个整体":["10.19"],"全局变量赋值":["10.20"],"在内存中进行操作":["10.21"],"gc":["10.22"],"回收":["10.22"],"其次包含函数":["10.23"],"内部定义的变量":["10.23"],"只有判断nan时为true":["10.24"],"ljt":["10.25"],"a为假时执行a":["10.26"],"对象转换时":["10.27"],"优先调用tostring":["10.27"],"不同点":["10.32"],"typeof判断null为object":["10.32"],"判断undefined为undefined":["10.32"],"二进制前三位为000则会被判断为object类型":["10.33"],"值相同":["10.34"],"转成number类型":["10.35"],"自增自减运算符":["10.35"],"false转换为0":["10.36"],"而true转换为1":["10.36"],"可转换成nan":["10.37"],"nan":["10.37","10.52"],"可转换成0":["10.38"],"false先转数字0":["10.39"],"所以可转换为":["10.39"],"javascript的计算存在精度丢失问题":["10.40"],"原因":["10.40"],"javascript中小数是浮点数":["10.40"],"不阻止冒泡":["10.43"],"fun":["10.44"],"由最不具体的元素接收":["10.45"],"的封装":["10.46"],"stoppropagation":["10.48"],"preventdefault":["10.49"],"绑定在父元素上只需要绑定一次":["10.50"],"get":["10.51","20.7","20.8","20.15","20.20","20.28"],"set":["10.51","11.13","20.26","20.32","20.33"],"new":["10.52","10.54","10.58","10.71","11.14","11.30","34.1"],"from":["10.55","18.11","19.21","19.36","21.2","38.5"],"item":["10.56"],"filter":["10.57"],"has":["10.57","10.59","20.17"],"的形式储存":["10.58"],"m":["10.58"],"判断字典中是否存在键key":["10.59"],"creat":["10.60"],"null":["10.60","11.21","11.22","12.5","30.3","32.7","32.8","32.9","32.13","32.14","32.15","33.2","33.5"],"为":["10.62","36.16"],"false":["10.62","33.7","34.1","34.2"],"工厂模式创建":["10.64"],"createobj":["10.64"],"这种就是改变了this了":["10.65"],"splice":["10.66"],"截取数组":["10.66"],"返回被截取的区间":["10.66"],"join":["10.66","31.0"],"将一个数组所有元素连接成字符串并返回这个字符串":["10.66"],"concat":["10.66"],"arr1":["10.66"],"floor":["10.67"],"小数向下取整":["10.67"],"confirm":["10.70"],"occupation":["10.72"],"pānting":["10.72"],"encoded":["10.72"],"innerwidth":["10.73"],"获取浏览器窗口的宽":["10.73"],"location":["10.73"],"操作刷新按钮和地址":["10.73"],"的应用程序接口":["10.74"],"api":["10.74"],"遵循w3c":["10.74"],"的标准":["10.74"],"所有浏览器公共遵守的标准":["10.74"],"使用":["10.78"],"form":["10.79"],"元素中使用":["10.79"],"该对象将会包裹":["11.2"],"c":["11.3","11.25","20.13","36.24"],"returnedtarget":["11.3"],"human":["11.4"],"me":["11.4"],"方法会直接在一个对象上定义一个新属性":["11.5"],"property1":["11.6","11.7"],"object1":["11.8"],"somestring":["11.8"],"不能删除已有属性":["11.9"],"不能修改该对象已有属性的可枚举性":["11.9"],"baz":["11.10"],"方法返回":["11.11"],"create":["11.12"],"创建一个新的实例对象":["11.12"],"console":["11.12","11.14","11.19","11.20","17.15","20.15","43.13"],"log":["11.14","11.19","11.20","12.6","17.15","20.15","36.22","36.23","43.13"],"descriptor1":["11.16"],"包括不可枚举属性但不包括":["11.17"],"symbol":["11.17"],"localsymbol":["11.18"],"globalsymbol":["11.18"],"foo":["11.22","43.4"],"bar":["11.22"],"方法判断一个对象是否是可扩展的":["11.23"],"ordering":["11.26"],"when":["11.26"],"we":["11.26"],"use":["11.26","19.16"],"numeric":["11.26"],"keys":["11.26"],"the":["11.26"],"returned":["11.26"],"numerical":["11.26"],"order":["11.26"],"according":["11.26"],"to":["11.26"],"方法让一个对象变的不可扩展":["11.27"],"方法返回一个布尔值":["11.28"],"方法封闭一个对象":["11.29"],"dog":["11.30","17.10"],"dog1":["11.30"],"回调有两个参数":["12.0"],"resolve":["12.0"],"方法的第二个参数reject捕获的异常依赖于上一个":["12.1"],"对象的执行结果":["12.1"],"success":["12.1"],"faild":["12.1"],"接收两个函数作为参数":["12.1"],"来处理上一个promise":["12.1"],"对象的结果":["12.1"],"状态只要从待定状态":["12.2"],"变为其他状态":["12.2"],"则状态不能再改变":["12.2"],"promise":["12.2","12.4"],"hi":["12.7"],"ice":["12.7"],"catch":["12.8","43.9"],"err":["12.8"],"当遇到rejectd的时候":["12.8"],"后续的promise结果我们是获取不到":["12.8"],"并且会把reject的实参":["12.8"],"传递给catch的err形参中":["12.8"],"allsettled":["12.8"],"上面的promise":["12.8"],"all有一个缺陷":["12.8"],"就是当遇到一个rejected的状态":["12.8"],"那么对于后面是resolve或者reject的结果我们是拿不到的":["12.8"],"es11":["12.8"],"新增语法promise":["12.8"],"无论状态是fulfilled":["12.8"],"rejected都会把参数返回给我们":["12.8"],"与严格相等运算符":["13.1"],"转数字为0":["13.2"],"false转数字为0":["13.2"],"转布尔值为true":["13.2"],"取反为false":["13.2"],"一种是":["14.1"],"br":["14.2"],"用法上面":["14.2"],"require":["14.2"],"遇到":["14.3"],"mjs文件":["14.3"],"method":["14.4"],"因为":["14.4"],"模块需要支持静态代码分析":["14.4"],"而":["14.4","20.24"],"esm":["14.5"],"wrapper":["14.5"],"localstorage和sessionstorage三者都是在开发中用到的临时存储客户端会话信息或者数据的方法":["15.0"],"一般页面最多存储20条左右信息":["15.2"],"例如一些关键密匙验证等":["15.3"],"gmt":["15.4"],"sessionstorage的相关操作":["15.4"],"存储":["15.4"],"sessionstorage":["15.4"],"setitem":["15.4"],"数据名":["15.4"],"数据值":["15.4"],"以作客户端进行请求的一个令牌":["15.7"],"会有xss攻击":["15.9"],"node":["16.0","32.8"],"ajax":["16.0"],"arr3":["17.1"],"表示定义了一个名称叫做arr的数组":["17.1"],"这个数组中将来既可以存储数值类型的数据":["17.1"],"mysum":["17.2"],"buildname":["17.3"],"cat":["17.3"],"类型必须匹配且个数必须为2":["17.5"],"id":["17.6"],"username":["17.6"],"你只能为它赋予null和undefined":["17.7"],"在strictnullchecks未指定为true时":["17.7"],"声明一个void类型的变量没有什么大用":["17.7"],"我们一般也只有在函数没有返回值时去声明":["17.7"],"never类型同null和undefined一样":["17.8"],"也是任何类型的子类型":["17.8"],"也可以赋值给任何类型":["17.8"],"但是没有类型是never的子类型或可以赋值给never类型":["17.8"],"除了never本身之外":["17.8"],"即使any也不可以赋值给never":["17.8"],"在":["17.8"],"typescript":["17.8"],"中":["17.8","17.12","21.3"],"可以利用":["17.8"],"error":["17.10"],"如果不缩小类型":["17.10"],"就无法对unknown类型执行任何操作":["17.10"],"getdog":["17.10"],"return":["17.10","17.29","20.28","20.32","28.3","30.3","32.10","33.5","33.7","38.1","38.2"],"非原始类型都可以赋给":["17.11"],"同样":["17.11"],"length":["17.13","30.2","30.4","33.5","36.16"],"类型":["17.14"],"具体而言":["17.14"],"initialize":["17.15"],"ts":["17.16","20.25"],"specifiedstr":["17.16"],"true":["17.17","32.11"],"缺省显式类型注解的可变更的变量的类型转换为了赋值字面量类型的父类型":["17.17"],"的类型是":["17.17"],"classes":["17.18"],"去实现":["17.18"],"相似":["17.19"],"只是把所有可变方法去掉了":["17.19"],"因此可以确保数组创建后再也不能被修改":["17.19"],"gender":["17.20"],"需要注意的是":["17.20"],"一旦定义了任意属性":["17.20"],"那么":["17.20"],"类型断言":["17.22"],"any":["17.23"],"类型别名":["17.24"],"会给一个类型起个新名字":["17.24"],"setpoint":["17.25"],"partialpointy":["17.26"],"y":["17.26","17.28"],"类别名扩展类别名":["17.28"],"其中":["17.29"],"代表":["17.29"],"size":["17.30","35.2"],"索引类型":["17.32"],"getvalues":["17.32"],"person":["17.32"],"map":["17.32","20.21"],"string":["17.32","31.0"],"age":["17.32"],"musion":["17.32"],"只不过url后面不会出现":["18.2"],"会显得更加美观":["18.2"],"同时会带来一个问题":["18.2"],"因为没有":["18.2","18.5"],"点击前进后退按钮":["18.3"],"当监听到history变化之后":["18.3"],"前面部分发送给服务器":["18.4"],"一般前面部分的是不变的":["18.4"],"所以hash":["18.4"],"window":["18.5"],"addeventlistener":["18.5"],"push":["18.6","31.1","34.1"],"path":["18.6"],"和beforeeach类似":["18.7"],"区别是在导航被确认之前":["18.7"],"同时在所有组件内守卫和异步路由":["18.7"],"组件被解析之后调用":["18.7"],"全局后置钩子aftereach":["18.7"],"在路由跳转完成后调用":["18.7"],"from两个参数":["18.7"],"不会接受":["18.7"],"beforerouteenter":["18.8"],"beforeresolve":["18.8"],"懒加载简单来说就是延迟加载或按需加载":["18.9"],"之处":["18.10"],"vuerouterconfig":["18.11"],"webpack写法":["18.11"],"将import":["18.11"],"userdetails":["18.11"],"这些事情可以通过接收属性对象的meta属性来实现":["18.12"],"导航完成之后获取":["18.13"],"先完成导航":["18.13"],"application":["19.1"],"onbeforemount":["19.2"],"dom挂载前调用":["19.2"],"mounted":["19.2"],"渲染":["19.3"],"更新过程":["19.3"],"而v":["19.5"],"show则是控制这个dom元素的display属性是否为none":["19.5"],"所以会先执行循环":["19.6"],"再进行v":["19.6"],"if判断":["19.6"],"都是以":["19.9"],"vue":["19.9","21.2"],"实例对象":["19.10"],"而且":["19.11"],"render函数执行":["19.12"],"computed属性函数执行并返回新执行结果":["19.12"],"是在组件挂载前":["19.13"],"但是其收集对象是自己属性对应的":["19.13"],"而在这个回调函数当中":["19.14"],"它会自动监听响应数据":["19.14"],"api中的代码是根据逻辑功能来组织的":["19.15"],"我们可以将一个功能所定义的methods":["19.15"],"data等api会放在一起":["19.15"],"让我们可以更灵活地组合组件逻辑":["19.15"],"plugin":["19.16"],"v":["19.17","21.3"],"无":["19.18"],"合并到":["19.18"],"attrs方式":["19.18"],"provide":["19.18"],"其中state为存放数据的地方":["19.19"],"mutations中的函数作用则是用来修改state":["19.19"],"actions中一般是用了处理一些异步操作的函数":["19.19"],"changename":["19.20"],"通过getter修改":["19.20"],"不建议":["19.20"],"方法每次页面渲染都会调用":["19.20"],"性能消化大":["19.20"],"useuserstore":["19.21"],"user":["19.21"],"alive接收两个属性include":["19.23"],"exclude":["19.23"],"分别代表哪些组件要用缓存和哪些不需要缓存":["19.23"],"第二次或以后使用组件时触发activated":["19.24"],"beforecreate":["19.24"],"组件销毁前钩子":["19.25"],"混合":["19.26"],"进入该组件本身的选项":["19.26"],"mixin的作用将组件的公共逻辑提取出来":["19.26"],"对象上新增属性":["19.27"],"proxy可以监听到":["19.27"],"defineproperty不能":["19.27"],"接收比如下面代码":["19.29"],"组件有两个插槽":["19.30"],"这是什么意思呢":["19.32"],"其实vue中修改data不会立刻触发dom更新":["19.32"],"js对象":["19.34"],"o":["19.35"],"n":["19.35"],"的":["19.35","20.18"],"从pinia拿数据":["19.36"],"import":["19.36"],"usemealsstore":["19.36"],"defineemit":["19.37"],"hide":["19.37"],"click":["19.37"],"object":["20.2","20.24","28.3","36.22","36.23"],"发布者":["20.3"],"事件调度中心":["20.3"],"event":["20.3"],"notify":["20.4"],"观察者的构造函数":["20.4"],"接收一个表达式和回调函数":["20.4"],"watcher":["20.4"],"vm":["20.4"],"exporfn":["20.4"],"cb":["20.4","20.13"],"parsepath":["20.4"],"实例触发值读取时":["20.4"],"会涉及到以下几个对象":["20.5"],"下文中该方法统称为getter":["20.7"],"defineproperty":["20.8","20.16","20.24"],"reactivegetter":["20.8"],"遍历obj的属性":["20.9"],"遍历该对象":["20.9"],"并进行数据劫持":["20.9"],"prototype为原型":["20.10"],"当数据发生变化时":["20.11"],"循环依赖列表":["20.11"],"把所有的watcher通知一遍":["20.11"],"watcher收到后执行回调":["20.12"],"expression":["20.13"],"数据对象":["20.13"],"如obj":["20.13"],"表达式":["20.13"],"如b":["20.13"],"根据data和expression就可以获取watcher依赖的数据":["20.13"],"依赖变化时触发的回调":["20.13"],"使用computed计算属性时":["20.14"],"a属性是依赖b属性变化的时":["20.14"],"b变化时要通知到computed":["20.14"],"让它去执行回调函数":["20.14"],"这个时候message的dep就收集到了三个依赖":["20.14"],"这个依赖就是用来管理computed中message变化的":["20.14"],"我被读了":["20.15"],"我要不要做点什么好":["20.15"],"被读取了":["20.15"],"将这个依赖收集起来":["20.15"],"碍于":["20.16"],"prop":["20.17"],"方法时":["20.18"],"会访问属性":["20.18"],"state":["20.18"],"counter":["20.18"],"此时会触发":["20.18"],"track":["20.19","20.20"],"收集依赖":["20.19"],"操作":["20.20"],"调用":["20.20"],"dep":["20.21"],"depsmap":["20.22","20.28"],"targetmap":["20.22"],"effect":["20.23"],"函数来跟踪当前正在运行的函数":["20.23"],"枚举等也能直接拦截":["20.24"],"对象":["20.25"],"此对象只有一个指向其内部值的属性":["20.25"],"t":["20.25"],"方法":["20.26"],"用来收集依赖和发布更新事件":["20.26"],"如果不是":["20.26"],"shallowref":["20.26"],"声明的浅层响应式数据的话":["20.26"],"其":["20.26"],"activeeffect":["20.27"],"if":["20.29","30.3","32.7","32.8","32.9","32.12","32.15","33.9","34.1","37.5","37.6"],"reflect":["20.32"],"属性":["20.33"],"大家要区分一下":["20.33"],"model":["21.0"],"app":["21.2"],"传递给指令的值":["21.3"],"例如在":["21.3"],"my":["21.3"],"directive":["21.3"],"值是":["21.3"],"oldvalue":["21.3"],"之前的值":["21.3"],"仅在":["21.3"],"中可用":["21.3"],"无论值是否更改":["21.3"],"它都可用":["21.3"],"arg":["21.3"],"传递给指令的参数":["21.3"],"类似":["21.4"],"在vue3中如果组件有多个根结点":["21.4"],"style":["22.0","26.0"],"9999px":["22.0","26.0"],"add":["25.0","34.1","34.2"],"trigger":["25.0"],"john":["28.1","28.6"],"min":["29.2"],"挑一个比":["29.2"],"temp":["29.3"],"i":["29.4","30.2","34.1","34.2","37.4"],"left":["29.5","32.11","32.13","32.14","32.15"],"right":["29.5","32.13","32.14"],"tuple":["30.2","30.4"],"sqrt":["30.5"],"num":["30.6"],"while":["30.6","33.6"],"storage":["30.7"],"limit":["30.7"],"json":["31.0"],"stringify":["31.0"],"math":["31.1"],"可以为空":["32.1"],"如果不为空":["32.1"],"那么利用这个特点":["32.2"],"inordertraverse":["32.3"],"通过中序遍历方式遍历所有结点":["32.3"],"preordertraverse":["32.3"],"因为其他结点都可以通过根结点找到":["32.4"],"binaryserachtree":["32.4"],"递归方法实现插入":["32.5"],"处理经过的节点":["32.7"],"处理左子树中的节点":["32.9"],"else":["32.11","33.2","34.1","34.2"],"current":["32.13","33.3","33.7"],"root":["32.14"],"左为空":["32.16"],"最后一个节点":["33.2"],"head":["33.3","33.4"],"next指向原来的第一个":["33.4"],"next":["33.4","33.9"],"head指向新插入的":["33.4"],"index":["33.6","37.2"],"indexof":["33.11","33.12","38.3"],"update":["33.11","33.12"],"shift":["35.1","43.7"],"front":["35.1"],"result99":["36.4"],"arr":["36.4","36.5","36.7","36.9","36.13","36.14"],"result9":["36.5"],"result11":["36.6"],"result10":["36.8"],"result14":["36.9"],"arr7":["36.12"],"创建一个":["36.16"],"arr11":["36.20"],"d":["36.24"],"e":["36.24","43.9"],"arr12":["36.28"],"arr16":["36.31"],"parsefloat":["37.2"],"array":["37.5","37.6"],"isarray":["37.5","37.6"],"reduce":["37.7","38.4"],"cur":["38.1","38.2"],"result4":["38.4"],"pre":["38.4"],"btn":["39.2","39.3","40.2","41.0","42.2","42.3"],"禁用":["40.1"],"disabled":["40.1"],"你就可以看到按钮啦":["40.3"],"primary":["40.5","40.6","40.7"],"plain":["40.8"],"shuaxin":["40.8"],"bianji":["42.1"],"bangzhu":["42.1"],"bofangjilu":["42.1"],"dianhua":["42.1"],"dianzan":["42.1"],"在组件内挂载之后只需要引用下面这行代码":["42.3"],"licon":["42.4"],"apple":["42.5"],"fill":["42.7"],"line":["42.8","42.10","42.12","42.16"],"gengduo":["42.9"],"award":["42.10"],"shengyin":["42.11"],"up":["42.12"],"down":["42.12"],"fenxiang2":["42.13"],"shibai":["42.14"],"xiaoxi":["42.15"],"zhihui":["42.15"],"auction":["42.16"],"tr":["43.2"],"给tr设置高度只起到min":["43.2"],"默认会平分table的高度":["43.2"],"tr中的td默认高度会继承tr的高度":["43.2"],"若给任一td设置了高度":["43.2"],"其他td的高度也同样变高":["43.2"],"类型只有":["43.5"],"临时移动":["43.6"],"属性使用裁剪方式创建元素的可显示区域":["43.8"],"除了obeject之外的其他类型":["43.12"],"直接调用":["43.12"],"css":["43.14"],"用户键入内容改变时":["43.15"],"应该设置在父元素上":["43.18"],"封装好的组件库":["46.0"],"错题集":["46.0"]},{"0":["1.10","4.0","10.38","30.3","35.1","37.4","37.6"],"1":["1.19","3.8","9.1","9.5","10.54","12.1","17.1","17.19","20.3","29.1","29.2","30.2","30.4","32.1","36.13","38.3"],"2":["2.1","3.4","5.4","9.4","9.20","9.25","10.54","12.1","15.2","15.3","15.9","17.15","17.19","19.5","19.15","19.26","20.24","30.5","32.7","32.8","32.9","32.11","43.1"],"3":["3.3","3.9","5.3","6.15","9.10","9.26","10.14","10.21","10.27","10.36","10.39","12.3","12.5","17.19","17.22","19.6","19.7","19.15","19.27","20.5","20.16","20.18","20.25","20.26","32.2","36.20","36.28"],"4":["3.6","6.14","6.19","7.5","9.17","10.27","10.47","10.56","10.65","17.19","21.3","36.12","36.17","36.20","36.28","36.31","37.0","38.0","43.17"],"5":["36.11","36.12","36.17","36.20","36.27","36.28","36.31","37.0","38.0"],"6":["3.7","36.6","36.11","36.12","36.17","36.18","36.20","36.27","36.28","36.31"],"7":["11.26","30.4","36.10","36.11","36.12","36.17","36.18","36.19","36.20","36.21","36.27","36.28","36.30","36.31","36.32"],"8":["7.5","9.15","36.10","36.12","36.17","36.18","36.19","36.21","36.26","36.27","36.30","36.32"],"9":["9.15","36.1","36.2","36.3","36.10","36.12","36.21","36.26","36.29","36.30","36.32"],"10":["5.13","17.5","18.8","36.1","36.2","36.3","36.7","36.10","36.21","36.26","36.29","36.30"],"11":["18.8"],"20":["28.1"],"28":["28.6"],"42":["11.6"],"50":["1.22"],"100":["2.1","11.26"],"123":["19.37"],"200":["9.1"],"404":["9.15"],"405":["9.15"],"406":["9.15"],"407":["9.15"],"408":["9.15"],"409":["9.15"],"456":["43.11"],"1000":["43.1"],"3000":["12.3"],"left":["1.1","32.5","32.8","32.9","32.12"],"bottom":["1.1"],"right":["1.1","32.11","32.12"],"margin":["1.1","2.2"],"block":["1.2","2.2"],"table":["1.2"],"cell":["1.2","43.2"],"shrink":["1.4"],"可缩小":["1.5","1.7"],"basis为auto":["1.6"],"不可缩小":["1.8"],"可以正常触发事件":["1.10"],"因合成层触发gpu加速":["1.10"],"所以不发生回流和重绘":["1.10"],"circle":["1.12"],"0px":["1.12"],"利用裁剪创建元素的可显示区域":["1.12"],"它是一个绝对单位":["1.13"],"em是一个相对长度单位":["1.13"],"view":["1.14"],"width":["1.14"],"可视窗口宽度":["1.14"],"direction属性决定主轴的方向":["1.15"],"wrap属性定义":["1.15"],"一行或者一列":["1.16"],"布局是将容器划分成了":["1.16"],"overflow":["1.17"],"hidden":["1.17"],"text":["1.17","9.11"],"然后再作为纹理":["1.18"],"texture":["1.18"],"上传到":["1.18"],"gpu":["1.18"],"只要该层的内容不发生改变":["1.18","6.14"],"就没必要进行重绘":["1.18","6.14"],"根据设置的left":["1.19"],"top等属性成固定位置的效果":["1.19"],"属性值有以下几个特点":["1.19"],"其实就是一个边距的区别":["1.20"],"按水平布局来说":["1.20"],"动画指定需要多少秒或毫秒完成":["1.21"],"设置动画将如何完成一个周期":["1.21"],"以圆形的方式显示":["1.22"],"css":["1.22"],"利用盒模型的":["2.0"],"border":["2.0"],"份":["2.1"],"inline":["2.2"],"其":["2.2"],"ie盒模型中内容的宽或高将会包含内边距和边框":["2.3"],"hidden隐藏一个dom节点":["2.4"],"只触发重绘":["2.4"],"因为没有几何变化":["2.4"],"因为":["2.5"],"格式具有更好的图像数据压缩算法":["2.5"],"能带来更小的图片体积":["2.5"],"而且拥有肉眼识别无差异的图像质量":["2.5"],"颜色":["2.6"],"新增":["2.6"],"rgba":["2.6"],"hsla":["2.6"],"模式":["2.6"],"渐变":["2.6"],"inner":["2.7"],"浏览器端与服务器端通用的模块化开发规范":["3.1"],"导入其它模块成员使用":["3.2"],"import关键字":["3.2"],"否则会报错":["3.4"],"可以使用":["3.5"],"as":["3.5","17.13"],"绑定":["3.6"],"这个区域":["3.6"],"不再受外部作用域的影响":["3.6"],"ecmascript":["3.7"],"简称es6":["3.7"],"b":["3.8","10.52"],"箭头函数是在哪定义就指向谁":["3.9"],"普通函数可以当成构造函数":["3.9"],"class":["3.11","20.14"],"export":["3.12"],"可以导出多个属性或者方法":["3.12"],"需要用":["3.12"],"返回的数组元素不是字符串":["4.0"],"而是实际的symbol值":["4.0"],"因此可以通过它引用到对象的该属性":["4.0"],"es6新增的reflect":["4.0"],"ownkeys":["4.0"],"方法可以遍历出所有的常规键名和symbol键名":["4.0"],"reflect":["4.0"],"文档结构":["5.1"],"化的表述":["5.1"],"也是一样的":["5.2"],"需要通过分词器先将字节流转换为一个个":["5.2"],"分为":["5.2"],"tag":["5.2"],"和文本":["5.2"],"上述":["5.2"],"代码通过词法分析生成的":["5.2"],"如下所示":["5.2"],"维护了一个token":["5.2"],"会阻止dom树的解析":["5.3"],"chrome":["5.4"],"浏览器预解析操作":["5.4"],"当渲染引擎收到字节流之后":["5.4"],"或":["5.5"],"的生成":["5.6"],"碰到js前先生成cssom在执行js然后继续构建dom":["5.6"],"渲染":["5.6"],"当有外部css和js引入时":["5.6"],"在接收到":["5.6"],"html":["5.6","5.7","5.10"],"数据之后的预解析过程中":["5.6"],"文档中的图片资源":["5.7"],"dom树构建完成":["5.8","10.47"],"domcontentloaded":["5.8"],"回流":["5.9","6.9"],"重排":["5.9","6.9"],"计算元素位置":["5.9"],"它不必等到整个":["5.10"],"这三个过程在实际进行的时候并不是完全独立的":["5.11"],"而是会有交叉":["5.11"],"解析越慢":["5.12"],"个":["5.13"],"节点就要从头到尾执行10遍":["5.13"],"到":["5.14"],"树上":["5.14"],"再进行后续操作":["5.14"],"避免大量无谓的计算量":["5.14"],"所以":["5.14"],"用":["5.14","9.8"],"树的差异":["5.15"],"它定义在":["5.17"],"src":["5.17"],"不同的版本之间格式书写上略有差异":["6.1"],"如果没有事先告诉浏览器":["6.1"],"那么浏览器就不知道文档解析标准是什么":["6.1"],"是标明重点内容":["6.2"],"有语气加强的含义":["6.2"],"使用阅读设备阅读网络时":["6.2"],"strong会重读":["6.2"],"总是在新行上开始":["6.3"],"就是每个块级元素独占一行":["6.3"],"默认从上到下排列":["6.3"],"宽度缺少时是它的容器的100":["6.3"],"除非设置一个宽度":["6.3"],"高度":["6.3"],"行高以及外边距和内边距都是可以设置的":["6.3"],"块级元素可以容纳其它行级元素和块级元素":["6.3"],"type":["6.4","17.8","17.25","17.29"],"radio":["6.4"],"name":["6.4","28.2","42.3","42.4"],"sex":["6.4"],"id":["6.4"],"sms":["6.5"],"keywords这三个标签":["6.6"],"用javascript解决":["6.7"],"使用html5的shim框架":["6.7"],"在head标签中调用以下代码":["6.7"],"地理":["6.8"],"本地离线存储":["6.8"],"localstorage长期存储数据":["6.8"],"浏览器关闭后数据不丢失":["6.8"],"sessionstorage的数据在浏览器关闭后自动删除":["6.8"],"对渲染树进行reflow":["6.9"],"不占位置会忽略":["6.10"],"visiabllity":["6.10"],"当页面中的元素的大小或位置发生变化":["6.11"],"便会触发重排":["6.11"],"对于":["6.13"],"transform":["6.13"],"和":["6.13","6.18"],"opacity":["6.13"],"效果":["6.13"],"来计算":["6.14"],"will":["6.15"],"change":["6.15"],"该属性告诉浏览器该元素会有哪些变化":["6.15"],"layer":["6.16"],"squashing":["6.16"],"的处理":["6.16"],"解决层爆炸的问题":["6.17"],"最佳方案是打破":["6.17"],"overlap":["6.17"],"span":["6.18"],"无法提供关于其内容的信息":["6.18"],"以及label标签的灵活运用":["6.19"],"便于团队开发和维护":["6.19"],"seo是指为了从搜索引擎中获得更多的免费流量":["7.1"],"从网站结构":["7.1"],"提升页面关键词密度":["7.2"],"keywords里面把每个关键词用英文逗号隔开":["7.3"],"三到五个最佳":["7.3"],"通过站内的关键词链接指向网站内部的链接":["7.4"],"关键词占整篇文章的比重":["7.5"],"话术设置":["7.5"],"表现":["8.1"],"即指css样式表":["8.1"],"特殊符号用编码表示":["8.2"],"任何小于号":["8.2"],"不是标签的一部分":["8.2"],"都必须被编码为":["8.2"],"lt":["8.2"],"任何大于号":["8.2"],"提高用户的体验":["8.3"],"样式尽量少用行间样式表":["8.3"],"ok":["9.1","17.5","17.15"],"以及返回的内容":["9.1"],"收到用户的应答后":["9.2"],"便断开连接":["9.2"],"这种方式可以节省传输时间":["9.2"],"无状态":["9.2"],"ip协议不仅仅指的是tcp":["9.3"],"和ip两个协议":["9.3"],"而是指一个由ftp":["9.3"],"起始且默认使用端口80":["9.4"],"而https的url由":["9.4"],"https":["9.4","9.18"],"起始且默认使用端口443":["9.4"],"http是超文本传输协议":["9.4"],"来代替资源名称":["9.8"],"向":["9.8"],"web":["9.8"],"服务器发送":["9.8"],"可以测试服务器功能是否正常运作":["9.8"],"head":["9.8","33.5","33.7"],"所以没啥安全性可言":["9.9"],"get和post有一个重大区别":["9.9"],"简单的说":["9.9"],"get产生一个tcp数据包":["9.9"],"post产生两个tcp数据包":["9.9"],"没有数据量限制":["9.10"],"请求体":["9.11"],"响应体的类型":["9.11"],"plain":["9.11"],"application":["9.11"],"json":["9.11"],"x":["9.11","17.14"],"www":["9.11"],"form":["9.11"],"urlencoded":["9.11"],"accept":["9.11"],"说明接收的类型":["9.11"],"可以多个值":["9.11"],"形式进行存储":["9.12"],"多个请求参数之间用":["9.12"],"连接":["9.12","9.17"],"用于表示资源":["9.14"],"网页等":["9.14"],"被永久转移到其它":["9.14"],"未找到":["9.15"],"服务器找不到请求的网页":["9.15"],"方法禁用":["9.15"],"禁用请求中指定的方法":["9.15"],"不接受":["9.15"],"无法使用请求的内容特性响应请求的网页":["9.15"],"需要代理授权":["9.15"],"此状态代码与":["9.15"],"类似":["9.15"],"但指定请求者应当授权使用代理":["9.15"],"请求超时":["9.15"],"服务器等候请求时发生超时":["9.15"],"冲突":["9.15"],"服务器在完成请求时发生冲突":["9.15"],"tcp":["9.17"],"hsts":["9.18"],"强制客户端使用":["9.18"],"hosts":["9.19"],"文件里":["9.19"],"没有则向":["9.19"],"传输层":["9.20"],"第一次握手就是客户端给服务器端发送一个报文":["9.25"],"客户端的发送能力":["9.25"],"服务端的接收能力是正常的":["9.25"],"第二次就是服务器收到报文之后":["9.25"],"wait状态":["9.26"],"如果服务端也想断开连接了":["9.26"],"和客户端的第一次挥手一样":["9.26"],"发给":["9.26"],"symbol":["10.1"],"null":["10.1","20.4","32.4","33.1","33.8"],"能区分是否是引用类型":["10.2"],"instanceof用于检测构造函数的":["10.2"],"funcntion":["10.3"],"new":["10.3","10.51","11.15","12.2","31.0"],"map":["10.3"],"weakset":["10.3"],"指的是在渲染该":["10.4"],"script":["10.4"],"的加载与执行并行进行":["10.5"],"异步":["10.5"],"下载时":["10.6"],"async是下载完后立即执行":["10.7"],"defer是在html解析完后再执行":["10.7"],"var声明变量时在闭包里不会提升":["10.8"],"以箭头函数调用时this指向当前实例":["10.9"],"执行第一个宏任务":["10.11"],"全局script脚本":["10.11"],"产生的的宏任务和微任务进入各自的队列中":["10.11"],"执行完script后":["10.11"],"setinterval":["10.12"],"node中的setimmediate":["10.12"],"等":["10.12","10.23"],"微任务比宏任务有更高优先级":["10.13"],"否则新入队的任务永远被放在队尾":["10.13"],"另外":["10.14"],"settimeout":["10.14","12.2"],"深拷贝采用了在堆内存中申请新的空间来存储数据":["10.17"],"只是拷贝了指针":["10.18"],"使得两个指针指向同一个地址":["10.18"],"浅拷贝":["10.19"],"不会影响":["10.19"],"回收那些不再使用的内存":["10.22"],"本质上是找到内存中可以释放的变量":["10.22"],"然后再进行释放回收内存":["10.22"],"参数":["10.23"],"其余情况都为false":["10.24"],"js":["10.24","18.7","20.14","20.20","42.7"],"console":["10.24","10.25","10.53","10.55","10.56","11.3","11.16","11.18","11.25","12.7","17.6","18.5","20.7","36.7","36.15","37.1","37.2","43.4"],"log":["10.24","10.25","10.55","10.56","11.3","11.12","11.16","11.25","12.7","17.6","18.5","20.7","36.15","37.2","43.4"],"in":["10.25"],"强转字符串优先调用tostring":["10.27"],"强转数字优先调用valueof":["10.27"],"引用数据类型":["10.28"],"指针存栈内存":["10.28"],"valueof":["10.31"],"null转数字为0":["10.32"],"undefined转数字为nan":["10.32"],"null是一个对象未初始化":["10.32"],"而null底层的二进制全都是0":["10.33"],"才能为true":["10.34"],"算术运算符":["10.35"],"关系运算符":["10.35"],"如果一个操作数是字符串":["10.36"],"另一个操作数是数值":["10.36"],"不等于":["10.37"],"左边为对象":["10.39"],"调用tostring转为":["10.39"],"需转二进制进行运算":["10.40"],"有些小数无法用二进制表示":["10.40"],"所以只能取近似值":["10.40"],"决定事件是在捕获或冒泡阶段执行":["10.43"],"var":["10.44","11.22"],"function":["10.44","17.15","20.27"],"并往下传播":["10.45"],"dom事件流":["10.45"],"是基于promise对xhr对象的封装":["10.46"],"fetch":["10.46"],"domcontentloaded触发":["10.47"],"节省性能":["10.50"],"子元素不需要每个都去绑定同一事件":["10.50"],"push":["10.51","17.3","38.3"],"return":["10.51","10.64","11.30","11.31","19.21","20.7","20.8","20.15","28.4","30.2","32.12","32.15","36.4","36.5","36.9","36.14"],"add":["10.52","10.54"],"o":["10.58"],"p":["10.58","17.23"],"haha":["10.58"],"set":["10.58","11.4","20.8","20.15","20.28"],"通过键":["10.59"],"从字典中移除对应的数据":["10.59"],"for":["10.60","30.3","31.0","36.22","36.23"],"key":["10.60","10.61","11.8","32.7","43.10"],"of":["10.61","11.8","11.13","17.32"],"keys":["10.61"],"nan为假值":["10.62"],"转布尔值为false":["10.62"],"call":["10.65","20.4"],"apply":["10.65"],"bind改变this":["10.65"],"obj1":["10.65"],"林三心":["10.65"],"arr2":["10.66"],"arr3":["10.66","37.2"],"连接数组":["10.66"],"arr":["10.66","36.6","36.8"],"round":["10.67"],"小数四舍五入":["10.67"],"prompt":["10.70"],"n":["10.71"],"decodeuri":["10.72"],"函数用于解码js中的url":["10.72"],"它将编码的url字符串作为参数并返回已解码的字符串":["10.72"],"获取域名和端口":["10.73"],"hostname":["10.73"],"获取主机名":["10.73"],"port":["10.73"],"获取端口号":["10.73"],"js是通过访问bom":["10.74"],"browser":["10.74"],"对象来访问":["10.74"],"控制":["10.74"],"s":["10.76","10.77","31.0"],"hello":["10.76","10.77","17.5","17.10"],"指令的目的是强制执行严格模式下的代码":["10.78"],"用来声明允许用户输入数据的":["10.79"],"类型的实例":["11.1"],"它们都会从":["11.1"],"wrapper":["11.2"],"expected":["11.3","11.19"],"output":["11.3","11.19"],"matthew":["11.4"],"a":["11.4","11.22"],"property":["11.4","20.7"],"on":["11.4"],"或者修改一个对象的现有属性":["11.5"],"writable":["11.6","11.7"],"false":["11.6","11.21","11.25","32.12"],"不可写":["11.6"],"true":["11.7","11.14","11.21","21.3","34.1","34.2"],"value":["11.8","12.8","20.13","20.32","20.33"],"可配置性":["11.9"],"可写性":["11.9"],"obj":["11.10"],"指定对象的原型":["11.11"],"内部":["11.11"],"the":["11.13"],"to":["11.13","17.32","19.29"],"prototypal":["11.13"],"const":["11.15","18.11","20.13","25.0","31.0","36.22","36.23"],"auto":["11.15"],"值作为名称的属性":["11.17"],"组成的数组":["11.17"],"objectsymbols":["11.18"],"或都是":["11.21"],"都是相同长度":["11.21"],"相同字符":["11.21"],"undefined":["11.22","36.16"],"window":["11.22"],"是否可以在它上面添加新的属性":["11.23"],"方法判断一个对象是否被冻结":["11.24"],"an":["11.26"],"也就是永远不能再添加新的属性":["11.27"],"表示指定的属性是否可枚举":["11.28"],"阻止添加新属性并将所有现有属性标记为不可配置":["11.29"],"gabby":["11.30"],"dogtostring":["11.30"],"成功回调":["12.0"],"reject":["12.0","12.2"],"失败回调":["12.0"],"方法返回的是":["12.1"],"对象":["12.1"],"使用catch":["12.1"],"相当于给前面一个then方法返回的promise":["12.1"],"注册回调":["12.1"],"可以捕获到前面then没有被处理的异常":["12.1"],"如果是promise内部报错":["12.1"],"reject抛出错误后":["12.1"],"then的第二个参数就能捕获得到":["12.1"],"resolve":["12.2"],"失败":["12.2"],"3s后":["12.3"],"对象原型":["12.4"],"proto":["12.4"],"then的多次调用":["12.5"],"then":["12.7"],"res":["12.7"],"status":["12.8"],"rejected":["12.8"],"reason":["12.8"],"fulfilled":["12.8"],"该方法会在":["12.8"],"所有的promise都有结果":["12.8"],"无论是fulfilled":["12.8"],"还是rejected":["12.8"],"才会有最终的结果":["12.8"],"如果其中一个promise没有结果":["12.8"],"不同":["13.1"],"简称":["14.1"],"esm":["14.1"],"另一种是":["14.1"],"是同步加载":["14.2"],"后面的代码必须等待这个命令执行完":["14.2"],"才会执行":["14.2"],"就认为它是":["14.3"],"模块":["14.3"],"默认启用严格模式":["14.3"],"模块的输出接口是module":["14.4"],"exports":["14.4"],"是一个对象":["14.4"],"无法被静态分析":["14.4"],"所以只能整体加载":["14.4"],"上面代码指定require":["14.5"],"和import":["14.5"],"加载该模块会自动切换到不一样的入口文件":["14.5"],"总结为一句话":["14.5"],"sessionstorage的有效期是仅保持在当前页面":["15.1"],"关闭当前会话页或者浏览器后就会失效":["15.1"],"localstorage和sessionstorage的存储容量是5mb":["15.2"],"读取":["15.4"],"let":["15.4","17.23","20.20","28.5","28.6","31.1","33.4"],"data":["15.4"],"getitem":["15.4"],"清除":["15.4"],"removeitem":["15.4"],"localstorage和sessionstorage出现的时间较晚":["15.5"],"当第一次登录后":["15.7"],"客户端收到token后把它存储起来":["15.8"],"可以放在cookie或者local":["15.8"],"storage":["15.8"],"本地存储":["15.8"],"里":["15.8"],"存cookie里":["15.9"],"http":["16.0"],"vuerouter的懒加载":["16.0"],"扩展运算符":["16.0"],"nexttick":["16.0"],"也可以存储字符串类型的数据":["17.1"],"定义指定对象成员的数组":["17.1"],"剩余参数":["17.3"],"array":["17.3","37.7"],"值得注意的是":["17.7"],"方法没有返回值将得到undefined":["17.7"],"但是我们需要定义成void类型":["17.7"],"而不是undefined类型":["17.7"],"否则将报错":["17.7"],"类型的特性来实现全面性检查":["17.8"],"具体示例如下":["17.8"],"foo":["17.8","21.3"],"number":["17.8"],"controlflowanalysiswithnever":["17.8"],"类型":["17.9","17.17"],"这种机制起到了很强的预防性":["17.10"],"更安全":["17.10"],"这就要求我们必须缩小类型":["17.10"],"我们可以使用typeof":["17.10"],"类型断言等方式来缩小未知范围":["17.10"],"空对象类型和大":["17.11"],"一样":["17.11"],"也是表示原始类型和非原始类型的集合":["17.11"],"并且在严格模式下":["17.11"],"具有初始化值的变量":["17.12"],"有默认值的函数参数":["17.12"],"将从":["17.14"],"is":["17.16","17.32"],"string":["17.16"],"这里表示一个字符串字面量类型":["17.17"],"的父类型":["17.17"],"implement":["17.18"],"typescript":["17.18"],"中的接口是一个非常灵活的概念":["17.18"],"ro":["17.19"],"确定属性和可选属性的类型都必须是它的类型的子集":["17.20"],"有时和":["17.24"],"很像":["17.24"],"void":["17.25"],"union联合":["17.26"],"partialpoint":["17.26"],"y":["17.27"],"接口扩展类别名":["17.28"],"在定义泛型时通常用作第一个类型变量名称":["17.29"],"但实际上":["17.29"],"可以用任何有效名称代替":["17.29"],"trace":["17.30"],"gender":["17.32"],"报错":["17.32"],"argument":["17.32"],"not":["17.32"],"assignable":["17.32"],"parameter":["17.32"],"首先看泛型":["17.32"],"这里有t和k两种类型":["17.32"],"根据类型推断":["17.32"],"第一个参数person就是person":["17.32"],"类型会被推断为person":["17.32"],"而第二个数组参数的类型推断":["17.32"],"keyof关键字可以获取t":["17.32"],"也就是person的所有属性名":["17.32"],"即":["17.32"],"而extends关键字让泛型k继承了person的所有属性名":["17.32"],"所以当用户刷新页面时会向服务器发请求导致请求资源为404":["18.2"],"因此需要对nginx进行一个配置":["18.2"],"需要把所有路由都重定向到根页面":["18.2"],"router就会依据路由表当中声明了的路由对应匹配的组件":["18.3"],"值变化不会导致浏览器向服务器发出请求":["18.4"],"hash":["18.4"],"模式是用":["18.4"],"popstate":["18.5"],"home":["18.6"],"next":["18.7","33.1","33.8"],"函数也不会改变导航本身":["18.7"],"beforeenter":["18.7"],"一般配置在路由配置文件中":["18.7"],"router":["18.7"],"index":["18.7","33.4","33.7","33.8","36.4","36.5","36.9","36.14"],"对进入某个路由之前进行相关操作":["18.7"],"导航被确认":["18.8"],"aftereach":["18.8"],"钩子":["18.8"],"触发":["18.8"],"dom":["18.8"],"即在需要的时候的时候进行加载":["18.9"],"也就是":["18.9"],"被作为分离的模块起点":["18.10"],"意思是":["18.10"],"views":["18.11"],"替换成":["18.11"],"并且它可以在路由地址和导航守卫上都被访问到":["18.12"],"然后在接下来的":["18.13"],"组件生命周期钩子中获取数据":["18.13"],"在数据获取期间显示":["18.13"],"只在第一次加载页面时":["19.1"],"onmounted":["19.2"],"dom挂载完成调用":["19.2"],"beforeupdate":["19.2"],"onbeforeupdate":["19.2"],"父beforeupdate":["19.3"],"子beforeupdate":["19.3"],"子updated":["19.3"],"一般在频繁切换状态的地方使用v":["19.5"],"所以这样就会导致无论需不需展示这个元素":["19.6"],"都会先遍历整个列表":["19.6"],"页面多次使用addsum":["19.7"],"但是只会打印一次":["19.7"],"内部逻辑执行":["19.7"],"的依赖追踪机制为基础":["19.9"],"当某个依赖数据发生变化时":["19.9"],"所有依赖这个数据的相关数据或函数都会自动发生变化或调用":["19.9"],"被观察者":["19.10"],"其内部监听的对象必须是已经定义响应式的属性":["19.11"],"比如":["19.11"],"会循环所有计算属性":["19.12"],"每一个计算属性会创建一个":["19.12"],"watcher":["19.12"],"并且在通过":["19.12"],"defineproperty":["19.12"],"vue2":["19.12"],"watch":["19.13"],"而":["19.13","20.26"],"当回调函数里面的响应数据发生变化":["19.14"],"回调函数就会立即执行":["19.14"],"watcheffect只能看到新值看不到旧值":["19.14"],"vue2将响应式数据放到data函数中":["19.15"],"而vue3则是使用ref和reactive将数据声明为响应式":["19.15"],"响应式实现方式":["19.15"],"或者app":["19.16"],"具名插槽内容":["19.17"],"在slot标签绑定属性从而传递给父组件中的插槽内容":["19.17"],"首先来看下默认插槽的传值方式":["19.17"],"inject":["19.18"],"子组件访问父组件":["19.18"],"parent":["19.18","32.14"],"vuex除了上面三个概念还有getters":["19.19"],"moudles":["19.19"],"getters就像vue中的计算属性computed一样用来描述依赖响应式状态state中的复杂逻辑":["19.19"],"moudles则是可以将store分割成模块":["19.19"],"module":["19.19"],"getters":["19.20"],"changenames":["19.20"],"states":["19.21"],"孙悟空":["19.21"],"usercomputed":["19.21"],"this":["19.21","30.6","32.4","32.13","32.15"],"它接收组件的名字数组":["19.23"],"字符串或者正则":["19.23"],"当我们使用动态组件component或者路由router":["19.23"],"view的时候可以使用":["19.23"],"beforemount":["19.24"],"和destroyed":["19.25"],"组件销毁":["19.25"],"哪个组件需要用到时":["19.26"],"直接将提取的这部分混入到组件内部即可":["19.26"],"mixin的生命周期会在父组件生命周期之前执行":["19.26"],"的代理行为是在破坏原对象的基础上实现的":["19.27"],"popup":["19.29"],"fallback":["19.30"],"在初始渲染时":["19.30"],"而是把需要更新的watcher加入到queuewatcher队列中":["19.32"],"然后在合适的时机在nexttick中调用这些watcher的更新函数进行dom更新":["19.32"],"然后使用虚拟节点树进行渲染":["19.34"],"当某些状态发生变更时会生成新的虚拟dom节点树":["19.34"],"时间复杂度太高":["19.35"],"因此前端框架规定了只做同层":["19.35"],"还有":["19.35"],"store":["19.36"],"meals":["19.36"],"children":["19.36"],"meal":["19.36"],"self":["19.37"],"观察者":["20.2"],"observer":["20.2"],"channel":["20.3"],"订阅者":["20.3","20.5"],"发布订阅模式":["20.3","20.24"],"将依赖收集的目标对象设置成自身":["20.4"],"绑定当前":["20.4"],"vue":["20.4","20.16"],"实例进行一次函数执行":["20.4"],"在运行过程中收集函数中用到的数据":["20.4"],"此时会在所有用到数据的":["20.4"],"依赖管理中插入该观察者实例":["20.4"],"函数执行完毕后将依赖收集目标清空":["20.4"],"避免重复收集":["20.4"],"依赖收集器":["20.5"],"depend":["20.8","20.15"],"如果value是对象":["20.9"],"递归调用observe来监测该对象":["20.9"],"如果value不是对象":["20.9"],"observe函数会直接返回":["20.9"],"创建了arraymothods的对象以object":["20.10"],"巧妙之处":["20.11"],"watcher设置在全局中读取数据":["20.11"],"因为读取了数据":["20.11"],"所以触发getter方法":["20.11"],"通知组件":["20.12"],"通过虚拟dom和diff算法进行页面更新":["20.12"],"初始化watcher实例时订阅数据":["20.13"],"get":["20.13","20.22","20.34"],"一个属性可能有多个依赖":["20.14"],"每个响应式数据都有一个dep来管理它的依赖":["20.14"],"要通知到的地方":["20.14"],"依赖":["20.14"],"constructor":["20.14"],"本次新增":["20.15"],"newval":["20.15"],"if":["20.15","20.19","20.22","21.0","29.1","29.5","33.6","38.4"],"的局限性":["20.16"],"采用了全新的":["20.16"],"deleteproperty":["20.17"],"方法会调用":["20.18"],"track":["20.18"],"进行依赖收集":["20.18"],"isobject":["20.19"],"如果当前获取的属性值是一个对象":["20.19"],"则继续将为此对象创建":["20.19"],"代理":["20.19"],"方法":["20.20"],"has":["20.21"],"副作用是一个函数包裹器":["20.23"],"在函数被调用前就启动跟踪":["20.23"],"只能针对对象的已知属性进行读取和更新的操作拦截":["20.24"],"都是通过":["20.24"],"unwrapref":["20.25"],"interface":["20.25"],"其实也会通过":["20.26"],"reactive":["20.26","25.0"],"方法进行深层数据处理":["20.26"],"与":["20.26"],"readonly":["20.26"],"则比较相似":["20.26"],"effect":["20.27"],"fn":["20.27"],"dep":["20.29"],"proxy的get对应reflect":["20.34"],"自动聚焦的指令":["21.2"],"directive":["21.2"],"如果有的话":["21.3"],"参数是":["21.3"],"modifiers":["21.3"],"一个包含修饰符的对象":["21.3"],"bar":["21.3"],"修饰符对象是":["21.3"],"则指令将会被忽略且抛出一个警告":["21.4"],"组件的一个根结点就是在一个":["21.4"],"vdebounce":["21.6"],"指令地址":["21.6"],"body":["22.0","26.0"],"appendchild":["22.0","26.0"],"foreach":["25.0"],"handler":["25.0"],"receiver":["25.0"],"age":["28.1","28.6"],"john":["28.2"],"john3":["28.5"],"j":["29.2","29.3","29.4"],"开始依次与之前的元素比较":["29.3"],"while":["29.3","33.3"],"temp":["29.4"],"i":["29.5","30.3","30.5","30.7","31.0"],"length":["30.1","30.7","33.6","37.4"],"不修改则插入":["30.2"],"splice":["30.4","34.1","34.2"],"isprime":["30.6"],"bucket":["30.7"],"floor":["31.1"],"bin":["31.1"],"满足以下性质":["32.1"],"非空左子树的所有键值小于其根结点的键值":["32.1"],"我们可以做什么事情呢":["32.2"],"通过先序遍历方式遍历所有结点":["32.3"],"postordertraverse":["32.3"],"通过后序遍历方式遍历所有结点":["32.3"],"root":["32.4","32.13"],"node":["32.4"],"向左查找":["32.5"],"处理经过节点的左子节点":["32.7"],"处理左子树中的节点":["32.8"],"处理右子树中的节点":["32.9"],"max":["32.10","38.2"],"while循环":["32.11"],"else":["32.12","32.15","33.4","33.8","37.6"],"isleftchild":["32.14"],"情况3":["32.15","32.16"],"非叶子结点":["32.15"],"有两个节点":["32.15"],"递归删除函数":["32.15"],"current":["33.2","33.4","33.5"],"当current":["33.2"],"next不为空时":["33.2"],"情况二":["33.4"],"previous":["33.8"],"remove":["33.11","33.12"],"break":["34.1","34.2"],"isempty":["35.1"],"dequeue":["35.2"],"result6":["36.1"],"result7":["36.2"],"result8":["36.3"],"item":["36.4","36.5","36.9","36.14"],"填充一个数组到最后":["36.13"],"然后展平":["36.13"],"的空数组":["36.16"],"这意味着一个由":["36.16"],"个空槽组成的数组":["36.16"],"而不是具有实际":["36.16"],"result20":["36.19"],"result22":["36.22"],"result24":["36.23"],"f":["36.24"],"result25":["36.24"],"result28":["36.26"],"result32":["36.29"],"infinity":["37.1"],"concat":["37.5","37.7"],"isarray":["37.7"],"math":["38.2"],"cur":["38.4","38.5"],"reduce":["38.5"],"pre":["38.5"],"use":["39.2","40.2","42.2"],"在组件内挂载之后只需要引用下面这行代码":["39.3"],"你就可以看到流光按钮啦":["39.3"],"选择大小":["40.1"],"size":["40.1"],"mount":["40.2"],"l":["40.3"],"button":["40.3"],"刷新":["40.8"],"success":["40.8"],"saoyisao":["42.1"],"shibai":["42.1"],"shengyinguanbi":["42.1"],"shangchuan":["42.1"],"shezhi":["42.1"],"选择你想要的图标":["42.3"],"apple":["42.4"],"line":["42.5"],"color":["42.5"],"适合多列等高布局":["43.2"],"设置宽度":["43.2"],"都不起作用":["43.2"],"td标签":["43.2"],"td":["43.2"],"tel":["43.5"],"服务器目前从不同位置的网页响应请求":["43.6"],"unshift":["43.7"],"reverse":["43.7"],"区域内的部分显示":["43.8"],"可以转换为字符串类型":["43.12"],"var没有":["43.13"],"块级作用域输出3":["43.13"],"box":["43.14"],"transition":["43.14"],"触发inpute事件":["43.15"],"使用浮动时先写left再写right再写中间的":["43.18"],"待更新":["46.0"],"鹏之徙于南冥也":["46.0"],"组件库":["47.0"]},{"0":["17.19","29.3","29.4","38.1"],"1":["10.76","10.77","20.2","20.21"],"2":["1.5","1.6","1.7","1.8","1.18","1.19","3.8","5.2","6.16","6.18","10.51","11.18","11.22","18.13","19.14","20.17","21.2","31.0","32.1","36.9"],"3":["3.2","5.15","6.11","7.2","8.1","9.4","9.18","9.19","9.20","10.11","10.13","10.35","12.1","15.1","19.23","19.26","20.34","31.0","32.7","32.8","32.9"],"4":["2.5","3.5","3.9","6.13","9.26","10.36","10.39","10.64","15.4","19.9","19.15","19.20","19.23","19.27","20.18"],"5":["2.7","5.8","5.9","6.9","6.14","6.19","7.5","9.17","10.27","10.47","12.8","15.8","20.11","21.3","36.4","36.5","36.14"],"6":["4.0","10.56","21.3","37.0","38.0"],"7":["17.32","37.0","38.0"],"8":["36.11","36.20","36.28","36.31"],"9":["36.11","36.17","36.19","36.20","36.27","36.28","36.31"],"10":["9.15","17.15","36.8","36.11","36.12","36.20","36.27","36.28","36.31","36.32"],"11":["9.15"],"12":["9.15","17.19","18.8"],"13":["9.15"],"14":["9.15"],"18":["19.17"],"20":["28.2"],"25":["17.23","30.4"],"37":["30.1"],"77":["11.6"],"410":["9.15"],"411":["9.15"],"412":["9.15"],"413":["9.15"],"414":["9.15"],"456":["43.10"],"1998":["11.15"],"3000":["12.2"],"绝对定位配合transform实现":["1.1"],"推荐":["1.1"],"触发合成层优化性能":["1.1"],"caption":["1.2"],"flex":["1.2"],"inline":["1.2"],"指定了对应元素的收缩规则":["1.4"],"只有在所有元素的默认宽度之和大于容器宽度时才会触发":["1.4"],"basis为0":["1.5","1.7"],"auto是根据内容的大小来分":["1.6"],"basis为auto":["1.8"],"content":["1.10","10.58"],"9999px":["1.11"],"超大负边距会将元素抛出视图":["1.11"],"因为定位本身脱离了文档流所以不占据空间":["1.11"],"translate":["1.11"],"区域外会隐藏":["1.12"],"具体的大小需要相对于父元素计算":["1.13"],"比如父元素的字体大小为80px":["1.13"],"height":["1.14"],"如果一条轴线排不下":["1.15"],"如何换行":["1.15"],"flow属性是flex":["1.15"],"direction属性和flex":["1.15"],"wrap属性的简写形式":["1.15"],"行":["1.16"],"和":["1.16","19.20"],"ellipsis":["1.17"],"repaint":["1.18","6.14"],"left属于布局属性":["1.18"],"该属性的变化会导致重排":["1.18"],"该元素并不脱离文档流":["1.19"],"仍然保留元素原本在文档流中的位置":["1.19"],"当元素在容器中被滚动超过指定的偏移值时":["1.19"],"元素在容器内固定在指定位置":["1.19"],"between是两端对齐":["1.20"],"在左右两侧没有边距":["1.20"],"而space":["1.20"],"设置动画在启动前的延迟间隔":["1.21"],"iteration":["1.21"],"count":["1.21","30.2","30.4"],"定义动画的播放次数":["1.21"],"img":["1.22"],"属性上下左右边框交界处会呈现出平滑的斜线这个特点":["2.0"],"margin":["2.1"],"或者":["2.1"],"auto":["2.2"],"居中方式失效":["2.2"],"给父级添加":["2.2"],"而w3c盒模型并不会":["2.3"],"移动或者给页面中的dom节点添加动画":["2.4"],"添加一个样式表":["2.4"],"调整样式属性":["2.4"],"缺点就是兼容性并不好":["2.5"],"小图使用":["2.5"],"png":["2.5"],"线性渐变":["2.6"],"径向渐变":["2.6"],"字体":["2.6"],"font":["2.6","6.8"],"face":["2.6"],"2d":["2.6"],"定位position":["2.7"],"利用绝对定位的方式":["2.7"],"好处":["2.7"],"这种实现方式的三栏html结构可以任意摆放":["2.7"],"不用考虑先后次序":["2.7"],"absolute":["2.7"],"直接导入并执行模块中的代码":["3.3"],"默认导入时的接收名称可以任意名称":["3.4"],"关键字进行重命名":["3.5"],"全局作用域中":["3.6"],"var声明的变量":["3.6"],"通过function声明的函数":["3.6"],"中新增了块级作用域":["3.7"],"使用let声明的变量只能在块级作用域里访问":["3.7"],"有":["3.7"],"暂时性死区":["3.7"],"的特性":["3.7"],"而箭头函数是不可以的":["3.9"],"类名":["3.11"],"构造函数和方法":["3.11"],"括起来":["3.12"],"在用import接受的时候也得用":["3.12"],"接受":["3.12"],"for":["4.0"],"keyfor":["4.0"],"这里的symbol":["4.0"],"创建的都是symbol":["4.0"],"类型":["4.0","17.8","43.5"],"但是他们的创建机制有所不同":["4.0"],"的创建方式会在":["4.0"],"创建之前在全局中寻找":["4.0"],"有没有用symbol":["4.0"],"的方式":["4.0"],"并且key是":["4.0"],"dom树":["5.1"],"栈结构":["5.2"],"该":["5.2"],"栈主要用来计算节点之间的父子关系":["5.2"],"在第一个阶段中生成的":["5.2"],"会被按照顺序压到这个栈中":["5.2"],"通过分词器产生的新":["5.2"],"就这样不停地压栈和出栈":["5.2"],"整个解析过程就这样一直持续下去":["5.2"],"直到分词器将所有字节流分词完成":["5.2"],"解析为":["5.2"],"最终css":["5.3"],"cssom":["5.3"],"会开启一个预解析线程":["5.4"],"用来分析":["5.4"],"html":["5.4"],"defer":["5.5"],"预解析器识别出来了有":["5.6"],"文件和":["5.6"],"文件需要下载":["5.6"],"然后就同时发起这两个文件的下载请求":["5.6"],"需要注意的是":["5.6"],"这两个文件的下载过程是重叠的":["5.6"],"所以下载时间按照最久的那个文件来算":["5.6"],"后面的流水线就和前面是一样的了":["5.6"],"代码中有异步加载的":["5.7"],"css":["5.7"],"加载图片等外部文件":["5.8"],"绘制网页repaint":["5.9","6.9"],"文档解析完成之后才开始构建":["5.10"],"会一边加载":["5.11"],"计算":["5.13"],"节点坐标值等都是白白浪费的性能":["5.13"],"对象模拟":["5.14"],"节点的好处是":["5.14"],"页面的更新可以先全部反映在":["5.14"],"对象":["5.14","19.20"],"将两个虚拟":["5.15"],"core":["5.17"],"vdom":["5.17"],"此时":["6.1"],"大部分浏览器将开启最大兼容模式来解析网页":["6.1"],"而b是展示强调内容":["6.2"],"是italic":["6.2"],"斜体":["6.2"],"的简写":["6.2"],"行内元素":["6.3"],"和其它元素都会在一行显示":["6.3"],"高":["6.3"],"行高以及外边距和内边距可以设置":["6.3"],"宽度就是文字或者图片的宽度":["6.3"],"不能改变":["6.3"],"行级元素只能容纳文本或者其它行内元素":["6.3"],"female":["6.4"],"女":["6.4"],"还有邮件等等":["6.5"],"当然":["6.5"],"title表示标题标签":["6.6"],"description是描述标签":["6.6"],"js":["6.7","36.16"],"if":["6.7","17.4","17.8","20.7","20.8","29.2","30.5","30.7"],"拖拽释放":["6.8"],"移除的元素":["6.8"],"纯表现的元素":["6.8"],"basefont":["6.8"],"s":["6.8"],"计算元素位置":["6.9"],"hidden":["6.10"],"position":["6.10"],"定位":["6.10"],"每次修改样式都会触发重排":["6.11"],"不会触发":["6.13"],"layout":["6.13"],"paint":["6.13"],"提升合成层的最好":["6.13"],"元素提升为合成层后":["6.14"],"transform":["6.14"],"video":["6.15","19.29"],"canvas":["6.15"],"iframe":["6.15"],"浏览器的自动层压缩并不是万能的":["6.16"],"有很多特定情况下":["6.16"],"的条件":["6.17"],"也就是说让其他元素不要和合成层元素重叠":["6.17"],"语义元素":["6.18"],"form":["6.18"],"语义化使得代码更具有可读性":["6.19"],"让其他开发人员更加理解你的html结构":["6.19"],"减少差异化":["6.19"],"内容建设方案":["7.1"],"用户互动传播":["7.1"],"描述":["7.2"],"尽量覆盖每个关键词":["7.3"],"通过这样的方式":["7.4"],"域名选择":["7.5"],"后缀选择":["7.5"],"一般选择":["7.5"],"com":["7.5"],"行为":["8.1"],"gt":["8.2"],"任何与号":["8.2"],"不是实体的一部分的":["8.2"],"amp":["8.2"],"使结构与表现分离":["8.3"],"标签的id和class等属性命名要做到见文知义":["8.3"],"标签越少":["8.3"],"如请求的文件":["9.1"],"错误消息":["9.1"],"或者其它信息":["9.1"],"客户端":["9.1"],"服务器":["9.1"],"无状态是指协议对于事物处理没有记忆能力":["9.2"],"不对请求和响应之间的通信状态进行保存":["9.2"],"缺少状态意味着如果后续处理需要前面的信息":["9.2"],"则它必须重传":["9.2"],"smtp":["9.3"],"udp":["9.3"],"信息是明文传输":["9.4"],"https则是具有安全性的":["9.4"],"加密传输协议":["9.4"],"http的连接很简单":["9.4"],"x":["9.5","10.66","17.10"],"大幅度的提升了":["9.5"],"与":["9.8"],"方法一样":["9.8"],"都是向服务器发出指定资源的请求":["9.8"],"只不过服务器将不传回资源的本文部分":["9.8"],"它的好处在于":["9.8"],"使用这个方法可以在不必传输全部内容的情况下":["9.8"],"就可以获取其中关于该资源的信息":["9.8"],"原因是":["9.9"],"对于get方式的请求":["9.9"],"浏览器会把http":["9.9"],"header和data一并发送出去":["9.9"],"服务器响应200":["9.9"],"发送包含未知字符的用户输入时":["9.10"],"用":["9.11"],"英文逗号":["9.11"],"分开":["9.11"],"length":["9.11","10.53","11.18","30.3","35.1"],"响应体的长度":["9.11"],"单位字节":["9.11"],"encoding":["9.11"],"响应体的编码格式":["9.11"],"gzip":["9.11"],"如果请求当中请求体":["9.12"],"那么在请求头当中的":["9.12"],"url":["9.14"],"也就是所谓的重定向":["9.14"],"4xx":["9.14"],"服务器必须在响应中包含有关冲突的信息":["9.15"],"已删除":["9.15"],"如果请求的资源已永久删除":["9.15"],"服务器就会返回此响应":["9.15"],"需要有效长度":["9.15"],"服务器不接受不含有效内容长度标头字段的请求":["9.15"],"未满足前提条件":["9.15"],"服务器未满足请求者在请求中设置的其中一个前提条件":["9.15"],"请求实体过大":["9.15"],"服务器无法处理请求":["9.15"],"因为请求实体过大":["9.15"],"超出服务器的处理能力":["9.15"],"请求的":["9.15"],"uri":["9.15"],"过长":["9.15"],"通常为网址":["9.15"],"处理请求":["9.17"],"访问页面":["9.18"],"浏览器还会进行一些额外的操作":["9.18"],"服务器发送查询请求":["9.19"],"传输报文":["9.20"],"网络层":["9.20"],"会应答一个报文给客户端":["9.25"],"服务端的接收":["9.25"],"发送能力是正常的":["9.25"],"此时服务端处于last":["9.26"],"ack的状态":["9.26"],"客户端收到":["9.26"],"bigint":["10.1"],"引用数据类型":["10.1"],"prototype":["10.2","11.11"],"tostringtag":["10.3"],"自定义类型":["10.3"],"是一个内置符号属性":["10.3"],"它的值是一个字符串":["10.3"],"用于表示一个对象的默认描述":["10.3"],"也就是调用":["10.3"],"会返回的内容":["10.3"],"let":["10.3","17.17","29.1","32.11","36.16"],"abc":["10.3"],"console":["10.3","10.57","10.71","11.8","11.10","11.15","11.30","12.2","28.1","31.0","35.2","36.5","36.6","36.8","36.24","38.1","38.2","43.9"],"log":["10.3","10.53","10.57","10.71","11.8","11.10","11.15","11.18","11.30","31.0","35.2","36.6","36.7","36.24","37.1","43.9"],"对于自定义对象":["10.3"],"调用上面的方法":["10.3"],"都只会返回":["10.3"],"此时就可以使用":["10.3"],"来指定一个确定的类型了":["10.3"],"标签之下的文档元素之前":["10.4"],"也就是说不等待后续载入的文档元素":["10.4"],"解析html和下载async脚本同时进行":["10.5"],"解析html和下载defer脚本同时进行":["10.6"],"在dom树构建完成":["10.7"],"私有属性":["10.8"],"把当前的微任务队列清空":["10.11"],"完成一次事件循环":["10.11"],"接着再取出一个宏任务":["10.11"],"同样把在此期间产生的回调入队":["10.11"],"微任务":["10.12"],"promise":["10.12"],"then":["10.12","12.2"],"区分了微任务和宏任务后":["10.13"],"0ms":["10.14"],"也不是立刻执行":["10.14"],"它有一个默认最小时间":["10.14"],"这样每个可以避免指针悬挂":["10.17"],"这样在对象块结束":["10.18"],"调用函数析构的时":["10.18"],"拷贝后原对象改变":["10.19"],"垃圾清除":["10.21"],"所谓的内存泄漏是程序认为一个变量已经没有用了":["10.22"],"垃圾回收机制认为他还在用":["10.22"],"在执行时":["10.23"],"会首先查找当前作用域下的变量":["10.23"],"a":["10.24","36.29"],"true":["10.24","10.54","11.4","11.16","11.20","33.9"],"使用":["10.25"],"a为假时执行b":["10.26"],"正常情况下":["10.27"],"运算操作符情况下优先调用valueof":["10.27"],"指向堆内存中一块地址":["10.28"],"undefined是初始化了":["10.32"],"但未定义赋值":["10.32"],"那前三位肯定也是000":["10.33"],"在比较相等性之前先将字符串转换为数值":["10.36"],"如果一个操作数是对象":["10.36"],"等于":["10.38"],"转换为":["10.39"],"所以造成误差":["10.40"],"解决方法":["10.40"],"先变成整数运算":["10.40"],"addeventlistener":["10.42"],"click":["10.42"],"name":["10.44","17.1"],"是window的一个方法":["10.46"],"也是基于promise":["10.46"],"ready触发":["10.47"],"else":["10.48","10.49","29.5","32.13","37.5","38.4"],"window":["10.48","10.49"],"如果后续又有新的子元素添加":["10.50"],"set1":["10.52"],"undefined":["10.53","17.7","17.20"],"或":["10.55"],"get":["10.58","19.12","20.9"],"clear":["10.59","15.4"],"将这个字典中的所有元素删除":["10.59"],"keys":["10.59"],"将字典中包含的所有键名以迭代器形式返回":["10.59"],"value":["10.60","25.0","36.23"],"of":["10.60","36.22","36.23"],"maps":["10.60"],"set":["10.61","20.7","20.9","20.19"],"nan本质是一个number":["10.62"],"typeof":["10.62","17.4","17.8"],"构造函数创建":["10.64"],"sayname":["10.65"],"obj2":["10.65"],"sunshin":["10.65"],"lin":["10.65"],"改变sayname的this指向obj2":["10.65"],"将arr数组元素连接成字符串并返回这个字符串":["10.66"],"map":["10.66","20.28"],"操作数组每一项并返回一个新数组":["10.66"],"foreach":["10.66","17.3"],"遍历数组":["10.66"],"没有返回值":["10.66"],"filter":["10.66"],"sqrt":["10.67"],"num":["10.67"],"对num进行开方":["10.67"],"pow":["10.67"],"yyyy":["10.71"],"pathname":["10.73","18.5"],"获取url的路径":["10.73"],"search":["10.73"],"获取":["10.73"],"开始的部分":["10.73"],"修改客户端":["10.74"],"浏览器":["10.74"],"由于bom的window包含了document":["10.74"],"window对象的属性和方法是直接可以使用而且被感知的":["10.74"],"因此可以直接使用window对象的document属性":["10.74"],"在严格模式下":["10.78"],"咱们不能在不声明变量的情况下使用变量":["10.78"],"控件":["10.79"],"输入字段可通过多种方式改变":["10.79"],"传入的参数":["11.2"],"but":["11.4"],"not":["11.4"],"inherited":["11.4"],"并返回此对象":["11.5"],"throws":["11.6"],"an":["11.6"],"error":["11.6","17.21"],"in":["11.6","20.17"],"property2":["11.7"],"hello":["11.7","11.13"],"以及不能修改已有属性的值":["11.9"],"此外":["11.9"],"expected":["11.10","11.16","11.20","11.25","11.30"],"proto":["11.12"],"inheritance":["11.13"],"chain":["11.13"],"speak":["11.13"],"return":["11.13","20.13","20.22","33.9","36.29","38.3","38.5"],"says":["11.13"],"honda":["11.15"],"accord":["11.15"],"configurable":["11.16"],"output":["11.16","11.20","11.30"],"返回一个数组":["11.17"],"tostring":["11.19"],"按相同顺序排列的字符串":["11.21"],"都是相同对象":["11.21"],"意味着都是同一个对象的值引用":["11.21"],"都是数字且":["11.21"],"signed":["11.22"],"zero":["11.22"],"getfoo":["11.26"],"is":["11.26"],"property":["11.26"],"which":["11.26"],"isn":["11.26"],"t":["11.26"],"enumerable":["11.26"],"my":["11.26","19.29"],"create":["11.26"],"当前属性的值只要原来是可写的就可以改变":["11.29"],"判断类型":["11.30"],"const":["11.31","17.27","20.20","21.6"],"object1":["11.31"],"new":["11.31","28.5","28.6"],"当执行了reslove函数":["12.0"],"会回调promise对象的":["12.0"],"如果then的第二个参数不存在":["12.1"],"则catch方法会捕获到":["12.1"],"如果是then的第一个参数函数":["12.1"],"resolve":["12.1"],"中抛出了异常":["12.1"],"即成功回调函数出现异常后":["12.1"],"then的第二个参数reject":["12.1"],"捕获捕获不到":["12.1"],"catch方法可以捕获到":["12.1"],"区别":["12.1"],"成功":["12.2"],"res":["12.2","22.0","26.0"],"如果resolve中传入的是一个对象":["12.3"],"并且这个对象有实现then方法":["12.3"],"那么会执行该then方法":["12.3"],"then方法会传入resolve":["12.3"],"reject函数":["12.3"],"此时的promise状态取决于你调用了resolve":["12.3"],"还是reject函数":["12.3"],"这种模式也称之为":["12.3"],"thenable":["12.3"],"原型对象":["12.4"],"即new出来实例对象的":["12.4"],"hi":["12.5"],"ice":["12.5"],"finally":["12.7"],"什么都不打印":["12.8"],"race":["12.8"],"优先获取第一个返回的结果":["12.8"],"无论结果是fulfilled还是rejectd":["12.8"],"它会比较不同类型的操作数":["13.1"],"专用的":["14.1"],"import命令则是异步加载":["14.2"],"或者更准确地说":["14.2"],"不必在每个模块文件顶部指定":["14.3"],"use":["14.3"],"strict":["14.3"],"不能":["14.4"],"mjs文件总是以":["14.5"],"es6":["14.5"],"模块加载":["14.5"],"官方介绍":["15.2"],"localstorage和sessionstorage是单纯的前端存储":["15.3"],"移除所有":["15.4"],"localstorage的相关操作":["15.4"],"localstorage":["15.4"],"对于版本较低的浏览器不支持":["15.5"],"服务器生成一个token便将此token返回给客户端":["15.7"],"以后客户端只需带上这个token前来请求数据即可":["15.7"],"客户端存储token":["15.8"],"客户端每次向服务端发送请求的时候都需要带上服务端发给的token":["15.8"],"会自动发送":["15.9"],"xss攻击":["16.0"],"csrf攻击":["16.0"],"伪数组数组":["16.0"],"虚拟dom":["16.0"],"设置localstorage时间":["16.0"],"浏览器输入url发生了什么":["16.0"],"interface":["17.1"],"arrobj":["17.1"],"any":["17.3"],"items":["17.3"],"ts":["17.7"],"function":["17.7","20.20"],"fun":["17.7"],"这里":["17.8"],"被收窄为":["17.8"],"这让":["17.9"],"getdogname":["17.10"],"dogname":["17.10"],"直接使用":["17.10"],"也不能赋给":["17.11"],"综上结论":["17.11"],"大":["17.11"],"是比小":["17.11"],"函数返回的类型都可以根据上下文推断出来":["17.12"],"比如我们能根据":["17.12"],"值域中排除":["17.14"],"通过":["17.15"],"specifiednum":["17.16"],"类型的父类型":["17.17"],"number":["17.17"],"除了可用于对类的一部分行为进行抽象以外":["17.18"],"也常用于对":["17.18"],"这里真实的类型应该为":["17.20"],"上面代码":["17.21"],"在参数里写对象就相当于是直接给labeledobj赋值":["17.21"],"这个对象有严格的类型定义":["17.21"],"所以不能多参或少参":["17.21"],"而当你在外面将该对象用另一个变量myobj接收":["17.21"],"myobj不会经过额外属性检查":["17.21"],"但会根据类型推论为let":["17.21"],"索引签名":["17.22"],"兔神":["17.23"],"但是可以作用于原始值":["17.24"],"基本类型":["17.24"],"联合类型":["17.24"],"元组以及其它任何你需要手写的类型":["17.24"],"tuple":["17.26","30.3"],"data":["17.26","19.11","33.3"],"dom":["17.26"],"除了":["17.29"],"之外":["17.29"],"以下是常见泛型变量代表的意思":["17.29"],"k":["17.29"],"arg":["17.30"],"这三个特性组合保证了代码的动态性和准确性":["17.32"],"也让代码提示变得更加丰富了":["17.32"],"映射类型":["17.32"],"我们可以通过":["17.32"],"来指定添加还是删除":["17.32"],"optionaltestinterface":["17.32"],"newtestinterface":["17.32"],"testinterface":["17.32"],"readonly":["17.32"],"nginx":["18.2"],"config的对应location里配置一行代码":["18.2"],"try":["18.2"],"files":["18.2"],"然后使用routerview组件来对vue":["18.3"],"createwebhashhistory":["18.4"],"创建的":["18.4"],"location":["18.5"],"在你的服务器上添加一个简单的回退路由":["18.5"],"如果":["18.5"],"replace":["18.6"],"beforerouteenter":["18.7"],"进入该组件之前调用":["18.7"],"无法获取到vue实例":["18.7"],"因为没有this":["18.7"],"所以支持给":["18.7"],"更新":["18.8","19.3"],"调用":["18.8"],"守卫中传给":["18.8"],"next":["18.8","33.2"],"的回调函数":["18.8"],"创建好的组件实例会作为回调函数的参数传入":["18.8"],"组件现在路由里注册但不进行组件的加载与执行":["18.9"],"被请求的模块和它引用的所有子模块":["18.10"],"会分离到一个单独的":["18.10"],"import":["18.11"],"加载中":["18.13"],"之类的指示":["18.13"],"返回唯一的html页面和它的公共静态资源":["19.1"],"后续的页面跳转都不会从服务端拿html文件":["19.1"],"数据更新之前被调用":["19.2"],"updated":["19.2"],"onupdated":["19.2"],"数据更新之后被调用":["19.2"],"父updated":["19.3"],"销毁过程":["19.3"],"在vue3中v":["19.6"],"if的优先级会更高":["19.6"],"但是当我们遍历一个数组的时候":["19.6"],"侦听器可以检测某个响应式数据的变化并执行副作用":["19.7"],"常见用法是传递一个函数":["19.7"],"执行副作用":["19.7"],"watch没有返回值":["19.7"],"但可以执行异步操作等复杂逻辑":["19.7"],"一般用来请求接口":["19.7"],"侦听器watch常用场景是状态变化之后做一些异步操作":["19.9"],"的":["19.10","20.26"],"的属性":["19.11"],"proxy":["19.12","20.16","20.26"],"vue3":["19.12"],"定义监听":["19.12"],"在":["19.12"],"中":["19.12"],"计算属性工作是做依赖收集":["19.12"],"vue2中是通过object":["19.15"],"defineproperty对数据劫持实现的":["19.15"],"vue3中则是使用proxy对数据代理实现的":["19.15"],"生命周期区别":["19.15"],"会调用我们插件的install属性的函数":["19.16"],"personname":["19.17"],"xiaoyue":["19.17"],"age":["19.17","28.2"],"父组件访问子组件":["19.18"],"children":["19.18"],"每个模块都拥有自己的state":["19.19"],"actions等":["19.19"],"在大型应用中经常用到":["19.19"],"孙行者":["19.20"],"多条数据修改":["19.20"],"patch":["19.20"],"方法可以接受两个类型的参数":["19.20"],"函数":["19.20"],"appstore":["19.21"],"pinia其实就是vuex5":["19.21"],"它和vuex的主要区别有以下几点":["19.21"],"pinia使用更简单":["19.21"],"alive还接收max属性表示最大缓存实例数":["19.23"],"如果超出这个数则最久没有被访问的缓存实例将被销毁":["19.23"],"都不会触发":["19.24"],"因为组件没被销毁":["19.25"],"如果mixin中的属性或者方法与父组件冲突则会使用父组件中的":["19.26"],"优点":["19.26"],"则不会破坏原对象":["19.27"],"只是在原对象上覆盖了一层":["19.27"],"src":["19.29"],"将在内存中渲染其默认的插槽内容":["19.30"],"如果在这个过程中遇到任何异步依赖":["19.30"],"所以在data刚被修改的时候":["19.32"],"我们是获取不到更新后的dom的":["19.32"],"然后与上一次虚拟dom节点树进行比较":["19.34"],"diff":["19.34"],"type":["19.35","40.3"],"不一样就认为节点不一样":["19.35"],"不再对比子节点":["19.35"],"这样时间复杂度一下子就降到了":["19.35"],"filltermeals":["19.36"],"子组件":["19.36"],"父组件":["19.37"],"father":["19.37"],"观察者模式":["20.2"],"一个被观察对象对应多个观察者":["20.2"],"被观察对象与观察者之间可能是":["20.3"],"多对多":["20.3"],"的关系":["20.3"],"两者都可以绑定多个另一角色":["20.3"],"依赖更新时会调用":["20.4"],"执行回调函数":["20.4"],"update":["20.4","20.13"],"oldvalue":["20.4"],"依赖收集管理者的构造函数":["20.4"],"保存所有":["20.4"],"观察者依赖数组":["20.4"],"subs":["20.4"],"插入一个观察者到依赖数组中":["20.4"],"addsub":["20.4","20.14"],"被观察者":["20.5"],"是在":["20.5"],"执行响应式时候调用":["20.5"],"newval":["20.7"],"下文中该方法统称为setter":["20.7"],"reactivesetter":["20.8","20.9"],"newvalue":["20.8","20.9"],"这里第一次调用来监测该对象":["20.9"],"defineproperty":["20.9"],"reactivegetter":["20.9"],"setprototypeof强制让vue的数据指向了新定义的arraymothods":["20.10"],"在getter中就能得到当前正在读取数据的watcher":["20.11"],"并把这个watcher收到dep中":["20.11"],"改变数据":["20.11"],"watcher":["20.12"],"注意":["20.12"],"parsepath":["20.13"],"当收到数据变化的消息时执行该方法":["20.13"],"从而调用cb":["20.13"],"this":["20.14","43.4"],"depend":["20.14"],"target":["20.14","20.25"],"notify":["20.14"],"被改变了":["20.15"],"通知依赖去更新":["20.15"],"对象来实现整个响应式系统基础":["20.16"],"是":["20.16"],"输出":["20.17"],"delete":["20.17"],"建立一个对象":["20.18"],"属性":["20.18"],"副作用函数的依赖关系":["20.18"],"add":["20.21"],"执行完成成后我们得到一个如下的数据结构":["20.21"],"集合":["20.21"],"effects":["20.22"],"而":["20.23"],"收集数据依赖":["20.24"],"因为发布者和观察者之间多了一个":["20.24"],"dependence":["20.24"],"依赖收集者":["20.24"],"返回一个对象的响应式代理":["20.25"],"extends":["20.25"],"object":["20.25","43.11"],"unwrapnestedrefs":["20.25"],"都是通过":["20.26"],"createreactiveobject":["20.26"],"方法来创建一个":["20.26"],"对象返回":["20.26"],"只是":["20.26"],"dep":["20.28"],"trigger":["20.32"],"设置target的key属性为value":["20.33"],"等常用的指令":["21.0"],"除此之外vue":["21.0"],"mounted":["21.2"],"el":["21.2"],"mount":["21.2","39.2","42.2"],"instance":["21.3"],"使用该指令的组件实例":["21.3"],"dir":["21.3"],"指令的定义对象":["21.3"],"代表绑定元素的底层":["21.3"],"prevnode":["21.3"],"之前的渲染中代表指令所绑定元素的":["21.3"],"钩子中可用":["21.3"],"vue":["21.3"],"div":["21.4"],"select":["22.0","26.0"],"execcommand":["22.0","26.0"],"reflect":["25.0"],"john":["28.3","28.5"],"john2":["28.4"],"john4":["28.6"],"temp":["29.1"],"push":["29.5","30.2","37.5","37.6"],"charcodeat":["30.1"],"是否需要扩容":["30.2"],"newsize":["30.4"],"math":["30.4","36.29"],"floor":["30.4"],"null":["30.7","33.4"],"continue":["30.7"],"j":["30.7"],"isempty":["31.1"],"非空右子树的所有键值大于其根结点的键值":["32.1"],"查找效率非常高":["32.2"],"min":["32.3"],"返回树中最小的值":["32.3"],"键":["32.3"],"max":["32.3"],"key":["32.4","32.8","36.22"],"left":["32.7"],"处理经过节点的右子节点":["32.7"],"处理当前节点":["32.8"],"处理右子树中的节点":["32.8"],"right":["32.9"],"whilesearch":["32.11"],"while":["32.11","33.4","33.5","33.7","33.8"],"在上面的代码中":["32.12"],"我们先保存了一些临时变量":["32.12"],"用于一会儿找到的要删除的节点对应的node":["32.12"],"用于保存current节点的父节点":["32.12"],"因为如果current有子节点":["32.12"],"那么在删除current节点的时候":["32.12"],"左为空":["32.14"],"root":["32.15"],"isleftchild":["32.15"],"parent":["32.15"],"有两个节点":["32.16"],"递归删除函数":["32.16"],"successor":["32.16"],"getsuccessor":["32.16"],"head":["33.1"],"让current指到下一个data":["33.2"],"直到current":["33.2"],"next为空":["33.2"],"最后把新节点赋值给current":["33.2"],"新节点就加入到了最后":["33.2"],"后一个":["33.4"],"prev":["33.4"],"前一个":["33.4"],"从头开始找位置":["33.4"],"index":["33.5","36.1","36.2","36.3"],"break":["33.9"],"previous":["33.11","33.12"],"removedata":["33.11","33.12"],"string":["34.1","34.2"],"size":["35.1"],"endname":["35.2"],"front":["35.2"],"ljt":["35.2"],"item":["36.1","36.2","36.3","36.12"],"result27":["36.10"],"result26":["36.12"],"result":["36.13"],"f":["36.15"],"值的槽":["36.16"],"result17":["36.16"],"result19":["36.18"],"result34":["36.21"],"pre":["36.26"],"cur":["36.26"],"result29":["36.27"],"result31":["36.28"],"b":["36.29"],"abs":["36.29"],"result33":["36.30"],"result36":["36.32"],"concat":["37.4"],"全局挂载之后在组件内就可以直接使用了":["39.2","40.2","42.2"],"或者直接写disabled":["39.4"],"midium":["40.1"],"small":["40.1"],"只需要引用下面这行代码":["40.2"],"你就可以看到按钮啦":["40.2"],"success":["40.3","40.5","40.6","40.7"],"plain":["40.3"],"dianhua":["40.8"],"电话":["40.8"],"shanchu":["42.1"],"shaixuan":["42.1"],"shandian":["42.1"],"pinglun":["42.1"],"shengyin":["42.1"],"你就可以看到图标啦":["42.3"],"line":["42.4"],"dot":["42.4"],"red":["42.5"],"td默认继承tr的高度":["43.2"],"且平分table的宽度":["43.2"],"若table":["43.2"],"不存在":["43.2"],"给td设置的宽高不能用百分比只能用准确的数":["43.2"],"object小写":["43.3"],"但请求者应继续使用原有位置来进行以后的请求":["43.6"],"sort会影响原数组":["43.7"],"区域外的隐藏":["43.8"],"转为字符串都是":["43.11"],"判断数据类型得用":["43.12"],"hight":["43.14"],"1s":["43.14"],"且当标签失焦后触发change事件":["43.15"],"顺序不能乱":["43.18"],"水击三千里":["46.0"],"抟扶摇而上者九万里":["46.0"],"温故而知新":["47.0"]},{"0":["1.13","6.10","11.21","30.5","36.21","43.1"],"1":["9.2","9.8","11.30","17.16","17.27","33.6","36.16"],"2":["3.12","11.30","12.6","30.2","30.4","33.12","36.16"],"3":["1.19","5.2","9.25","10.54","11.30","11.31","20.17","21.2","32.1","32.15","32.16","36.16","43.1"],"4":["6.15","9.18","9.19","9.20","10.11","10.14","10.76","10.77","11.31","12.5","19.7","19.19","19.26","20.25","20.26","43.2"],"5":["3.6","9.26","17.19","19.7","19.9","19.15"],"6":["2.7","5.8","5.9","6.9","9.17","10.47","12.8","15.8"],"7":["43.17"],"8":["17.32","37.0","38.0"],"9":["6.7","8.2","17.32","37.0","38.0"],"10":["8.2","36.17","42.4"],"11":["8.2"],"12":["36.17"],"14":["36.17"],"15":["9.15"],"16":["9.15"],"17":["9.15"],"20":["28.3","28.4","28.5"],"50":["1.1"],"60":["34.2"],"75":["30.2"],"415":["9.15"],"416":["9.15"],"417":["9.15"],"500":["9.15"],"501":["9.15"],"100000":["17.23"],"overflow除visible以外的值":["1.2"],"hidden":["1.2"],"basis":["1.4"],"不管内容多少":["1.5"],"一般都是平分空间":["1.5"],"不是均分的":["1.6"],"除非内容都是一样":["1.6"],"不可扩大":["1.7","1.8"],"设置元素内容可见性":["1.10"],"设置的元素本身不受影响":["1.10"],"隐藏效果与":["1.10"],"利用偏移抛出视图":["1.11"],"空间会占据":["1.11"],"z":["1.12","6.17"],"index":["1.12","6.17","18.2","18.5","30.1","36.10","36.12"],"层叠上下文在合适的情况下可以遮挡住元素":["1.12"],"那么子元素1em就表示大小和父元素一样为80px":["1.13"],"可视窗口高度":["1.14"],"1vw":["1.14"],"就等于可视窗口宽度的百分之一":["1.14"],"默认值为row":["1.15"],"nowrap":["1.15"],"content属性定义了项目在主轴上的对齐方式":["1.15"],"items属性定义项目在交叉轴上如何对齐":["1.15"],"列":["1.16"],"产生了一个个的网格":["1.16"],"我们可以将网格元素放在与这些行和列相关的位置上":["1.16"],"white":["1.17"],"space":["1.17"],"reflow":["1.18"],"relayout":["1.18"],"所谓重排即指对这些节点以及受这些节点影响的其它节点":["1.18"],"进行css计算":["1.18"],"布局":["1.18"],"亦即如果你设置了top":["1.19"],"50px":["1.19"],"那么在sticky元素到达距离相对定位的元素顶部50px的位置时固定":["1.19"],"不再向上移动":["1.19"],"around是每个子项目左右方向的":["1.20"],"margin":["1.20"],"相等":["1.20"],"direction":["1.21"],"指定是否应该轮流反向播放动画":["1.21"],"fill":["1.21"],"mode":["1.21","11.6"],"规定当动画不播放时":["1.21"],"当动画完成时":["1.21"],"circle":["1.22"],"通过设置不同的上下左右边框宽度或者颜色即可得到三角形或者梯形":["2.0"],"padding":["2.1"],"的百分比计算是参照父元素的":["2.1"],"width":["2.1"],"清除浮动方法":["2.2"],"万能清除法":["2.2"],"after":["2.2"],"用户行为":["2.4"],"例如调整窗口大小":["2.4"],"改变字号":["2.4"],"其实对于大部分图标这类图片":["2.5"],"完全可以使用":["2.5"],"svg":["2.5"],"代替":["2.5"],"3d转换":["2.6"],"transform":["2.6"],"过渡与动画":["2.6"],"transition":["2.6"],"弹性布局":["2.7"],"flex":["2.7"],"利用flex布局的方式":["2.7"],"左右两栏设置固定宽度":["2.7"],"中间一栏设置为flex":["2.7"],"这种实现方式代码非常简洁":["2.7"],"display":["2.7"],"向外共享模块成员使用":["3.2"],"export关键字":["3.2"],"只要是合法的成员名称即可":["3.4"],"按需导入可以和默认导入一起使用":["3.5"],"es6新增":["3.5"],"会自动变为window对象的变量":["3.6"],"属性或方法":["3.6"],"但const和let不会":["3.6"],"也就是说声明前不可用":["3.7"],"大部分包含":["3.7"],"的都可以构成块级作用域":["3.7"],"但是函数和对象不构成块级作用域":["3.7"],"user":["3.8"],"obj":["3.8","20.13"],"箭头函数没有arguments":["3.9"],"要接受所有的参数用":["3.9"],"rest":["3.9"],"通过extends关键字实现继承":["3.11"],"default是以整体的方式抛出":["3.12"],"的字符串创建了":["4.0"],"symbol类型":["4.0"],"创建了就会在全局中登记":["4.0"],"如果有则不重复创建":["4.0"],"已登记的":["4.0"],"然而symbol":["4.0"],"的创建是":["4.0"],"不会去检索全局":["4.0"],"的":["4.0","5.2","6.13"],"是":["4.0","12.1"],"直接创建一个新的symbol类型":["4.0"],"这也是用symbol":["4.0"],"创建的两个":["4.0"],"类型不相等的根本原因":["4.0"],"方法返回一个已登记的":["4.0"],"类型值的":["4.0"],"key":["4.0","17.29","32.9"],"是表述":["5.1"],"的内部数据结构":["5.1"],"节点":["5.2"],"并将dom":["5.2"],"节点添加到":["5.2"],"树中":["5.2"],"解析器开始工作时":["5.2"],"会默认创建了一个根为":["5.2"],"document":["5.2","17.26"],"的空":["5.2"],"同时会将一个":["5.2"],"starttag":["5.2"],"会影响dom树的渲染":["5.3"],"也可以说最终会影响渲染树的生成":["5.3"],"文件中包含的":["5.4"],"css":["5.4","6.13"],"等相关文件":["5.4"],"来标记代码":["5.5"],"不管":["5.6"],"文件谁先到达":["5.6"],"都要先等到":["5.6"],"文件下载完成并生成":["5.6"],"图片资源都加载完毕之后":["5.7"],"load":["5.7"],"页面加载完毕":["5.8","10.47"],"重绘":["5.9","6.9"],"根据浏览器提供各层的信息合成图层":["5.9","6.9"],"render":["5.10","18.3","20.24"],"树和布局":["5.10"],"一边解析":["5.11"],"以及一边渲染":["5.11"],"即使计算机硬件一直在迭代更新":["5.13"],"的代价仍旧是昂贵的":["5.13"],"上":["5.14"],"操作内存中的":["5.14"],"对象的速度显然要更快":["5.14"],"等更新完成后":["5.14"],"对象的差异应用到真正的":["5.15"],"create":["5.17"],"elemenet":["5.17"],"我们一般称为怪异模式":["6.1"],"这不仅会降低解析效率":["6.1"],"而且会在解析过程中产生一些难以预知的bug":["6.1"],"是早期的斜体元素":["6.2"],"表示内容展示为斜体":["6.2"],"而":["6.2","12.1"],"是emphasize":["6.2"],"使用行内元素需要注意的是":["6.3"],"行内元素设置宽度width无效":["6.3"],"行内元素设置height无效":["6.3"],"但是可以通过line":["6.3"],"height来设置":["6.3"],"设置margin只有左右有效":["6.3"],"上下无效":["6.3"],"设置padding只有左右有效":["6.3"],"a元素最常见的就是用来做锚点和":["6.5"],"下载文件":["6.5"],"锚点可以在点击时快速定位到一个页面的某个位置":["6.5"],"keywords是关键词标签":["6.6"],"lt":["6.7"],"ie":["6.7"],"strike":["6.8"],"tt":["6.8"],"u":["6.8"],"big":["6.8"],"center":["6.8"],"obsity":["6.10"],"这三个占位置":["6.10"],"重排非常耗费资源":["6.11"],"开发尽量减少次数":["6.11"],"式是使":["6.13"],"will":["6.13"],"change":["6.13"],"属性":["6.13"],"和":["6.14","10.3","17.14","19.21"],"opacity":["6.14"],"才不会触发":["6.14"],"等元素":["6.15"],"隐式合成":["6.15"],"浏览器是无法进行层压缩的":["6.16"],"比如":["6.16"],"video":["6.16"],"譬如巧妙的使用":["6.17"],"table":["6.18"],"以及":["6.18"],"img":["6.18"],"方便其他设备解析":["6.19"],"如屏幕阅读器":["6.19"],"盲人阅读器":["6.19"],"页面等角度进行合理规划":["7.1"],"使网站更适合搜索引擎的索引原则的行为":["7.1"],"用自然语言描述页面的主要内容":["7.2"],"description就是用自然语言描述页面的主要内容":["7.3"],"这里注意一点就是把每个关键词至少覆盖一遍才能达到最佳效果":["7.3"],"还可以在不同的页面之间相互投权重":["7.4"],"短域名":["7.5"],"越短越好记":["7.5"],"域名历史":["7.5"],"买之前":["7.5"],"在搜索引擎搜索以下":["7.5"],"主要是有js":["8.1"],"dom组成":["8.1"],"所有属性必须有属性值":["8.2"],"所有的标签都必须有相应的结束标签":["8.2"],"所有的标签都必须合理嵌套":["8.2"],"加载越快":["8.3"],"用户体验提高":["8.3"],"服务器监听客户端的请求":["9.1"],"收到请求":["9.1"],"状态码":["9.1"],"无状态协议解决办法":["9.2"],"通过":["9.2"],"cookie":["9.2"],"ip等协议构成的协议簇":["9.3"],"只是因为在tcp":["9.3"],"ip协议中tcp协议和ip协议最具代表性":["9.3"],"是无状态的":["9.4"],"协议是由":["9.4"],"协议构建的可进行加密传输":["9.4"],"web":["9.5"],"性能":["9.5"],"原信息或称元数据":["9.8"],"trace":["9.8"],"显示服务器收到的请求":["9.8"],"主要用于测试或诊断":["9.8"],"connect":["9.8"],"http":["9.8"],"返回数据":["9.9"],"而对于post":["9.9"],"浏览器先发送header":["9.9"],"服务器响应100":["9.9"],"continue":["9.9"],"比":["9.10"],"get":["9.10"],"deflate":["9.11"],"告知对方我方接受的":["9.11"],"给当前资源的标识":["9.11"],"和last":["9.11"],"content":["9.12"],"length":["9.12","17.19","33.1"],"客户端错误":["9.14"],"请求有语法错误或者请求无法实现":["9.14"],"5xx":["9.14","9.15"],"服务器无法处理":["9.15"],"不支持的媒体类型":["9.15"],"请求的格式不受请求页面的支持":["9.15"],"请求范围不符合要求":["9.15"],"如果页面无法提供请求的范围":["9.15"],"则服务器会返回此状态代码":["9.15"],"未满足期望值":["9.15"],"服务器未满足":["9.15"],"期望":["9.15"],"请求标头字段的要求":["9.15"],"服务器错误":["9.15"],"服务器内部错误":["9.15"],"服务器遇到错误":["9.15"],"无法完成请求":["9.15"],"尚未实施":["9.15"],"接受响应":["9.17"],"比如安全检查":["9.18"],"访问限制":["9.18"],"路由器缓存":["9.19"],"isp":["9.19"],"ip协议查询mac地址":["9.20"],"链路层":["9.20"],"不过此时服务器并不能确认客户端的接收能力是否正常":["9.25"],"第三次握手就是客户端收到报文后再给服务器发送一个报文":["9.25"],"三次握手就成功了":["9.25"],"一样发送一个":["9.26"],"报文作为应答":["9.26"],"此时客户端处于time":["9.26"],"object":["10.1","10.27"],"function":["10.1","11.26","20.13"],"属性是否出现在某个实例对象的原型链上":["10.2"],"class":["10.3"],"person":["10.3","10.64"],"getsymbol":["10.3"],"return":["10.3","11.26","17.4","17.12","30.5","30.6","31.1","33.3","33.6","35.2","36.1","36.2","36.3","36.26","37.5","37.6","38.4"],"isprototypeof":["10.3"],"类似":["10.3"],"isarray":["10.3"],"专业检测数组三十年":["10.3"],"isnan":["10.3"],"属于":["10.3"],"es6":["10.3","20.16"],"标准":["10.3"],"中有一个特殊的":["10.3"],"数字":["10.3"],"nan":["10.3","11.21"],"表示":["10.3"],"not":["10.3"],"不是一个数字":["10.3"],"但它却归属于数字类型":["10.3"],"读到就加载并执行":["10.4"],"先执行下载js脚本然后执行然后再解析html":["10.4"],"async脚本下载完成后立即执行":["10.5"],"然后开始解析剩下的html":["10.5"],"执行时会在html页面解析完毕之后再去执行":["10.6"],"domcontentloaded之前执行":["10.7"],"再把当前的微任务队列清空":["10.11"],"以此往复":["10.11"],"宏任务队列只有一个":["10.11"],"mutationobserver":["10.12"],"监听dom":["10.12"],"node":["10.12"],"中的":["10.12"],"本轮循环中的微任务实际上就是在插队":["10.13"],"这样微任务中所做的状态修改":["10.13"],"为4ms":["10.14"],"所以执行第一个宏任务的script的时间大于4ms执行settimeout的回调":["10.14"],"会造成同一份资源析构2次":["10.18"],"即delete同一块内存2次":["10.18"],"也不会影响":["10.19"],"释放内存":["10.21"],"从而导致这段内存无法释放":["10.22"],"程序对一段内存失去了控制":["10.22"],"才定义为内存泄漏":["10.22"],"如果找不到":["10.23"],"就会沿着作用域链中查找":["10.23"],"a为真时执行a":["10.26"],"js":["10.27"],"prototype":["10.27","11.1","43.12"],"内容存在堆内存中":["10.28"],"tostring":["10.31","11.20","43.12"],"所以被判断为object":["10.33"],"转成boolean类型":["10.35"],"逻辑非运算符":["10.35"],"另一个操作数不是":["10.36"],"则调用对象的tostring":["10.36"],"方法":["10.36","20.4"],"也不大于":["10.37"],"所以是false":["10.37"],"所以是true":["10.38"],"左边为字符串":["10.39"],"转换为0":["10.39"],"最终为":["10.39"],"然后再变回小数":["10.40"],"tofixed":["10.40"],"性能不好":["10.40"],"false":["10.42","10.54","11.7","11.20","30.5"],"目标阶段":["10.45"],"但是与xhr无关":["10.46"],"不支持ie":["10.46"],"加载图片等外部文件":["10.47"],"event":["10.48","10.49"],"cancelbubble":["10.48"],"returnvalue":["10.49"],"会由于事件委托的原因":["10.50"],"自动接收到父元素的事件监听":["10.50"],"quchong":["10.51"],"arr":["10.55","11.30"],"has":["10.58"],"true":["10.58","11.3","11.15","20.32","25.0"],"delete":["10.58"],"values":["10.59"],"将字典中包含的所有数值以迭代器形式返回":["10.59"],"entries":["10.59"],"返回所有成员的迭代器":["10.59"],"number":["10.62","17.21"],"this":["10.64","11.26","17.7"],"对数组所有项进行判断":["10.66"],"返回符合规则的新数组":["10.66"],"every":["10.66"],"数组每一项都符合规则才返回true":["10.66"],"some":["10.66"],"数组有符合规则的一项就返回true":["10.66"],"reduce":["10.66"],"m":["10.67"],"对num取m次幂":["10.67"],"random":["10.67"],"mm":["10.71"],"ddthh":["10.71"],"href":["10.73"],"获取整个url":["10.73"],"hash":["10.73"],"通过document属性就可以访问":["10.74"],"检索":["10.74"],"修改xhtml文档内容与结构":["10.74"],"因为document对象又是dom的根节点":["10.74"],"可以说":["10.74"],"bom包含了dom":["10.74"],"ello":["10.76"],"ell":["10.77"],"早期版本的js忽略了":["10.78"],"取决于":["10.79"],"type":["10.79","40.2"],"继承属性和方法":["11.1"],"properties":["11.4"],"can":["11.4"],"be":["11.4"],"overwritten":["11.4"],"expected":["11.4","11.8","11.15"],"output":["11.4","11.8","11.10","11.15","11.25"],"strict":["11.6"],"console":["11.6","11.31","17.7","17.30","28.2","28.3","28.4","28.5","28.6","31.1","36.1","36.2","36.3","36.4","36.9","36.10","36.14","36.16","36.18","36.19","36.20","36.21","36.26","36.27","36.28","36.30","36.31","36.32","37.4","37.5","37.6","37.7","38.3","38.4","38.5"],"log":["11.6","11.31","12.2","17.7","17.30","28.1","28.2","28.3","28.5","28.6","36.4","36.5","36.8","36.9","36.14","36.16","36.18","36.19","36.21","36.27","36.30","36.32","37.4","37.5","37.6","37.7","38.1","38.2","38.3","38.5"],"etc":["11.7"],"冻结一个对象后该对象的原型也不能被修改":["11.9"],"属性的值":["11.11"],"fly":["11.13"],"is":["11.13","17.7","19.17"],"flying":["11.13"],"const":["11.13","13.2","20.14","34.1","34.2"],"superman":["11.13"],"new":["11.13","13.2","33.12","34.2"],"备注":["11.14"],"与":["11.14"],"instanceof":["11.14"],"运算符不同":["11.14"],"在表达式":["11.14"],"afunction":["11.14"],"value":["11.16","17.29","20.19","20.21","36.24"],"该数组对元素是":["11.17"],"obj自身拥有的枚举或不可枚举属性名称字符串":["11.17"],"0n":["11.22"],"array":["11.25"],"non":["11.26"],"then函数":["12.0"],"当执行了reject函数":["12.0"],"reject":["12.1"],"的方法":["12.1"],"实例的方法":["12.1"],"是用来抛出异常":["12.1"],"catch":["12.2"],"err":["12.2"],"rej":["12.3"],"hi":["12.3"],"指向了promise原型对象":["12.4"],"then的返回值":["12.5"],"then方法是有返回值的":["12.5"],"它的返回值是promise":["12.5"],"那它的状态如何决定":["12.5"],"catch的返回值":["12.6"],"execute":["12.7"],"e":["12.8"],"any":["12.8"],"与race类似":["12.8"],"只获取第一个状态为fulfilled":["12.8"],"如果全部为rejected则报错aggregateerror":["12.8"],"并尝试强制类型转换":["13.1"],"看看逻辑非运算符":["13.2"],"number1":["13.2"],"commonjs":["14.1","14.5"],"模块有一个独立的静态解析阶段":["14.2"],"依赖关系的分析是在那个阶段完成的":["14.2"],"br":["14.3"],"如果不希望将后缀名改成":["14.3"],"mjs":["14.3"],"可以在项目的package":["14.3"],"require":["14.4","17.32"],"不支持":["14.4"],"模块的一个原因是":["14.4"],"它是同步加载":["14.4"],"cjs文件总是以":["14.5"],"localstorage的有效期是在不进行手动删除的情况下是一直有效的":["15.1"],"可能和浏览器有部分差异性":["15.2"],"不参与与服务端的通信":["15.3"],"比如ie8版本以下的都不支持":["15.5"],"无需再次带上用户名和密码":["15.7"],"然后去验证客户端请求里面带着token":["15.8"],"如果验证成功":["15.8"],"缺点不能跨域":["15.9"],"vue的keepalive":["16.0"],"垃圾回收":["16.0"],"三栏布局实现":["16.0"],"diff":["16.0"],"vue数据双向绑定":["16.0"],"eventloop宏任务微任务":["16.0"],"js变量提升":["16.0"],"age":["17.1"],"接口类型定义":["17.2"],"interface":["17.2"],"serachfunc":["17.2"],"item":["17.3","36.10"],"let":["17.3","17.26"],"a":["17.3","35.2"],"error":["17.5","17.19"],"else":["17.8"],"类型成为了类型系统的顶级类型":["17.9"],"upname":["17.10"],"tolowercase":["17.10"],"typeof":["17.10"],"if":["17.10","19.36"],"string":["17.10"],"更宽泛的类型":["17.11"],"least":["17.11"],"specific":["17.11"],"和大":["17.11"],"可以互相代替":["17.11"],"用来表示原始类型":["17.11"],"语句推断函数返回的类型":["17.12"],"specifiedboolean":["17.16"],"对象的形状":["17.18"],"shape":["17.18"],"push":["17.19","20.4","36.22","36.23"],"girl":["17.23"],"起别名不会新建一个类型":["17.24"],"它创建了一个新":["17.24"],"名字来引用那个类型":["17.24"],"div":["17.26","19.36"],"createelement":["17.26"],"类别名扩展接口":["17.28"],"表示对象中的键类型":["17.29"],"v":["17.29","21.2"],"表示对象中的值类型":["17.29"],"partial":["17.32"],"requird":["17.32"],"将类型的属性变成可选":["17.32"],"是代表移除":["17.32"],"pick":["17.32"],"uri":["18.2"],"html":["18.2"],"page的一个渲染":["18.3"],"改变会触发":["18.4"],"onhashchange":["18.4"],"不匹配任何静态资源":["18.5"],"它应提供与你的应用程序中的":["18.5"],"传递回调":["18.7"],"在导航确认后被调用":["18.7"],"beforerouteupdate":["18.7"],"在当前路由改变":["18.7"],"但是该组件被复用时调用":["18.7"],"因为在这种情况发生的时候":["18.7"],"组件已经挂载好了":["18.7"],"导航守卫可以访问组件实例":["18.7"],"失活的组件beforerouteleave":["18.8"],"复用的组件beforerouteupdate":["18.8"],"组件解析后beforeresolve":["18.8"],"等到需要访问组件的时候才进行真正的加载":["18.9"],"chunk":["18.10"],"中":["18.10"],"router":["18.11"],"createrouter":["18.11"],"routes":["18.11"],"path":["18.11"],"导航完成之前获取":["18.13"],"导航完成前":["18.13"],"在路由进入的守卫中获取数据":["18.13"],"hash和history路由实现浏览器url变化而不刷新页面":["19.1"],"beforedestroy":["19.2"],"onbeforeunmount":["19.2"],"组件销毁前调用":["19.2"],"destroyed":["19.2"],"父beforedestroy":["19.3"],"子beforedestroy":["19.3"],"子destroyed":["19.3"],"if则更适合条件不经常改变的场景":["19.5"],"因为它切换开销相对较大":["19.5"],"根据数组中的某个元素进行v":["19.6"],"if判断的时候就会报错":["19.6"],"因为v":["19.6"],"watch在页面首次加载的时候默认不会执行":["19.7"],"需要设置immediate":["19.7"],"true首次才会执行监听":["19.7"],"有异步请求的用wach":["19.9"],"vuex":["19.11"],"set":["19.12"],"计算属性重要工作是重新执行计算方法":["19.12"],"这里需要多补充一句":["19.12"],"因为":["19.12"],"本身所有数据对应一个":["19.13"],"在响应数据初始化时是不会执行回调函数的":["19.14"],"vue3中将beforecreate和created合并到了setup函数中":["19.15"],"根节点":["19.15"],"vue3组件允许多个根节点":["19.15"],"而vue2只允许一个":["19.15"],"并且将当前组件的实例传进来":["19.16"],"所以在插件中就可以对这个实例进行一些操作来实现我们插件的功能":["19.16"],"slotprops":["19.17"],"my":["19.17"],"and":["19.17"],"i":["19.17"],"ref":["19.18","25.0"],"expose":["19.18"],"兄弟组件传值":["19.18"],"eventbus":["19.18"],"场景":["19.19"],"当我们异步获取结果并赋值给state的时候":["19.19"],"比如数据请求":["19.19"],"count":["19.20"],"通过函数方式去使用的时候":["19.20"],"函数接受一个":["19.20"],"的参数":["19.20"],"就是":["19.20"],"store":["19.20"],"仓库中的":["19.20"],"更符合开发者的开发习惯":["19.21"],"pinia中抛弃传统的":["19.21"],"mutation":["19.21"],"只有":["19.21"],"state":["19.21"],"getter":["19.21"],"简化状态管理库":["19.21"],"状态state的修改可以直接进行修改":["19.21"],"alive有两个生命周期":["19.23"],"分别是activated和deactivated":["19.23"],"activated钩子会在首次挂载或者每次从缓存中被重新插入的时候调用":["19.23"],"执行顺序":["19.24"],"被缓存起来了":["19.25"],"可以降低代码冗余提高逻辑复用性":["19.26"],"缺点":["19.26"],"命名容易冲突":["19.26"],"数组新增修改":["19.27"],"movie":["19.29"],"mp4":["19.29"],"则会进入挂起状态等待异步组件加载完毕":["19.30"],"在挂起状态期间":["19.30"],"展示的是":["19.30"],"这时候便需要调用nexttick函数在它的回调函数中获取到变化后的dom":["19.32"],"利用了异步任务在同步任务之后执行的原理":["19.32"],"从而找到差异的部分":["19.34"],"最后渲染到真实的dom节点上面":["19.34"],"其实":["19.35"],"showdatils":["19.37"],"两者直接联系":["20.2"],"被观察这改变时直接向所有观察者发送消息":["20.2"],"而两个角色之间还有一个":["20.3"],"依赖收集和管理":["20.3"],"的角色":["20.3"],"提供一些观察者的操作方法":["20.3"],"sub":["20.4"],"只有此时的依赖目标":["20.4"],"实例":["20.4"],"存在时才收集依赖":["20.4"],"发送更新":["20.4"],"遍历依赖数组分别执行每个观察者定义好的":["20.4"],"对象主要功能是做依赖收集":["20.5"],"维护多个":["20.5"],"当更新时候循环调用每个":["20.5"],"notify":["20.8","20.15"],"这里第二次调用":["20.9"],"设置的新值也要被监听":["20.9"],"c":["20.9","34.2"],"因为数据变化触发setter方法":["20.11"],"发布依赖":["20.11"],"通知watcher":["20.11"],"watcher收到后执行回调":["20.11"],"dep类收集的依赖是watcher":["20.12"],"watcher的依赖是data数据":["20.12"],"对存储的数据进行更新":["20.13"],"segments":["20.13"],"split":["20.13"],"foreach":["20.14","20.29"],"s":["20.14"],"数据被改变了":["20.15"],"我要把新的值渲染到页面上去":["20.15"],"watcher设置在全局中读取数据":["20.15"],"因为读取了数据":["20.15"],"新增的一个构造函数":["20.16"],"用来创建一个":["20.16"],"目标对象的代理对象":["20.16"],"但是":["20.17","32.15"],"只有通过":["20.17"],"proxyobj":["20.17"],"进行操作的时候才能通过定义的操作拦截方法进行处理":["20.17"],"直接使用原对象则无法触发拦截器":["20.17"],"这也是":["20.17"],"vue":["20.17"],"中要求的":["20.17"],"reactive":["20.17"],"trigger":["20.18"],"进行依赖更新":["20.18"],"通过对象":["20.18"],"与属性":["20.18"],"reactiveeffect":["20.20","20.21"],"在派发更新时就能准确的找到这些被收集起来的副作用函数":["20.23"],"当数据发生更新时再次执行它":["20.23"],"与传统观察者模式不同":["20.24"],"当数据更新时触发":["20.24"],"等一系列":["20.24"],"接受一个对象":["20.25"],"不论是响应式还是普通的":["20.25"],"或是一个":["20.25"],"返回一个原值的只读代理":["20.25"],"deleteproperty":["20.26"],"操作会直接拦截报错":["20.26"],"提示禁止更新":["20.26"],"至于":["20.26"],"设值时自动通知更新":["20.32"],"所以实际是是设置receiver的key的值为value":["20.33"],"但这可不是直接":["20.33"],"proxy的set对应reflect":["20.34"],"还允许开发者自定义指令":["21.0"],"面试经常会问什么是自定义指令":["21.0"],"使用":["21.2"],"template":["21.2","21.3"],"input":["21.2"],"h1":["21.3"],"color":["21.3"],"button":["21.3","39.2","40.2"],"click":["21.3"],"changecolor":["21.3"],"hello":["21.3"],"下":["21.4"],"use":["21.6"],"mount":["21.6"],"复制成功":["22.0","26.0"],"removechild":["22.0","26.0"],"updated":["22.0","26.0"],"proxy":["25.0"],"initvalue":["25.0"],"john":["28.4"],"temp":["29.2"],"newsize":["30.2"],"prime":["30.4"],"getprime":["30.4"],"resize":["30.4"],"tuple":["30.7"],"empty":["31.0"],"pop":["31.1"],"左":["32.1"],"右子树本身也都是二叉搜索树":["32.1"],"这也是二叉搜索树中":["32.2"],"搜索的来源":["32.2"],"返回树中最大的值":["32.3"],"remove":["32.3"],"left":["32.4"],"向右查找":["32.5"],"right":["32.5","32.7","32.8","32.10","40.1"],"遍历过程为":["32.7","32.8","32.9"],"访问根结点":["32.7"],"中序遍历其左子树":["32.8"],"处理当前节点":["32.9"],"后序遍历其左子树":["32.9"],"必然需要将parent的left或者right指向它的某一个子节点":["32.12"],"所以需要保存起来current的parent":["32.12"],"树中的节点关系不能向上的":["32.12"],"和链表非常相似":["32.12"],"boolean类型":["32.12"],"它用户记录我们是在current是在父节点的左侧还是右侧":["32.12"],"以便到时候设置parent的left或者right":["32.12"],"然后开始查找对应的key":["32.12"],"还是之前的思路":["32.12"],"isleftchild":["32.13"],"parent":["32.13"],"将删除节点的左子树赋值给successor":["32.15","32.16"],"warning":["32.15"],"警告":["32.15"],"注意":["32.15"],"对于删除15我们还缺少什么呢":["32.15"],"已经完成":["32.15"],"11的left指向了18":["32.15"],"18的right指向了13":["32.15"],"没有完成":["32.15"],"19怎么办":["32.15"],"寻找后继":["32.16"],"delnode要删除的节点":["32.16"],"successor后继节点":["32.16"],"successorparent后继节点的父节点":["32.16"],"delnode":["32.16"],"successorparent":["32.16"],"while":["33.2"],"next":["33.3","33.5","33.7","36.24"],"removedata2":["33.9","33.11","33.12"],"position":["33.9","40.1","43.2"],"indexof":["33.9","35.2"],"head":["33.10"],"null":["33.10"],"break":["33.11","33.12"],"isempty":["33.11","33.12"],"size":["33.11","33.12"],"clear":["33.11","33.12"],"link":["33.11","33.12"],"join":["34.1","34.2"],"普通js构造函数继承":["34.1"],"pq":["34.1","34.2"],"names":["35.2"],"result":["36.11","38.1"],"flat":["36.13"],"infinity":["36.13"],"o":["36.15"],"b":["36.15"],"result30":["36.20"],"concat":["36.26"],"result35":["36.31"],"arr3":["37.7"],"只需要引用下面这行代码":["39.2","42.2"],"你就可以看到流光按钮啦":["39.2"],"flowing":["39.2"],"流光按钮":["39.3"],"mini":["40.1"],"添加icon":["40.1"],"icon":["40.1"],"shuaxin":["40.1","42.1"],"刷新":["40.1"],"l":["40.2"],"primary":["40.2"],"plain":["40.2"],"按钮":["40.3"],"info":["40.8"],"pinglun":["40.8"],"sousuo":["42.1"],"xiaoxi":["42.1"],"zhihui":["42.1"],"gengduo":["42.1"],"fanhui":["42.1"],"选择你想要的图标":["42.2"],"name":["42.2"],"你就可以看到图标啦":["42.2"],"badge":["42.4"],"说明":["42.5"],"部分图标不支持添加颜色":["42.5"],"给td设置vertical":["43.2"],"align":["43.2"],"middle":["43.2"],"td元素里面":["43.2"],"除float":["43.2"],"absolute":["43.2"],"所有的块级":["43.2"],"非块级元素都会相对于td垂直居中":["43.2"],"给td设置text":["43.2"],"undefined首字母大写":["43.3"],"而不是拒绝处理该请求":["43.6"],"其他的不会":["43.7"],"可以指定一些特定形状":["43.8"],"只会执行第一个catch":["43.9"],"对象的键名可以是字符串和symbol值":["43.10"],"所以当键名为除了字符串和symbol值以外的其他类型值时":["43.10"],"都是需要转换为字符串的":["43.10"],"所以和情况一一样重复赋值":["43.11"],"call":["43.12"],"解决设置max":["43.14"],"higeht":["43.14"],"庄子":["46.0"],"逍遥游":["46.0"],"错题集":["47.0"],"长点心":["47.0"]},{"0":["11.18","19.36","20.4","33.1","36.24"],"1":["11.13","17.3","20.8","30.3","30.7"],"2":["6.3","9.2","17.3","17.27","33.11"],"3":["11.22","13.2","17.3","20.9","33.11","33.12"],"4":["12.1","33.11","33.12","35.2"],"5":["2.5","19.27","33.11","33.12","36.6"],"6":["7.5","19.15"],"7":["2.7","7.5","11.31"],"10":["10.3","17.32","31.1","34.1","34.2","38.0"],"11":["36.7"],"12":["8.2"],"13":["8.2"],"16":["36.17"],"18":["17.1","36.17"],"20":["36.17"],"25":["17.20"],"60":["34.1"],"70":["34.1","34.2"],"100":["17.19"],"123":["10.3","19.36"],"222":["33.11","33.12"],"502":["9.15"],"503":["9.15"],"504":["9.15"],"505":["9.15"],"transform":["1.1"],"translate":["1.1"],"auto":["1.2","2.7"],"scroll":["1.2"],"指定了对应元素在主轴上的大小":["1.4"],"空间大小都一致":["1.5"],"才均分":["1.6"],"表现形式为最小内容宽度":["1.7"],"内容本身的宽度是多少就是多少":["1.8"],"类似":["1.10"],"但实际浏览器只是跳过了内容的渲染":["1.10"],"还保留着内容的渲染状态":["1.10"],"性能上有优势":["1.10"],"不过元素实际不在视窗内所以无法交互":["1.11"],"此方法对行内元素无效":["1.11"],"也算是一种隐藏方式":["1.12"],"5em就表示字体大小是父元素的一半为40px":["1.13"],"1vh":["1.14"],"就等于可视窗口高度的百分之一":["1.14"],"content属性定义了多根轴线的对齐方式":["1.15"],"如果项目只有一根轴线":["1.15"],"该属性不起作用":["1.15"],"从而达到我们布局的目的":["1.16"],"nowrap":["1.17"],"重绘过程":["1.18"],"浏览器需要为整个层进行重绘并重新上传到":["1.18"],"造成了极大的性能开销":["1.18"],"元素固定的相对偏移是相对于离它最近的具有滚动框的祖先元素":["1.19"],"如果祖先元素都不可以滚动":["1.19"],"那么是相对于viewport来计算元素的偏移量":["1.19"],"所以两个item中间的间距会比较大":["1.20"],"或当动画有一个延迟未开始播放时":["1.21"],"要应用到元素的样式":["1.21"],"play":["1.21"],"state":["1.21"],"指定动画是否正在运行或已暂停":["1.21"],"属性":["2.1","6.17","10.79"],"伪元素清浮动":["2.2"],"现在主流方法":["2.2"],"推荐使用":["2.2"],"或者滚动":["2.4"],"照片使用":["2.5"],"jpeg":["2.5"],"keyframes":["2.6"],"animation":["2.6"],"多列布局":["2.6"],"媒体查询":["2.6"],"网格布局":["2.7"],"grid":["2.7"],"利用grid布局的方式":["2.7"],"中间一栏设置为auto":["2.7"],"这种实现方式代码也非常简洁":["2.7"],"核心代码":["2.7"],"左右两栏固定宽度":["2.7"],"中间自适应宽度":["2.7"],"template":["2.7"],"columns":["2.7"],"var没有块级作用域":["3.6"],"let和const有块级作用域":["3.6"],"函数属于的是函数作用域而不是块级作用域":["3.7"],"对象的话":["3.7"],"又不能在里面let":["3.7"],"扩展运算符":["3.9"],"接受的时候只接一个":["3.12"],"foo":["4.0"],"undefined":["4.0"],"它会将web页面和javascript脚本连接起来":["5.1"],"压入栈底":["5.2"],"然后经过分词器解析出来的第一个":["5.2"],"会被压入到栈中":["5.2"],"并创建一个":["5.2"],"添加到":["5.2"],"上":["5.2"],"解析到相关文件之后":["5.4"],"预解析线程会提前下载这些文件":["5.4"],"然后再执行":["5.6"],"最后再继续构建dom":["5.6"],"构建渲染树":["5.6"],"绘制页面":["5.6"],"文件下载完成之前有白屏":["5.6"],"事件触发":["5.7"],"load":["5.8"],"显示到屏幕上":["5.9","6.9"],"频繁操作还是会出现页面卡顿":["5.13"],"影响用户体验":["5.13"],"再将最终的":["5.14"],"对象映射成真实的":["5.14"],"交由浏览器去绘制":["5.14"],"js":["5.17"],"中":["5.17","11.14"],"所以文档声明是必须的":["6.1"],"强调":["6.2"],"表示强调的文本":["6.2"],"可以通过display属性对行内元素和块级元素进行切换":["6.3"],"主要看第":["6.3"],"4三个值":["6.3"],"而下载的原理在于a标签所对应的资源浏览器无法解析":["6.5"],"于是浏览器会选择将其下载下来":["6.5"],"endif":["6.7"],"对可选用性产生负面影响的元素":["6.8"],"frame":["6.8"],"frameset":["6.8"],"noframes":["6.8"],"不会忽略":["6.10"],"target":["6.13"],"如果不是合成层":["6.14"],"则其依然会触发":["6.14"],"一个或多个非合成元素应出现在堆叠顺序上的合成元素之上":["6.15"],"会被提升为合成层":["6.15"],"元素的渲染等":["6.16"],"清晰地定义其内容":["6.18"],"移动设备等":["6.19"],"以有意义的方式来渲染网页":["6.19"],"以最低的成本来提高你网站的排名":["7.1"],"查看是否有非法信息":["7.5"],"服务器速度":["7.5"],"推广":["7.5"],"图片添加有意义的alt属性":["8.2"],"在form表单中增加label":["8.2"],"以增加用户友好度":["8.2"],"代码维护简单":["8.3"],"便于改版":["8.3"],"通过session会话保存":["9.2"],"所以被称为tcp":["9.3"],"ip协议":["9.3"],"比":["9.4"],"协议安全":["9.4"],"中预留给能够将连接改为通道方式的代理服务器":["9.8"],"通常用于":["9.8"],"ssl":["9.8"],"加密服务器的链接":["9.8"],"经由非加密的":["9.8"],"代理服务器":["9.8"],"浏览器再发送data":["9.9"],"ok":["9.9","17.23"],"更稳定也更可靠":["9.10"],"since配合":["9.11"],"用于缓存控制":["9.11"],"cache":["9.11"],"control":["9.11"],"取值一般为no":["9.11"],"max":["9.11"],"age":["9.11"],"xx":["9.11"],"xx为整数":["9.11"],"表示资源缓存有效期":["9.11"],"秒":["9.11"],"属性记录的就是该请求体的长度":["9.12"],"服务器端错误":["9.14"],"服务器未能实现合法的请求":["9.14"],"服务器不具备完成请求的功能":["9.15"],"例如":["9.15"],"服务器无法识别请求方法时可能会返回此代码":["9.15"],"错误网关":["9.15"],"服务器作为网关或代理":["9.15"],"从上游服务器收到无效响应":["9.15"],"服务不可用":["9.15"],"服务器目前无法使用":["9.15"],"由于超载或停机维护":["9.15"],"这只是暂时状态":["9.15"],"网关超时":["9.15"],"但是没有及时从上游服务器收到请求":["9.15"],"http":["9.15"],"版本不受支持":["9.15"],"服务器不支持请求中所用的":["9.15"],"协议版本":["9.15"],"渲染页面":["9.17"],"检查缓存":["9.18"],"缓存":["9.19"],"以太网协议":["9.20"],"发送能力正常":["9.25"],"服务器自己的发送":["9.25"],"接收能力也正常":["9.25"],"报文之后":["9.26"],"就处于关闭连接了":["9.26"],"处于closed状态":["9.26"],"array":["10.1","11.30"],"用于表示不是一个数字":["10.3"],"它不等于任何值":["10.3"],"包括它本身":["10.3"],"在":["10.3"],"之前":["10.3"],"windows":["10.3"],"对象提供了一个全局方法":["10.3"],"用于判断一个数字是不是":["10.3"],"对于字符串的检测结果也是":["10.3"],"但这其实并不严谨":["10.3"],"它对要判断的数据做了一个隐式类型转换":["10.3"],"先转为数字再进行判断":["10.3"],"而nan":["10.3"],"的检测应该仅限于数字类型":["10.3"],"所以":["10.3"],"提供了":["10.3"],"方法":["10.3","32.4"],"它能判断一个值是否严格等于nan":["10.3"],"而每一个宏任务都有一个自己的微任务队列":["10.11"],"每轮循环都是由一个宏任务":["10.11"],"多个微任务组成":["10.11"],"process":["10.12"],"nexttick等":["10.12"],"在下一轮事件循环中也能得到同步":["10.13"],"小于4ms执行setimmediate的回调":["10.14"],"造成程序崩溃":["10.18"],"就像地址一样的两个不同的个体":["10.19"],"泄露的本在在于程序是否能控制":["10.22"],"一直到全局作用域":["10.23"],"nan":["10.24"],"call":["10.27","11.30"],"arr":["10.27"],"false":["10.32","10.49","10.58","17.23","19.37"],"用得到的基本类型值按照前面的规则进行比较":["10.36"],"不推荐":["10.40"],"load触发":["10.47"],"true":["10.48","10.76","10.77","11.12","17.16","30.5","33.4","33.7"],"console":["10.52","11.13","33.11","33.12","34.1","34.2","36.12","36.13","36.29"],"log":["10.52","11.13","28.4","31.1","33.11","33.12","34.1","34.2","36.1","36.2","36.3","36.10","36.12","36.13","36.20","36.26","36.28","36.29","36.31","38.4"],"foreach":["10.59","20.22"],"遍历字典的所有成员":["10.59"],"return":["10.60","10.61","17.30","29.5","30.1"],"bind":["10.65"],"接收上一个return和数组的下一项":["10.66"],"flat":["10.66"],"数组扁平化":["10.66"],"slice":["10.66"],"取0":["10.67"],"num的随机数":["10.67"],"ss":["10.71"],"sssz":["10.71"],"origin":["10.73"],"获取当前域名":["10.73"],"navigator":["10.73"],"获取当前浏览器信息":["10.73"],"对象":["10.74"],"浏览器提供出来给予访问的是bom对象":["10.74"],"从bom对象再访问到dom对象":["10.74"],"从而js可以操作浏览器以及浏览器读取到的文档":["10.74"],"目标对象":["11.3"],"接收源对象属性的对象":["11.3"],"也是修改后的返回值":["11.3"],"sources":["11.3"],"源对象":["11.3"],"包含将被合并的属性":["11.3"],"expected":["11.6","11.12","11.31"],"output":["11.6","11.12","11.31"],"返回和传入的参数相同的对象":["11.9"],"clark":["11.13"],"kent":["11.13"],"的原型链是针对":["11.14"],"进行检查的":["11.14"],"而不是针对":["11.14"],"本身":["11.14"],"undeclaredpropertyvalue":["11.19"],"都是同一个值":["11.21"],"非零且都不是":["11.21"],"argument":["11.26"],"will":["11.26"],"be":["11.26"],"coerced":["11.26"],"f":["11.26"],"o":["11.26"],"catche函数":["12.0"],"是用来处理异常":["12.1"],"reject后的东西":["12.1"],"一定会进入then中的第二个回调":["12.1"],"如果then中没有写第二个回调":["12.1"],"则进入catch":["12.1"],"网络异常":["12.1"],"比如断网":["12.1"],"会直接进入catch而不会进入then的第二个回调":["12.1"],"当我调用reject之后":["12.2"],"在调用resolve是无效的":["12.2"],"因为状态已经发生改变":["12.2"],"并且是不可逆的":["12.2"],"返回一个普通值":["12.5"],"状态":["12.5"],"fulfilled":["12.5"],"明确返回一个promise":["12.5"],"返回一个thenable对象":["12.5"],"返回值是promise":["12.6"],"那它的状态如何决定":["12.6"],"如果返回值明确一个promise或者thenable对象":["12.6"],"取决于你调用了resolve还是reject":["12.6"],"promise处理错误的方式有两种":["12.8"],"第一种在then中传递两个回调":["12.8"],"第二个回调是错误回调":["12.8"],"状态改变只有两种结果":["12.8"],"完成或者失败":["12.8"],"number2":["13.2"],"cjs":["14.1"],"这两种模块不兼容":["14.1"],"最底层的模块第一个执行":["14.2"],"json文件中":["14.3"],"指定type字段为module":["14.3"],"模块内部可以使用顶层await命令":["14.4"],"导致无法被同步加载":["14.4"],"js文件的加载取决于package":["14.5"],"json里面type字段的设置":["14.5"],"就向客户端返回请求的数据":["15.8"],"服务端验证token":["15.8"],"会有csrf攻击":["15.9"],"this指向":["16.0"],"html语义化":["16.0"],"callapplybind":["16.0"],"箭头函数":["16.0"],"数组去重":["16.0"],"ljt":["17.1"],"tostring":["17.4","35.1"],"typescript":["17.7"],"在这里是":["17.8"],"除了never本身没有人可以给他赋值":["17.8"],"const":["17.8","33.11","33.12"],"check":["17.8"],"类型断言":["17.10"],"as":["17.10"],"除外":["17.11"],"和非原始类型":["17.11"],"而小":["17.11"],"则表示非原始类型":["17.11"],"编译器就会知道该属性会被明确地赋值":["17.15"],"boolean":["17.17"],"进行描述":["17.18"],"然后将这个myobj再赋值给labeledobj":["17.21"],"此时根据类型的兼容性":["17.21"],"两种类型对象":["17.21"],"参照鸭式辨型法":["17.21"],"因为都具有label属性":["17.21"],"所以被认定为两个相同":["17.21"],"故而可以用此法来绕开多余的类型检查":["17.21"],"给基本类型起别名通常没什么用":["17.24"],"尽管可以做为文档的一种形式使用":["17.24"],"b":["17.26","34.1","34.2","35.2"],"typeof":["17.26"],"e":["17.29"],"element":["17.29"],"表示元素类型":["17.29"],"ts泛型":["17.29"],"从某个类型中挑出一些属性出来":["17.32"],"record":["17.32"],"的作用是将":["17.32"],"中所有的属性的值转化为":["17.32"],"类型":["17.32"],"告诉nginx如果按顺序检查文件是否存在":["18.2"],"若不存在则重定向到index":["18.2"],"html文件":["18.2"],"事件":["18.4"],"html":["18.5"],"相同的页面":["18.5"],"漂亮依旧":["18.5"],"this":["18.7","19.17"],"beforerouteleave":["18.7"],"在离开当前组件时调用":["18.7"],"与":["18.7"],"一样":["18.7"],"它可以访问组件实例":["18.7"],"导航确认":["18.8"],"dom更新":["18.8"],"users":["18.11"],"id":["18.11"],"在数据获取成功后执行导航":["18.13"],"onunmounted":["19.2"],"组件销毁完成调用":["19.2"],"父destroyed":["19.3"],"销毁":["19.3"],"if会先执行此时还没有拿到这个数组":["19.6"],"所以vue3中依然不建议这样使用":["19.6"],"watch默认只监听一层数据":["19.7"],"不监听多层数据里属性的变化":["19.7"],"需要设置deep":["19.7"],"true才会进行深度监听":["19.7"],"其他情况能用计算属性就首选计算属性":["19.9"],"是懒执行":["19.12"],"也就是说第一次初始化之后":["19.12"],"便不会执行计算":["19.12"],"下一次变更执行重新计算是在":["19.12"],"在响应数据初始化时就会立即执行回调函数":["19.14"],"内置组件":["19.15"],"vue3新增了传送组件teleport和异步依赖处理组件suspense":["19.15"],"am":["19.17"],"years":["19.17"],"old":["19.17"],"year":["19.17"],"mitt":["19.18"],"除了上面的传参方式你也可以回答vuex和pinia":["19.18"],"前提你了解这两个状态管理器":["19.18"],"因为你说了大概率下个问题就会问你vuex和pinia":["19.18"],"我们可以在actions中进行数据请求":["19.19"],"拿到结果通过它的dispatch方法调用mutations中修改state的函数":["19.19"],"从而将结果赋值给了state":["19.19"],"patchmethod":["19.20"],"或者在actions中修改":["19.21"],"或者使用它的":["19.21"],"patch方法进行修改":["19.21"],"pinia中没有了modules":["19.21"],"如果想使用多个store":["19.21"],"直接使用definestore定义多个store传入不同的id即可":["19.21"],"更好的ts支持":["19.21"],"不需要创建自定义的复杂包装器来支持ts":["19.21"],"此时组件被激活":["19.23"],"deactivated钩子则是在组件从dom上移除或者组件卸载时调用":["19.23"],"此时组件被缓存":["19.23"],"beforeupdate":["19.24"],"不好追溯源":["19.26"],"后期排查不方便":["19.26"],"proxy不兼容ie11及以下":["19.27"],"video将会被传送到id为popup的元素下":["19.29"],"fallback插槽内容":["19.30"],"使nexttick里的回调函数在最后调用立刻触发dom更新":["19.32"],"算法最重要的就是找到可复用的节点":["19.35"],"然后移动到正确的位置":["19.35"],"只不过不同的算法查找顺序不一样":["19.35"],"调用观察者的更新方法":["20.2"],"hr":["20.3","20.15"],"br":["20.3","20.15"],"vue2":["20.3"],"表达式解析":["20.4"],"function":["20.4"],"path":["20.4"],"segments":["20.4"],"split":["20.4"],"for":["20.4","20.13"],"let":["20.4","20.13"],"i":["20.4"],"length":["20.4","33.2"],"执行更新":["20.5"],"watcher主要是用于更新":["20.5"],"而且是收集的重点对象":["20.5"],"obj":["20.8"],"a":["20.8","34.1","34.2","36.15","40.1","42.1"],"observe将一个正常的object转换为每个层级的属性都是响应式的":["20.9"],"observer中通过definereactive方法进行响应式的绑定":["20.9"],"在数据被读的时候":["20.9"],"触发getter方法":["20.9"],"执行dep来收集依赖":["20.9"],"也就是收集watcher":["20.9"],"在数据被改的时候":["20.9"],"触发setter方法":["20.9"],"触发依赖":["20.9"],"通过对应的所有依赖":["20.9"],"watcher":["20.9","20.24"],"去执行更新":["20.9"],"比如watch和computed就执行开发者自定义的回调方法":["20.9"],"通知组件":["20.11"],"通过虚拟dom和diff算法进行页面更新":["20.11"],"key":["20.13"],"of":["20.13"],"if":["20.13"],"update":["20.14"],"sub":["20.14"],"push":["20.14"],"所以触发getter方法":["20.15"],"在getter中就能得到当前正在读取数据的watcher":["20.15"],"并把这个watcher收到dep中":["20.15"],"vue3":["20.15"],"拦截对原对象的所有操作":["20.16"],"用户可以通过注册相应的拦截方法来实现对象操作时的自定义行为":["20.16"],"声明的对象修改原对象无法触发视图更新的原因":["20.17"],"并且":["20.17"],"也只针对":["20.17"],"引用类型数据":["20.17"],"才能进行代理":["20.17"],"所以这也是":["20.17"],"的基础数据都需要通过":["20.17"],"ref":["20.17"],"进行声明的原因":["20.17"],"内部会建立一个新对象保存原有的基础数据值":["20.17"],"coutner":["20.18"],"找到对应的":["20.18"],"副作用函数":["20.18","20.21"],"然后重新执行":["20.18"],"trigger":["20.19"],"依赖更新":["20.19"],"注意":["20.21"],"当我们调用":["20.21"],"时":["20.21"],"会将当前的副作用函数赋值给全局的":["20.21"],"所以此时我们可以正确的关联其依赖":["20.21"],"effect":["20.22","20.29"],"函数的执行来实现视图更新的":["20.24"],"deepreadonly":["20.25"],"操作的拦截两者的大体思路差不多":["20.26"],"不过":["20.26"],"因为只读的原因":["20.26"],"数据不会发生改变":["20.26"],"所以不会进行依赖收集操作":["20.26"],"如果有深层数据则会继续向内部进行同样的处理操作":["20.26"],"null":["20.27"],"add":["20.28"],"new":["20.32"],"proxy":["20.32"],"set":["20.34"],"你用自定义指令做过哪些功能":["21.0"],"不使用":["21.2"],"backgroundcolor":["21.3"],"bordercolor":["21.3"],"handleclick":["21.3"],"点击":["21.3"],"引入完成之后就可以在组件中使用v":["21.6"],"debounce":["21.6"],"unmounted":["22.0","26.0"],"computed":["25.0"],"result":["25.0"],"concat":["29.5"],"prime":["30.2"],"getprime":["30.2"],"resize":["30.2"],"put":["30.7"],"二叉树":["32.1"],"从树中移除某个键":["32.3"],"right":["32.4"],"先序遍历其左子树":["32.7"],"先序遍历其右子树":["32.7"],"递归图解":["32.7","32.8","32.9"],"先序遍历递归图解":["32.7"],"访问根结点":["32.8","32.9"],"中序遍历其右子树":["32.8"],"中序遍历递归图解":["32.8"],"后序遍历其右子树":["32.9"],"后序遍历递归图解":["32.9"],"依次向下找到节点":["32.12"],"同时记录current":["32.12"],"isleftchild这些变量":["32.12"],"如果遍历到current":["32.12"],"那么说明在二叉搜索树中没有该key":["32.12"],"直接返回false即可":["32.12"],"如果找到":["32.12"],"后面就需要我们进一步考虑更加复杂的情况了":["32.12"],"20这个左子树怎么办":["32.15"],"很明显":["32.15"],"19应该放在20的左边":["32.15"],"20应该放在18的右边":["32.15"],"19放在20的左边代码":["32.15"],"20放在18的右边代码":["32.15"],"图解删除":["32.15"],"data":["33.5","33.8"],"next":["33.6"],"remove":["33.9"],"links":["33.11","33.12"],"links2":["33.11","33.12"],"linkget":["33.11","33.12"],"c":["34.1","35.2"],"d":["35.2"],"infinity":["36.11","37.6","37.7"],"r":["36.15"],"arr3":["37.5","37.6"],"流光按钮":["39.2"],"dianhua":["40.1"],"电话":["40.1"],"pinglun":["40.1"],"评论":["40.1","40.8"],"licon":["40.1","42.2"],"name":["40.1"],"xiala2":["40.1","42.1"],"jinru":["40.1","42.1","42.2","42.3"],"按钮":["40.2"],"guanbi":["42.1"],"fenxiang2":["42.1"],"center":["43.2"],"td元素里面所有非block元素":["43.2"],"都会相对于td水平居中":["43.2"],"虽然block元素不居中":["43.2"],"但其中的文字或inline元素会水平居中":["43.2"],"undefinded":["43.4"],"第二个catch无结果":["43.9"],"以":["43.10"],"这种形式调用对象的键名时":["43.10"],"里面的键b一定要有引号":["43.10"],"必须为字符串或者是symbol":["43.10"],"如果不是字符串则转为字符串":["43.10"]}]'},e={"1.0":{t:"# CSS\r",p:"\r",l:"audition/css/css上篇.html",a:"css"},"1.1":{t:"1. 常见的水平垂直居中实现方案\r",p:`
最简单的方案当然是flex布局

.father {
    display: flex;
    justify-content: center;
    align-items: center; ...`,l:"audition/css/css上篇.html#_1-常见的水平垂直居中实现方案",a:"_1-常见的水平垂直居中实现方案"},"1.2":{t:"2. BFC问题，触发BFC的元素\r",p:`BFC：块级格式化上下文,属于普通流，是一块独立的渲染区域，内部元素不会影响外部的元素。
如何触发？

根元素
float属性不是none position为absolute或者fixed
displ ...`,l:"audition/css/css上篇.html#_2-bfc问题-触发bfc的元素",a:"_2-bfc问题-触发bfc的元素"},"1.3":{t:" ",p:"",l:"audition/css/css上篇.html#",a:""},"1.4":{t:"3. felx是哪些属性的缩写，对应的属性代表什么含义\r",p:`flex在浏览器中查看分别是

flex-grow（设置了对应元素的增长系数）
flex-shrink(指定了对应元素的收缩规则，只有在所有元素的默认宽度之和大于容器宽度时才会触发)
flex-bas ...`,l:"audition/css/css上篇.html#_3-felx是哪些属性的缩写-对应的属性代表什么含义",a:"_3-felx是哪些属性的缩写-对应的属性代表什么含义"},"1.5":{t:"flex:1\r",p:`
flex: 1, 对应的是1 1 0%, 相当于可扩大，可缩小，flex-basis为0%
不管内容多少，一般都是平分空间，空间大小都一致

`,l:"audition/css/css上篇.html#flex-1",a:"flex-1"},"1.6":{t:"flex:auto\r",p:`
flex: auto, 对应的是1 1 auto, 相当于可扩大，可缩小，flex-basis为auto
flex: auto是根据内容的大小来分，不是均分的（除非内容都是一样，才均分）

`,l:"audition/css/css上篇.html#flex-auto",a:"flex-auto"},"1.7":{t:"flex: 0\r",p:`
flex: 0, 对应的是0 1 0%, 相当于不可扩大，可缩小，flex-basis为0%
不可扩大，可缩小,表现形式为最小内容宽度

`,l:"audition/css/css上篇.html#flex-0",a:"flex-0"},"1.8":{t:"flex: none\r",p:`
flex: none, 对应的是0 0 auto, 相当于不可扩大，不可缩小，flex-basis为auto
不可扩大，不可缩小，内容本身的宽度是多少就是多少

`,l:"audition/css/css上篇.html#flex-none",a:"flex-none"},"1.9":{t:"4. 隐藏元素的属性有哪些\r",p:"",l:"audition/css/css上篇.html#_4-隐藏元素的属性有哪些",a:"_4-隐藏元素的属性有哪些"},"1.10":{t:"1. 常规方法\r",p:`
display: none;（结构消失；会触发回流重绘性能消耗较大；非继承属性，子孙节点消失由于元素从渲染树消失造成，通过修改子孙节点属性无法显示）
visibility: hidden;（结构保留 ...`,l:"audition/css/css上篇.html#_1-常规方法",a:"_1-常规方法"},"1.11":{t:"2. 逃逸视窗\r",p:`
position + left/top（利用绝对定位 position 设置 absolute 或 fixed，同时 left 或 top 设置 -9999px；
超大负边距会将元素抛出视图，因为定 ...`,l:"audition/css/css上篇.html#_2-逃逸视窗",a:"_2-逃逸视窗"},"1.12":{t:"3. 移行变换\r",p:`
scale(0) / skew(90deg)（通过2D变换来达到隐藏，占据空间，不可交互。注意：此方法对行内元素无效！）
circle(0px)（利用裁剪创建元素的可显示区域，区域外会隐藏，占据空间 ...`,l:"audition/css/css上篇.html#_3-移行变换",a:"_3-移行变换"},"1.13":{t:"5. px 和 em 的区别\r",p:`
px全称pixel像素，是相对于屏幕分辨率而言的，它是一个绝对单位
em是一个相对长度单位，具体的大小需要相对于父元素计算，比如父元素的字体大小为80px，那么子元素1em就表示大小和父元素一样为8 ...`,l:"audition/css/css上篇.html#_5-px-和-em-的区别",a:"_5-px-和-em-的区别"},"1.14":{t:"6. vw、vh 是什么？\r",p:`vw 和 vh 是 CSS3 新单位，即 view width 可视窗口宽度 和 view height 可视窗口高度。1vw 就等于可视窗口宽度的百分之一，1vh 就等于可视窗口高度的百分之一。
`,l:"audition/css/css上篇.html#_6-vw、vh-是什么",a:"_6-vw、vh-是什么"},"1.15":{t:"7. flex 布局如何使用\r",p:`flex 是 Flexible Box 的缩写，意为&quot;弹性布局&quot;。指定容器display: flex即可。
容器有以下属性：flex-direction，flex-wrap，fle ...`,l:"audition/css/css上篇.html#_7-flex-布局如何使用",a:"_7-flex-布局如何使用"},"1.16":{t:"8. grid布局\r",p:"那就是 flex 布局是一维布局，Grid 布局是二维布局。flex 布局一次只能处理一个维度上的元素布局，一行或者一列。Grid 布局是将容器划分成了“行”和“列”，产生了一个个的网格，我们可以将网 ...",l:"audition/css/css上篇.html#_8-grid布局",a:"_8-grid布局"},"1.17":{t:"8. 如何用 css 或 js 实现多行文本溢出省略效果，考虑兼容性\r",p:`overflow: hidden;
text-overflow:ellipsis;
white-space: nowrap;

`,l:"audition/css/css上篇.html#_8-如何用-css-或-js-实现多行文本溢出省略效果-考虑兼容性",a:"_8-如何用-css-或-js-实现多行文本溢出省略效果-考虑兼容性"},"1.18":{t:"9. 居中为什么要使用 transform（为什么不使用 marginLeft/Top）\r",p:`
transform 属于合成属性（composite property），对合成属性进行 transition/animation 动画将会创建一个合成层（composite layer），这使得被 ...`,l:"audition/css/css上篇.html#_9-居中为什么要使用-transform-为什么不使用-marginleft-top",a:"_9-居中为什么要使用-transform-为什么不使用-marginleft-top"},"1.19":{t:"10. 介绍下粘性布局(sticky)\r",p:"position 中的 sticky 值是 CSS3 新增的，设置了 sticky 值后，在屏幕范围（viewport）时该元素的位置并不受到定位影响（设置是top、left等属性无效），当该元素的位 ...",l:"audition/css/css上篇.html#_10-介绍下粘性布局-sticky",a:"_10-介绍下粘性布局-sticky"},"1.20":{t:"11. 说出 space-between 和 space-around 的区别\r",p:"这个是 flex 布局的内容，其实就是一个边距的区别，按水平布局来说，space-between是两端对齐，在左右两侧没有边距，而space-around是每个子项目左右方向的 margin 相等，所 ...",l:"audition/css/css上篇.html#_11-说出-space-between-和-space-around-的区别",a:"_11-说出-space-between-和-space-around-的区别"},"1.21":{t:"12. CSS3 中 transition 和 animation 的属性分别有哪些\r",p:`transition 过渡动画：

transition-property：指定过渡的 CSS 属性
transition-duration：指定过渡所需的完成时间
transition-timing ...`,l:"audition/css/css上篇.html#_12-css3-中-transition-和-animation-的属性分别有哪些",a:"_12-css3-中-transition-和-animation-的属性分别有哪些"},"1.22":{t:"clip-path\r",p:`clip-path 属性使用裁剪方式创建元素的可显示区域。区域内的部分显示，区域外的隐藏。可以指定一些特定形状。
裁剪一张图像，以圆形的方式显示 50%：
img {
  clip-path: cir ...`,l:"audition/css/css上篇.html#clip-path",a:"clip-path"},"2.0":{t:"13. 如何用 CSS 实现一个三角形\r",p:`利用盒模型的 border 属性上下左右边框交界处会呈现出平滑的斜线这个特点，通过设置不同的上下左右边框宽度或者颜色即可得到三角形或者梯形。
`,l:"audition/css/css下篇.html",a:"_13-如何用-css-实现一个三角形"},"2.1":{t:"14. 如何实现一个自适应的正方形\r",p:`
利用 CSS3 的 vw 单位，vw 会把视口的宽度平均分为 100 份
利用 margin 或者 padding 的百分比计算是参照父元素的 width 属性

`,l:"audition/css/css下篇.html#_14-如何实现一个自适应的正方形",a:"_14-如何实现一个自适应的正方形"},"2.2":{t:"15. 清除浮动的方法\r",p:`
clear 清除浮动（添加空div法）在浮动元素下方添加空div，并给该元素写css样式： {clear:both;height:0;overflow:hidden;}
给浮动元素父级设置高度
父级 ...`,l:"audition/css/css下篇.html#_15-清除浮动的方法",a:"_15-清除浮动的方法"},"2.3":{t:"16. 两种盒模型以及区别\r",p:`W3C盒模型和IE盒模型，主要区别是二者的盒子宽高是否包括元素的边框和内边距。IE盒模型中内容的宽或高将会包含内边距和边框，而W3C盒模型并不会。
`,l:"audition/css/css下篇.html#_16-两种盒模型以及区别",a:"_16-两种盒模型以及区别"},"2.4":{t:"17. 如何触发重排和重绘，重绘)？\r",p:`
添加、删除、更新DOM节点
通过display: none隐藏一个DOM节点-触发重排和重绘
通过visibility: hidden隐藏一个DOM节点-只触发重绘，因为没有几何变化
移动或者给页面 ...`,l:"audition/css/css下篇.html#_17-如何触发重排和重绘-重绘",a:"_17-如何触发重排和重绘-重绘"},"2.5":{t:"18. 如何优化图片\r",p:`
对于很多装饰类图片，尽量不用图片，因为这类修饰图片完全可以用 CSS 去代替。
将多个图标文件整合到一张图片中（雪碧图）
WebP 格式的浏览器尽量使用 WebP 格式，因为 WebP 格式具有更好 ...`,l:"audition/css/css下篇.html#_18-如何优化图片",a:"_18-如何优化图片"},"2.6":{t:"19. CSS3 新增了那些东西？\r",p:`
选择器
盒子模型属性：border-radius、box-shadow、border-image
背景：background-size、background-origin、background-cl ...`,l:"audition/css/css下篇.html#_19-css3-新增了那些东西",a:"_19-css3-新增了那些东西"},"2.7":{t:"20. 实现三栏布局的7种方法\r",p:`
浮动float + calc()

div {
    height: 100px;
}
.left {
    float: left;
    width: 200px;
    backgro ...`,l:"audition/css/css下篇.html#_20-实现三栏布局的7种方法",a:"_20-实现三栏布局的7种方法"},"3.0":{t:"# ES6\r",p:"\r",l:"audition/es6/ES6.html",a:"es6"},"3.1":{t:"1. 什么是ES6模块化？\r",p:`ES6 模块化规范是浏览器端与服务器端通用的模块化开发规范。
`,l:"audition/es6/ES6.html#_1-什么是es6模块化",a:"_1-什么是es6模块化"},"3.2":{t:"定义：\r",p:`
每个 js 文件都是一个独立的模块
导入其它模块成员使用 import关键字
向外共享模块成员使用 export关键字

`,l:"audition/es6/ES6.html#定义",a:"定义"},"3.3":{t:"用法：\r",p:`
默认导出与默认导入
按需导出与按需导入
直接导入并执行模块中的代码

`,l:"audition/es6/ES6.html#用法",a:"用法"},"3.4":{t:"默认导出与默认导入注意点：\r",p:`
每个模块中，只允许使用唯一的一次export default，否则会报错
默认导入时的接收名称可以任意名称，只要是合法的成员名称即可

`,l:"audition/es6/ES6.html#默认导出与默认导入注意点",a:"默认导出与默认导入注意点"},"3.5":{t:"按需导入与按需导出注意点：\r",p:`
每个模块中可以使用多次按需导出
按需导入的成员名称必须和按需导出的名称保持一致
按需导入时，可以使用 as 关键字进行重命名
按需导入可以和默认导入一起使用

ES6新增
`,l:"audition/es6/ES6.html#按需导入与按需导出注意点",a:"按需导入与按需导出注意点"},"3.6":{t:"2. 新增了let const关键字\r",p:`
var允许重复声明，let、const不允许
var会提升变量的声明到作用域的顶部，但let和const不会
只要作用域内存在let、const，它们所声明的变量或常量就会自动“绑定”这个区域，不再 ...`,l:"audition/es6/ES6.html#_2-新增了let-const关键字",a:"_2-新增了let-const关键字"},"3.7":{t:"3. 作用域\r",p:`常见的作用域主要分为几个类型：全局作用域、函数作用域、块状作用域、动态作用域



对象
类型




global/window
全局作用域


function
函数作用域（局部作用域）


{} ...`,l:"audition/es6/ES6.html#_3-作用域",a:"_3-作用域"},"3.8":{t:"4. 新增的解构赋值\r",p:`解构赋值针对数组或者对象进行模式匹配，然后对其中的变量进行赋值。
let [a,b] = [1,2]
let {user} = obj

`,l:"audition/es6/ES6.html#_4-新增的解构赋值",a:"_4-新增的解构赋值"},"3.9":{t:"5. 新增了箭头函数\r",p:`箭头函数和普通函数的区别

普通函数存在着变量的提升，箭头函数没有
普通函数的this指向，谁调用指向谁，箭头函数是在哪定义就指向谁
普通函数可以当成构造函数，而箭头函数是不可以的
箭头函数没有arg ...`,l:"audition/es6/ES6.html#_5-新增了箭头函数",a:"_5-新增了箭头函数"},"3.10":{t:"6. js新增简单数据类型Symbol\r",p:`symbol
`,l:"audition/es6/ES6.html#_6-js新增简单数据类型symbol",a:"_6-js新增简单数据类型symbol"},"3.11":{t:"7. 新增了class关键字\r",p:`class关键字是es5构造函数+原型模式创建对象的语法糖。创建类的方式 class 类名{构造函数和方法} 通过extends关键字实现继承。
`,l:"audition/es6/ES6.html#_7-新增了class关键字",a:"_7-新增了class关键字"},"3.12":{t:"8. es6新增了模块化\r",p:`与node.js的commonjs不同,es6新增esmoudule
根据功能封装模块 通过import导入 然后通过export导出，也可以使用export default导出

export 可以 ...`,l:"audition/es6/ES6.html#_8-es6新增了模块化",a:"_8-es6新增了模块化"},"3.13":{t:"9. 新增promise\r",p:`promise
`,l:"audition/es6/ES6.html#_9-新增promise",a:"_9-新增promise"},"4.0":{t:"js新增简单数据类型Symbol\r",p:`新增简单数据类型Symbol，用于表示一个独一无二的值。
const a = Symbol(); //Symbol创建实例不需要new
console.log(a);  //Symbol()

不能在 ...`,l:"audition/es6/symbol.html",a:"js新增简单数据类型symbol"},"5.0":{t:"# DOM\r",p:"\r",l:"audition/html/DOM.html",a:"dom"},"5.1":{t:"什么是DOM，文档对象模型\r",p:`从网络传给渲染引擎的 HTML 文件字节流是无法直接被渲染引擎理解的，所以要将其转化 为渲染引擎能够理解的内部结构，这个结构就是 DOM。DOM 提供了对 HTML 文档结构 化的表述。
!dom树
 ...`,l:"audition/html/DOM.html#什么是dom-文档对象模型",a:"什么是dom-文档对象模型"},"5.2":{t:"DOM 树如何生成\r",p:"渲染引擎内部，有一个叫HTML 解析器（HTMLParser）的模块，它的职责就是负责将HTML 字节流转换为 DOM 结构。HTML 解析器并不是等整个文档加载完成之后再解析的，而是网络进程加载了多 ...",l:"audition/html/DOM.html#dom-树如何生成",a:"dom-树如何生成"},"5.3":{t:"JavaScript和css会不会影响DOM树构建和渲染\r",p:`
CSS不会阻塞DOM树的解析，但是会影响 JavaScript的运行
JavaScript 会阻止DOM树的解析
最终CSS（CSSOM）会影响DOM树的渲染，也可以说最终会影响渲染树的生成

`,l:"audition/html/DOM.html#javascript和css会不会影响dom树构建和渲染",a:"javascript和css会不会影响dom树构建和渲染"},"5.4":{t:"JavaScript对DOM树构建和渲染的影响\r",p:`
执行到 JavaScript 标签时，暂停整个 DOM 的解析，执行 JavaScript 代码，如果要下载JavaScript代码，下载过程会阻塞DOM 解析
Chrome 浏览器预解析操作，当渲 ...`,l:"audition/html/DOM.html#javascript对dom树构建和渲染的影响",a:"javascript对dom树构建和渲染的影响"},"5.5":{t:"规避JavaScript线程阻塞DOM现象\r",p:`JavaScript 脚本设置为异步加载，通过 async 或 defer 来标记代码
`,l:"audition/html/DOM.html#规避javascript线程阻塞dom现象",a:"规避javascript线程阻塞dom现象"},"5.6":{t:"CSS对DOM树构建和渲染的影响\r",p:"DOM 的过程中，如果遇到了 JavaScript 脚本，那么需要先暂停 DOM 解析去执行 JavaScript，因为 JavaScript 有可能会修改当前状态下的 DOM。不过在执行 JavaS ...",l:"audition/html/DOM.html#css对dom树构建和渲染的影响",a:"css对dom树构建和渲染的影响"},"5.7":{t:"DOMContentLoaded\r",p:`
文档解析完毕，当页面引用的所有 js 同步代码执行完毕，DOM树构建完成，触发 DOMContentLoaded 事件。
html 文档中的图片资源，js 代码中有异步加载的 css、js 、图片资 ...`,l:"audition/html/DOM.html#domcontentloaded",a:"domcontentloaded"},"5.8":{t:"DOM文档加载的步骤为：\r",p:`
解析HTML结构。
加载外部脚本和样式表文件。
解析并执行脚本代码。
DOM树构建完成。//DOMContentLoaded
加载图片等外部文件。
页面加载完毕。//load

`,l:"audition/html/DOM.html#dom文档加载的步骤为",a:"dom文档加载的步骤为"},"5.9":{t:" 网页的渲染\r",p:`
加载js然后html和css，设置defer和acync时js和html异步加载
html转换为dom，css转换为cssom
将DOM和CSSOM合并成一棵渲染render树
对渲染树进行refl ...`,l:"audition/html/DOM.html#网页的渲染",a:"网页的渲染"},"5.10":{t:"DOM树的构建是文档加载完成开始的？ \r",p:`构建 DOM 树是一个渐进过程，为达到更好的用户体验，渲染引擎会尽快将内容显示在屏幕上，它不必等到整个 HTML 文档解析完成之后才开始构建 render 树和布局。
`,l:"audition/html/DOM.html#dom树的构建是文档加载完成开始的",a:"dom树的构建是文档加载完成开始的"},"5.11":{t:"Render 树是 DOM 树和 CSS 样式表构建完毕后才开始构建的？ \r",p:`这三个过程在实际进行的时候并不是完全独立的，而是会有交叉，会一边加载，一边解析，以及一边渲染。
`,l:"audition/html/DOM.html#render-树是-dom-树和-css-样式表构建完毕后才开始构建的",a:"render-树是-dom-树和-css-样式表构建完毕后才开始构建的"},"5.12":{t:"CSS 的解析注意点？ \r",p:`CSS 的解析是从右往左逆向解析的，嵌套标签越多，解析越慢。
`,l:"audition/html/DOM.html#css-的解析注意点",a:"css-的解析注意点"},"5.13":{t:"JS 操作真实 DOM 的代价？\r",p:"原生 JS 或 JQ 操作 DOM 时，浏览器会从构建 DOM 树开始从头到尾执行一遍流程，需要更新 10 个 DOM 节点就要从头到尾执行10遍，计算 DOM 节点坐标值等都是白白浪费的性能。即使计 ...",l:"audition/html/DOM.html#js-操作真实-dom-的代价",a:"js-操作真实-dom-的代价"},"5.14":{t:"Virtual-DOM 就是一个JS对象模拟的DOM树\r",p:`参考这篇
虚拟 DOM 就是为了解决浏览器性能问题而被设计出来的。如前，若一次操作中有 10 次更新 DOM 的动作，虚拟 DOM 不会立即操作 DOM，而是将这 10 次更新的 diff 内容保存到 ...`,l:"audition/html/DOM.html#virtual-dom-就是一个js对象模拟的dom树",a:"virtual-dom-就是一个js对象模拟的dom树"},"5.15":{t:"Virtual-DOM的实现\r",p:`
用 JS 对象模拟 DOM 树
diff算法比较两棵虚拟 DOM 树的差异
将两个虚拟 DOM 对象的差异应用到真正的 DOM 树

`,l:"audition/html/DOM.html#virtual-dom的实现",a:"virtual-dom的实现"},"5.16":{t:"vue的Virtual-DOM\r",p:"",l:"audition/html/DOM.html#vue的virtual-dom",a:"vue的virtual-dom"},"5.17":{t:"VNode 模拟 DOM 树\r",p:`利用 _createElement 方法创建 VNode，它定义在 src/core/vdom/create-elemenet.js 中
`,l:"audition/html/DOM.html#vnode-模拟-dom-树",a:"vnode-模拟-dom-树"},"6.0":{t:"# html八股文\r",p:"\r",l:"audition/html/html.html",a:"html八股文"},"6.1":{t:"1. 什么是 DOCTYPE， 有何作用？\r",p:"Doctype是HTML5的文档声明，通过它可以告诉浏览器，使用哪一个HTML版本标准解析文档。在浏览器发展的过程中，HTML出现过很多版本，不同的版本之间格式书写上略有差异。如果没有事先告诉浏览器， ...",l:"audition/html/html.html#_1-什么是-doctype-有何作用",a:"_1-什么是-doctype-有何作用"},"6.2":{t:"2. title 与 h1 的区别、b 与 strong 的区别、i 与 em 的区别？\r",p:`
title 属性表示网页的标题，h1 元素则表示层次明确的页面内容标题，对页面信息的抓取也有很大的影响
strong 是标明重点内容，有语气加强的含义，使用阅读设备阅读网络时：strong会重读，而 ...`,l:"audition/html/html.html#_2-title-与-h1-的区别、b-与-strong-的区别、i-与-em-的区别",a:"_2-title-与-h1-的区别、b-与-strong-的区别、i-与-em-的区别"},"6.3":{t:"3. 行内元素和块级元素分别有哪些？有何区别？怎样转换？\r",p:`常见的块级元素：p、div、form、ul、li、ol、table、h1、h2、h3、h4、h5、h6、dl、dt、dd
常见的行级元素：span、a、img、button、input、select
 ...`,l:"audition/html/html.html#_3-行内元素和块级元素分别有哪些-有何区别-怎样转换",a:"_3-行内元素和块级元素分别有哪些-有何区别-怎样转换"},"6.4":{t:"4. label的作用是什么？是怎么用的？\r",p:"label元素不会向用户呈现任何特殊效果，但是，它为鼠标用户改进了可用性，当我们在label元素内点击文本时就会触发此控件。也就是说，当用户选择该标签时，浏览器就会自动将焦点转到和标签相关的表单控件上 ...",l:"audition/html/html.html#_4-label的作用是什么-是怎么用的",a:"_4-label的作用是什么-是怎么用的"},"6.5":{t:"5. a元素除了用于导航外，还有什么作用？\r",p:"href属性中的url可以是浏览器支持的任何协议，所以a标签可以用来手机拨号&lt;a href=&quot;tel:110&quot;&gt;110&lt;/a&gt;，也可以用来发送短信&lt;a ...",l:"audition/html/html.html#_5-a元素除了用于导航外-还有什么作用",a:"_5-a元素除了用于导航外-还有什么作用"},"6.6":{t:"6. 你知道SEO中的TDK吗？\r",p:`在SEO中，TDK其实就是title、description、keywords这三个标签，title表示标题标签，description是描述标签，keywords是关键词标签
`,l:"audition/html/html.html#_6-你知道seo中的tdk吗",a:"_6-你知道seo中的tdk吗"},"6.7":{t:"7. 怎么处理HTML5新标签兼容问题？\r",p:`主要有两种方式：

实现标签被识别：通过document.createElement(tagName)方法可以让浏览器识别新的标签，浏览器支持新标签后。还可以为新标签添加CSS样式
用JavaScri ...`,l:"audition/html/html.html#_7-怎么处理html5新标签兼容问题",a:"_7-怎么处理html5新标签兼容问题"},"6.8":{t:"8. HTML5新增了哪些新特性？移除了哪些元素？\r",p:`HTML5主要是关于图像、位置、存储、多任务等功能的增加：

语义化标签，如：article、footer、header、nav等
视频video、音频audio
画布canvas
表单控件，cale ...`,l:"audition/html/html.html#_8-html5新增了哪些新特性-移除了哪些元素",a:"_8-html5新增了哪些新特性-移除了哪些元素"},"6.9":{t:"9. 网页的渲染\r",p:`
加载js然后html和css，设置defer和acync时js和html异步加载
html转换为dom，css转换为cssom
将DOM和CSSOM合并成一棵渲染render树
对渲染树进行refl ...`,l:"audition/html/html.html#_9-网页的渲染",a:"_9-网页的渲染"},"6.10":{t:"10. 渲染树\r",p:`
从根元素开始检查哪些元素可见，以及样式
忽略不可见的元素

display:none不占位置会忽略
visiabllity:hidden,position定位,obsity:0这三个占位置，不会忽略 ...`,l:"audition/html/html.html#_10-渲染树",a:"_10-渲染树"},"6.11":{t:"11. 重排(回流)，重绘\r",p:`
计算渲染树中的元素大小和位置
当页面中的元素的大小或位置发生变化，便会触发重排，
每次修改样式都会触发重排，重排非常耗费资源，开发尽量减少次数

`,l:"audition/html/html.html#_11-重排-回流-重绘",a:"_11-重排-回流-重绘"},"6.12":{t:"重绘\r",p:`当页面发生变化时浏览器会对页面重新绘制，不可避免
重排一定重绘，重绘不一定重排
`,l:"audition/html/html.html#重绘",a:"重绘"},"6.13":{t:"避免重排重绘\r",p:`
避免频繁使用 style，而是采用修改class的方式。
使⽤DocumentFragment
提升为合成层

合成层的位图，会交由 GPU 合成，⽐ CPU 处理要快
当需要 repaint 时， ...`,l:"audition/html/html.html#避免重排重绘",a:"避免重排重绘"},"6.14":{t:"12. 合成层\r",p:`
合成就是将页面的各个部分分成多个层，最后把它们合成为一个页面的技术
合成层拥有单独的图层，不影响其他图层，而其他不是合成层的渲染层，则和其第一个拥有图层(GraphicsLayer)的父层共用一个。 ...`,l:"audition/html/html.html#_12-合成层",a:"_12-合成层"},"6.15":{t:"触发合成层\r",p:`
设置 transform: translateZ(0)，如果使用 translateX 或 translateY，元素将会被绘制在普通文档流中 demo。
will-change 该属性告诉浏览器该 ...`,l:"audition/html/html.html#触发合成层",a:"触发合成层"},"6.16":{t:"层压缩\r",p:`
层隐式合成的例子，可能简单的重叠就会产生大量的合成层，这样会占用很多无辜的 CPU 和 内存资源，严重影响了页面的性能。这一点浏览器也考虑到了，因此就有了层压缩（Layer Squashing）的处 ...`,l:"audition/html/html.html#层压缩",a:"层压缩"},"6.17":{t:"层爆炸\r",p:`
同合成层重叠也会使元素提升为合成层，虽然有浏览器的层压缩机制，但是也有很多无法进行压缩的情况。也就是说除了我们显式的声明的合成层，还可能由于重叠原因不经意间产生一些不在预期的合成层，极端一点可能会产 ...`,l:"audition/html/html.html#层爆炸",a:"层爆炸"},"6.18":{t:"13. 谈谈html语义化\r",p:`语义元素可以清楚地向浏览器和开发者描述其意义。即元素本身传达了关于标签所包含内容类型的一些信息。例如，当浏览器解析到标签时，它将该标签解释为包含这一块内容的最重要的标题。

非语义元素：&lt;div ...`,l:"audition/html/html.html#_13-谈谈html语义化",a:"_13-谈谈html语义化"},"6.19":{t:"为什么要语义化？\r",p:`
页面结构: 使页面没有css的情况下，也能够呈现出很好的内容结构
有利于SEO: 爬虫依赖标签来确定关键字的权重，因此可以帮助爬虫抓取更多的有效信息
提升用户体验： 例如title、alt可以用于解 ...`,l:"audition/html/html.html#为什么要语义化",a:"为什么要语义化"},"7.0":{t:"# SEO\r",p:"\r",l:"audition/html/SEO.html",a:"seo"},"7.1":{t:"什么是SEO\r",p:"SEO（Search Engine Optimization）:汉译为搜索引擎优化。搜索引擎优化是一种利用搜索引擎的搜索规则来提高目前网站在有关搜索引擎内的自然排名的方式。SEO是指为了从搜索引擎中获 ...",l:"audition/html/SEO.html#什么是seo",a:"什么是seo"},"7.2":{t:"优化的三要素\r",p:`
标题，言简意赅的体现出页面的主要内容
关键词，提升页面关键词密度
描述，用自然语言描述页面的主要内容

`,l:"audition/html/SEO.html#优化的三要素",a:"优化的三要素"},"7.3":{t:"TDK是搜索引擎判断页面主题内容的关键\r",p:`所以要在title里面言简意赅的体现出页面的主要内容，如果主体比较多，可以用一些符号把不同的主题词隔开，但是关键词不要太多，最多不要超过五个。
keywords里面把每个关键词用英文逗号隔开，三到五个 ...`,l:"audition/html/SEO.html#tdk是搜索引擎判断页面主题内容的关键",a:"tdk是搜索引擎判断页面主题内容的关键"},"7.4":{t:"提升页面关键词密度\r",p:"关键词密度。简单理解就是关键词在所有文字内容中出现的比例。提升关键词的密度，有利于提升搜索引擎针对对应关键词的搜索排名。通过站内的关键词链接指向网站内部的链接，通过这样的方式，还可以在不同的页面之间相 ...",l:"audition/html/SEO.html#提升页面关键词密度",a:"提升页面关键词密度"},"7.5":{t:"细枝末节但不可忽视的优化\r",p:`
页面上经常会有各种图片，对于搜索引擎来说，它是不识别图片上的内容的。你可能知道代码中img标签的alt属性是为了图片加载失败的时候，给用户看的。这个属性表明了这张图的内容。其实搜索引擎在分析页面的时 ...`,l:"audition/html/SEO.html#细枝末节但不可忽视的优化",a:"细枝末节但不可忽视的优化"},"8.0":{t:"# W3C标准\r",p:"\r",l:"audition/html/w3c.html",a:"w3c标准"},"8.1":{t:"概念\r",p:`web标准简单来说可以分为结构、表现和行为

结构，主要是有HTML标签组成
表现，即指css样式表
行为，主要是有js、dom组成

`,l:"audition/html/w3c.html#概念",a:"概念"},"8.2":{t:"体现\r",p:`
需要声明（DOCTYPE）
需要定义语言编码
JavaScript定义&lt;script&gt;
CSS定义&lt;style type=“text/css”&gt;和数量单位
不要在注释内容中使 ...`,l:"audition/html/w3c.html#体现",a:"体现"},"8.3":{t:"意义\r",p:`
标签规范可以提高搜索引擎对页面的抓取效率，对SEO（搜索引擎优化）很有帮助
尽量使用外链css样式表和js脚本：
结构、表现和行为分为三块，符合规范，同时提高页面渲染速度，提高用户的体验
样式尽量少 ...`,l:"audition/html/w3c.html#意义",a:"意义"},"9.0":{t:"# http\r",p:"\r",l:"audition/http/http协议.html",a:"http"},"9.1":{t:"HTTP概述\r",p:"HTTP ( HyperText Transfer Protocal)，全称为超文本传输协议。HTTP是一个客户端终端（用户）和服务器端（网站）请求和应答的标准。通常，由HTTP客户端发起一个请求，创 ...",l:"audition/http/http协议.html#http概述",a:"http概述"},"9.2":{t:"HTTP特点：\r",p:`
支持客户端、服务端模式
简单快速：客户向服务器请求服务时，只需要传送请求方法和路径。由于HTTP协议简单，使得通信速度比较快
灵活：HTTP允许传输任意类型的数据对象。正在传输的类型由Content ...`,l:"audition/http/http协议.html#http特点",a:"http特点"},"9.3":{t:"TCP/IP\r",p:"TCP/IP（Transmission Control Protocol/Internet Protocol，传输控制协议/网际协议）是指能够在多个不同网络间实现信息传输的协议簇。TCP/IP协议不仅 ...",l:"audition/http/http协议.html#tcp-ip",a:"tcp-ip"},"9.4":{t:"HTTP与HTTPS的区别\r",p:"HTTP协议传输的数据都是未加密的，也就是明文的，可以用抓包工具直接抓下来并且可见，而HTTPS则是利用了网景公司设计的SSL（Secure Sockets Layer）协议对HTTP协议传输的数据进 ...",l:"audition/http/http协议.html#http与https的区别",a:"http与https的区别"},"9.5":{t:"HTTP1.0与HTTP2.0的区别\r",p:`HTTP 2.0 的出现，相比于 HTTP 1.x ，大幅度的提升了 web 性能
`,l:"audition/http/http协议.html#http1-0与http2-0的区别",a:"http1-0与http2-0的区别"},"9.6":{t:"URL的组成\r",p:`协议+主机名+路径+参数
`,l:"audition/http/http协议.html#url的组成",a:"url的组成"},"9.7":{t:"HTTP请求\r",p:"",l:"audition/http/http协议.html#http请求",a:"http请求"},"9.8":{t:"请求行\r",p:`请求行包括三个方面：请求方法、请求地址、协议版本



方法名
功能




GET
向指定的资源发出“显示”请求，使用 GET 方法应该只用在读取数据上，而不应该用于产生“副作用”的操作中


PO ...`,l:"audition/http/http协议.html#请求行",a:"请求行"},"9.9":{t:"GET与POST的区别：\r",p:`
GET：一般用于信息获取，使用URL传递参数并且可见，传递参数数量有限
POST：一般用于提交数据，参数不可见，传递参数数量无限制

注意：
安全性讲，get和post都一样，没啥所谓的哪个更安全, ...`,l:"audition/http/http协议.html#get与post的区别",a:"get与post的区别"},"9.10":{t:"什么情况下使用POST请求：\r",p:`
无法使用缓存文件（更新服务器上的文件或数据库），GET能请求缓存，POST不能
向服务器发送大量数据（POST 没有数据量限制）
发送包含未知字符的用户输入时，POST 比 GET 更稳定也更可靠
 ...`,l:"audition/http/http协议.html#什么情况下使用post请求",a:"什么情况下使用post请求"},"9.11":{t:"请求头\r",p:`请求头可用于传递一些附加信息，格式为：键: 值，注意，冒号后面有一个空格：

常见的请求 Header：




名称
作用




Authorization
用于设置身份认证信息


User-A ...`,l:"audition/http/http协议.html#请求头",a:"请求头"},"9.12":{t:"请求体\r",p:"请求体（又叫请求正文）是 post 请求方式中的请求参数，以 key = value 形式进行存储，多个请求参数之间用&amp;连接，如果请求当中请求体，那么在请求头当中的 Content-Lengt ...",l:"audition/http/http协议.html#请求体",a:"请求体"},"9.13":{t:"HTTP响应\r",p:`HTTP响应报文分为三个部分：响应状态行，响应头，响应体
`,l:"audition/http/http协议.html#http响应",a:"http响应"},"9.14":{t:"响应状态行\r",p:`


状态码
对应的信息




1XX
提示信息—表示请求已接收，继续处理


2XX
用于表示请求已被成功接收、理解、接收


3XX
用于表示资源（网页等）被永久转移到其它 URL，也就是所谓的 ...`,l:"audition/http/http协议.html#响应状态行",a:"响应状态行"},"9.15":{t:"常见状态码\r",p:`
2XX 成功

200   （成功）  服务器已成功处理了请求。 通常，这表示服务器提供了请求的网页。
201   （已创建）  请求成功并且服务器创建了新的资源。
202   （已接受）  服务器 ...`,l:"audition/http/http协议.html#常见状态码",a:"常见状态码"},"9.16":{t:"响应头 响应体\r",p:"\r",l:"audition/http/http协议.html#响应头-响应体",a:"响应头-响应体"},"9.17":{t:"浏览器输入url按回车背后经历了哪些\r",p:`参考这篇博文

URL 解析
DNS 查询
TCP 连接
处理请求
接受响应
渲染页面

`,l:"audition/http/http协议.html#浏览器输入url按回车背后经历了哪些",a:"浏览器输入url按回车背后经历了哪些"},"9.18":{t:"URL 解析\r",p:`
地址解析,首先判断你输入的是一个合法的 URL 还是一个待搜索的关键词，并且根据你输入的内容进行自动完成、字符编码等操作。
会使用 HSTS 强制客户端使用 HTTPS 访问页面
浏览器还会进行一些 ...`,l:"audition/http/http协议.html#url-解析",a:"url-解析"},"9.19":{t:"DNS 查询\r",p:`
浏览器缓存,浏览器会先检查是否在缓存中，没有则调用系统库函数进行查询。
操作系统缓存,操作系统也有自己的 DNS缓存，但在这之前，会向检查域名是否存在本地的 Hosts 文件里，没有则向 DNS 服 ...`,l:"audition/http/http协议.html#dns-查询",a:"dns-查询"},"9.20":{t:"TCP 连接\r",p:`TCP/IP 分为四层，在发送数据时，每层都要对数据进行封装：

应用层：发送 HTTP 请求
传输层：TCP 传输报文
网络层：IP协议查询Mac地址
链路层：以太网协议

`,l:"audition/http/http协议.html#tcp-连接",a:"tcp-连接"},"9.21":{t:"处理请求\r",p:`服务器处理收到的请求，将数据返回至浏览器
`,l:"audition/http/http协议.html#处理请求",a:"处理请求"},"9.22":{t:"浏览器收到HTTP响应\r",p:`浏览器解码响应，如果响应可以缓存，则存入缓存。
`,l:"audition/http/http协议.html#浏览器收到http响应",a:"浏览器收到http响应"},"9.23":{t:"渲染页面\r",p:"\r",l:"audition/http/http协议.html#渲染页面",a:"渲染页面"},"9.24":{t:"TCP 建立连接是三次握手，而断开连接是四次挥手。\r",p:"",l:"audition/http/http协议.html#tcp-建立连接是三次握手-而断开连接是四次挥手。",a:"tcp-建立连接是三次握手-而断开连接是四次挥手。"},"9.25":{t:"三次握手\r",p:"三次握手（Three-way Handshake）其实就是指建立一个TCP连接时，需要客户端和服务器总共发送3个包。进行三次握手的主要作用就是为了确认双方的接收能力和发送能力是否正常、指定自己的初始化 ...",l:"audition/http/http协议.html#三次握手",a:"三次握手"},"9.26":{t:"四次挥手\r",p:`TCP 的连接的拆除需要发送四个包，因此称为四次挥手(Four-way handshake)，客户端或服务器均可主动发起挥手动作。

第一次挥手：客户端发送一个 FIN 报文，等待服务端的确认。此时客 ...`,l:"audition/http/http协议.html#四次挥手",a:"四次挥手"},"10.0":{t:"# javascript八股文\r",p:"\r",l:"audition/js/javascript.html",a:"javascript八股文"},"10.1":{t:"1. Js的基础类型\r",p:`
基础类型有：boolean、string、number、undefined、symbol、null、  bigint。
引用数据类型：Object、function、Array

`,l:"audition/js/javascript.html#_1-js的基础类型",a:"_1-js的基础类型"},"10.2":{t:"2. typeof和instanceof的区别\r",p:`
typeof能识别所有的值类型，识别函数，能区分是否是引用类型。
instanceof用于检测构造函数的 prototype 属性是否出现在某个实例对象的原型链上。

`,l:"audition/js/javascript.html#_2-typeof和instanceof的区别",a:"_2-typeof和instanceof的区别"},"10.3":{t:"3. JS数据类型判断\r",p:`
typeof：检测基础数据类型和函数很好用

它能准确判断出的数据类型有：Number，String，Boolean，Undefined，Symbol，BigInt，Function。
它的缺点就是 ...`,l:"audition/js/javascript.html#_3-js数据类型判断",a:"_3-js数据类型判断"},"10.4":{t:"4. ``没有 defer 或 async，浏览器会立即加载并执行指定的脚本，“立即”指的是在渲染该 script 标签之下的文档元素之前，也就是说不等待后续载入的文档元素，读到就加载并执行。先执行下载js脚本然后执行然后再解析HTML。\r",p:"",l:"audition/js/javascript.html#_4-没有-defer-或-async-浏览器会立即加载并执行指定的脚本-立即-指的是在渲染该-script-标签之下的文档元素之前-也就是说不等待后续载入的文档元素-读到就加载并执行。先执行下载js脚本然后执行然后再解析html。",a:"_4-没有-defer-或-async-浏览器会立即加载并执行指定的脚本-立即-指的是在渲染该-script-标签之下的文档元素之前-也就是说不等待后续载入的文档元素-读到就加载并执行。先执行下载js脚本然后执行然后再解析html。"},"10.5":{t:"async \r",p:"``有 async，加载和渲染后续文档元素的过程将和 script.js 的加载与执行并行进行（异步）。解析HTML和下载async脚本同时进行，async脚本下载完成后立即执行，然后开始解析剩下的H ...",l:"audition/js/javascript.html#async",a:"async"},"10.6":{t:"defer\r",p:"``如果一个script加了defer属性，即使放在head里面，它也会在html页面解析完毕之后再去执行，也就是类似于把这个script放在了页面底部。下载时，解析HTML和下载defer脚本同时进 ...",l:"audition/js/javascript.html#defer",a:"defer"},"10.7":{t:"不同\r",p:`
defer是html4的async是html5新增的
执行时间不同，async是下载完后立即执行，defer是在html解析完后再执行,在DOM树构建完成，DOMContentLoaded之前执行
 ...`,l:"audition/js/javascript.html#不同",a:"不同"},"10.8":{t:"立即执行函数是闭包\r",p:`立即执行函数是闭包，因为立即执行，所以定义在return上，所以是闭包，var声明变量时在闭包里不会提升，私有属性
`,l:"audition/js/javascript.html#立即执行函数是闭包",a:"立即执行函数是闭包"},"10.9":{t:"class类的函数默认是严格模式\r",p:`class类里的函数默认是严格模式，类中的方法的this不是固定的，以方法形式调用this是当前实例，以普通函数形式调时严格模式下this指向undefined，以箭头函数调用时this指向当前实例
`,l:"audition/js/javascript.html#class类的函数默认是严格模式",a:"class类的函数默认是严格模式"},"10.10":{t:"JS 执行机制\r",p:"\r",l:"audition/js/javascript.html#js-执行机制",a:"js-执行机制"},"10.11":{t:"eventloop事件循环\r",p:"同步任务执行完，就会去任务队列中拿一个宏任务放到执行栈中执行，执行完该宏任务中的所有微任务，再到任务队列中拿宏任务，即一个宏任务、所有微任务、渲染、一个宏任务、所有微任务、渲染...(不是所有微任务之 ...",l:"audition/js/javascript.html#eventloop事件循环",a:"eventloop事件循环"},"10.12":{t:"同步异步\r",p:`
同步任务：指排队在主线程上依次执行的任务
异步任务：不进入主线程，而进入任务队列的任务，又分为宏任务和微任务

宏任务： 渲染事件、请求、script、setTimeout、setInterval、 ...`,l:"audition/js/javascript.html#同步异步",a:"同步异步"},"10.13":{t:"宏任务和微任务\r",p:`
事件循环由宏任务和在执行宏任务期间产生的所有微任务组成。完成当下的宏任务后，会立刻执行所有在此期间入队的微任务。
这种设计是为了给高优先级任务一个插队的机会，微任务比宏任务有更高优先级。否则新入队的 ...`,l:"audition/js/javascript.html#宏任务和微任务",a:"宏任务和微任务"},"10.14":{t:"setTimeout的误区\r",p:`
setTimeout的回调不一定在指定时间后能执行。而是在指定时间后，将回调函数放入事件循环的队列中。
如果时间到了，JS引擎还在执行同步任务，这个回调函数需要等待；如果当前事件循环的队列里还有其他 ...`,l:"audition/js/javascript.html#settimeout的误区",a:"settimeout的误区"},"10.15":{t:"nextTick 永远大于 promise.then \r",p:"\r",l:"audition/js/javascript.html#nexttick-永远大于-promise-then",a:"nexttick-永远大于-promise-then"},"10.16":{t:"深拷贝浅拷贝\r",p:"",l:"audition/js/javascript.html#深拷贝浅拷贝",a:"深拷贝浅拷贝"},"10.17":{t:"深拷贝\r",p:"深拷贝是将一个对象从内存中完整的拷贝一份出来,从堆内存中开辟一个新的区域存放新对象（新旧对象不共享同一块内存）,且修改新对象不会影响原对象（深拷贝采用了在堆内存中申请新的空间来存储数据，这样每个可以避 ...",l:"audition/js/javascript.html#深拷贝",a:"深拷贝"},"10.18":{t:"浅拷贝\r",p:"如果属性是基本类型，拷贝的就是基本类型的值，如果属性是引用类型，拷贝的就是内存地址（新旧对象共享同一块内存），所以如果其中一个对象改变了这个地址，就会影响到另一个对象（只是拷贝了指针，使得两个指针指向 ...",l:"audition/js/javascript.html#浅拷贝",a:"浅拷贝"},"10.19":{t:"赋值和浅拷贝的区别\r",p:`
赋值：新对象改变会影响原对象，赋值后原对象改变也会影响新对象，就像是一个整体
浅拷贝：新对象改变不会影响原对象，拷贝后原对象改变也不会影响新对象，就像地址一样的两个不同的个体

`,l:"audition/js/javascript.html#赋值和浅拷贝的区别",a:"赋值和浅拷贝的区别"},"10.20":{t:"内存泄漏\r",p:`比如：意外的全局变量，给全局变量赋值
`,l:"audition/js/javascript.html#内存泄漏",a:"内存泄漏"},"10.21":{t:"内存的生命周期\r",p:`
分配内存，
在内存中进行操作
垃圾清除，释放内存

`,l:"audition/js/javascript.html#内存的生命周期",a:"内存的生命周期"},"10.22":{t:"垃圾回收机制\r",p:`
从全局对象 window 开始，顺着引用表能找到的都不是内存垃圾，不会被回收掉。只有那些找不到的对象才是内存垃圾，才会在适当的时机被 gc 回收
回收那些不再使用的内存，本质上是找到内存中可以释放的 ...`,l:"audition/js/javascript.html#垃圾回收机制",a:"垃圾回收机制"},"10.23":{t:"执行上下文\r",p:"函数在执行时，JS 引擎会创建执行上下文，该执行上下文会包含函数的作用域链，其次包含函数内部定义的变量、参数等。在执行时，会首先查找当前作用域下的变量，如果找不到，就会沿着作用域链中查找，一直到全局作 ...",l:"audition/js/javascript.html#执行上下文",a:"执行上下文"},"10.24":{t:"isNaN 与 Number.isNaN的区别？\r",p:`
isNaN：除了判断NaN为true，还会把不能转成数字的判断为true，例如字符串'xxx'
Number.isNaN：只有判断NaN时为true，其余情况都为false

console.log ...`,l:"audition/js/javascript.html#isnan-与-number-isnan的区别",a:"isnan-与-number-isnan的区别"},"10.25":{t:"hasOwnProperty\r",p:`找到静态方法定义在实例对象上的属性，找不到实例方法定义在原型对象上的属性
function Person(name) {
  this.name = name
}
Person.prototype.a ...`,l:"audition/js/javascript.html#hasownproperty",a:"hasownproperty"},"10.26":{t:"&& ||\r",p:`a &amp;&amp; b :a为真时执行b，a为假时执行a
a || b :a为假时执行b，a为真时执行a
`,l:"audition/js/javascript.html#",a:""},"10.27":{t:"valueOf 与 toString\r",p:`valueOf()方法用于返回指定对象的原始值，若对象没有原始值，则将返回对象本身。toString()返回一个代表该对象的字符串。

valueOf偏向于运算，toString偏向于显示
对象转换时 ...`,l:"audition/js/javascript.html#valueof-与-tostring",a:"valueof-与-tostring"},"10.28":{t:"JavaScript变量在内存中具体存储形式？\r",p:`
基本数据类型：存在栈内存里
引用数据类型：指针存栈内存，指向堆内存中一块地址，内容存在堆内存中

`,l:"audition/js/javascript.html#javascript变量在内存中具体存储形式",a:"javascript变量在内存中具体存储形式"},"10.29":{t:"JavaScript的装箱和拆箱？\r",p:"",l:"audition/js/javascript.html#javascript的装箱和拆箱",a:"javascript的装箱和拆箱"},"10.30":{t:"装箱：把基本数据类型转化为对应的引用数据类型的操作\r",p:"\r",l:"audition/js/javascript.html#装箱-把基本数据类型转化为对应的引用数据类型的操作",a:"装箱-把基本数据类型转化为对应的引用数据类型的操作"},"10.31":{t:"拆箱：将引用数据类型转化为对应的基本数据类型的操作\r",p:`通过valueOf或者toString方法实现拆箱操作
var objNum = new Number(123);  
var objStr =new String(&quot;123&quot;); ...`,l:"audition/js/javascript.html#拆箱-将引用数据类型转化为对应的基本数据类型的操作",a:"拆箱-将引用数据类型转化为对应的基本数据类型的操作"},"10.32":{t:"null和undefined的异同点有哪些？\r",p:`
都是空变量
都是假值，转布尔值都是false
null == undefined 为 true
不同点
typeof判断null为object，判断undefined为undefined null转 ...`,l:"audition/js/javascript.html#null和undefined的异同点有哪些",a:"null和undefined的异同点有哪些"},"10.33":{t:"为什么typeof null 是object？\r",p:`不同的数据类型在底层都是通过二进制表示的，二进制前三位为000则会被判断为object类型，而null底层的二进制全都是0，那前三位肯定也是000，所以被判断为object
`,l:"audition/js/javascript.html#为什么typeof-null-是object",a:"为什么typeof-null-是object"},"10.34":{t:"== 与 === 的区别？\r",p:`
==：在比较过程中会存在隐式转换
===：需要类型相同，值相同，才能为true

`,l:"audition/js/javascript.html#与-的区别",a:"与-的区别"},"10.35":{t:"JavaScript的隐式转换规则？\r",p:`
转成string类型： +（字符串连接符）
转成number类型：++/--(自增自减运算符) + - * / %(算术运算符) &gt; &lt; &gt;= &lt;= == != === != ...`,l:"audition/js/javascript.html#javascript的隐式转换规则",a:"javascript的隐式转换规则"},"10.36":{t:"双等号左右两边的转换规则？\r",p:`
null == undefined 为 true
如果有一个操作数是布尔值，则在比较相等性之前先将其转换为数值——false转换为0，而true转换为1；
如果一个操作数是字符串，另一个操作数是数值 ...`,l:"audition/js/javascript.html#双等号左右两边的转换规则",a:"双等号左右两边的转换规则"},"10.37":{t:"undefined >= undefined 为什么是 false ？\r",p:`按照隐式转换规则，可转换成NaN &gt;= NaN，NaN 不等于 NaN，也不大于，所以是false
`,l:"audition/js/javascript.html#undefined-undefined-为什么是-false",a:"undefined-undefined-为什么是-false"},"10.38":{t:"null >= null 为什么是 true？\r",p:`按照隐式转换规则，可转换成0 &gt;= 0，0 等于 0，所以是true
`,l:"audition/js/javascript.html#null-null-为什么是-true",a:"null-null-为什么是-true"},"10.39":{t:"[] == ![] 为什么是 true ？\r",p:`按照双等号左右两边的转换规则

! 优先级高于 ==，[]不是假值，所以先转换成 [] == false
右边为布尔值，false先转数字0，所以可转换为[] == 0
左边为对象，[]调用toStr ...`,l:"audition/js/javascript.html#为什么是-true",a:"为什么是-true"},"10.40":{t:"0.1 + 0.2 === 0.3，对吗？\r",p:`不对，JavaScript的计算存在精度丢失问题

原因：JavaScript中小数是浮点数，需转二进制进行运算，有些小数无法用二进制表示，所以只能取近似值，所以造成误差
解决方法：
先变成整数运算， ...`,l:"audition/js/javascript.html#_0-1-0-2-0-3-对吗",a:"_0-1-0-2-0-3-对吗"},"10.41":{t:"什么是匿名函数？\r",p:`匿名函数：就是没有函数名的函数
`,l:"audition/js/javascript.html#什么是匿名函数",a:"什么是匿名函数"},"10.42":{t:"绑定点击事件有几种方式？\r",p:`三种
xxx.onclick = function (){}
&lt;xxx onclick=&quot;&quot;&gt;&lt;/xxx&gt;
xxx.addEventListener('cl ...`,l:"audition/js/javascript.html#绑定点击事件有几种方式",a:"绑定点击事件有几种方式"},"10.43":{t:"addEventListener的第三个参数是干嘛的？\r",p:`第三个变量传一个布尔值，需不需要阻止冒泡，默认是false，不阻止冒泡,决定事件是在捕获或冒泡阶段执行
`,l:"audition/js/javascript.html#addeventlistener的第三个参数是干嘛的",a:"addeventlistener的第三个参数是干嘛的"},"10.44":{t:"函数声明和函数表达式的区别？\r",p:`
函数声明：享受函数提升
函数表达式：归类于变量声明，享受变量提升
函数提升优先级 &gt; 变量提升优先级

console.log(fun) // fun () {}
// 函数表达式
var f ...`,l:"audition/js/javascript.html#函数声明和函数表达式的区别",a:"函数声明和函数表达式的区别"},"10.45":{t:"JavaScript的事件流模型有哪些？\r",p:`
事件冒泡：由最具体的元素接收，并往上传播
事件捕获：由最不具体的元素接收，并往下传播
DOM事件流：事件捕获 -&gt; 目标阶段 -&gt; 事件冒泡

`,l:"audition/js/javascript.html#javascript的事件流模型有哪些",a:"javascript的事件流模型有哪些"},"10.46":{t:"Ajax、Axios、Fetch有啥区别？\r",p:`
Ajax：是对XMLHttpRequest对象（XHR）的封装
Axios：是基于Promise对XHR对象的封装
Fetch：是window的一个方法，也是基于Promise，但是与XHR无关，不 ...`,l:"audition/js/javascript.html#ajax、axios、fetch有啥区别",a:"ajax、axios、fetch有啥区别"},"10.47":{t:"load、$(document).ready、DOMContentLoaded的区别？\r",p:`DOM文档加载的步骤为：

解析HTML结构。
加载外部脚本和样式表文件。
解析并执行脚本代码。
DOM树构建完成。// DOMContentLoaded触发、$(document).ready触发
 ...`,l:"audition/js/javascript.html#load、-document-ready、domcontentloaded的区别",a:"load、-document-ready、domcontentloaded的区别"},"10.48":{t:"如何阻止事件冒泡？\r",p:`function stopBubble(e) {
  if (e.stopPropagation) {
    e.stopPropagation()
  } else {
    window.ev ...`,l:"audition/js/javascript.html#如何阻止事件冒泡",a:"如何阻止事件冒泡"},"10.49":{t:"如何阻止事件默认行为？\r",p:`function stopDefault(e) {
  if (e.preventDefault) {
    e.preventDefault();
  } else {
    window.ev ...`,l:"audition/js/javascript.html#如何阻止事件默认行为",a:"如何阻止事件默认行为"},"10.50":{t:"什么是事件委托？\r",p:`当所有子元素都需要绑定相同的事件的时候，可以把事件绑定在父元素上，这就是事件委托，优点有：

绑定在父元素上只需要绑定一次，节省性能
子元素不需要每个都去绑定同一事件
如果后续又有新的子元素添加，会由 ...`,l:"audition/js/javascript.html#什么是事件委托",a:"什么是事件委托"},"10.51":{t:"如何实现数组去重？\r",p:`
使用 Map 去重

function quchong1(arr) {
  const newArr = []
  arr.reduce((pre, next) =&gt; {
    if (!p ...`,l:"audition/js/javascript.html#如何实现数组去重",a:"如何实现数组去重"},"10.52":{t:"Set\r",p:`Set 是一种叫做集合的数据结构

向 Set 加入值的时候，不会发生类型转换，所以5和&quot;5&quot;是两个不同的值。Set 内部判断两个值是否不同，使用的算法叫做“Same-value- ...`,l:"audition/js/javascript.html#set",a:"set"},"10.53":{t:"Set 实例属性\r",p:`
constructor： 构造函数
size：元素数量

let set = new Set([1, 2, 3, 2, 1])

console.log(set.length)    // unde ...`,l:"audition/js/javascript.html#set-实例属性",a:"set-实例属性"},"10.54":{t:"Set 实例方法\r",p:`
delete(value)：存在即删除集合中value
has(value)：判断集合中是否存在 value
clear()：清空集合
keys()：返回一个包含集合中所有键的迭代器
values( ...`,l:"audition/js/javascript.html#set-实例方法",a:"set-实例方法"},"10.55":{t:"转为数组\r",p:`Array.from方法可以将 Set 结构转为数组
const items = new Set([1, 2, 3, 2])
const array = Array.from(items)
conso ...`,l:"audition/js/javascript.html#转为数组",a:"转为数组"},"10.56":{t:"所以Set可以使用数组里的 map、filter 方法\r",p:`let set = new Set([1, 2, 3])
set = new Set([...set].map(item =&gt; item * 2))
console.log([...set])  ...`,l:"audition/js/javascript.html#所以set可以使用数组里的-map、filter-方法",a:"所以set可以使用数组里的-map、filter-方法"},"10.57":{t:"因此，Set 很容易实现交集（Intersect）、并集（Union）、差集（Difference）\r",p:`let set1 = new Set([1, 2, 3])
let set2 = new Set([1, 3, 4])
let intersect = new Set([...set1].filter ...`,l:"audition/js/javascript.html#因此-set-很容易实现交集-intersect-、并集-union-、差集-difference",a:"因此-set-很容易实现交集-intersect-、并集-union-、差集-difference"},"10.58":{t:"Map(字典) \r",p:`参考
集合 与 字典 的区别：

共同点：集合、字典 可以储存不重复的值
不同点：集合 是以 [value, value]的形式储存元素，字典 是以 [key, value] 的形式储存

const ...`,l:"audition/js/javascript.html#map-字典",a:"map-字典"},"10.59":{t:"属性方法\r",p:`
constructor：构造函数
size：返回字典中所包含的元素个数
set(key, value)：向字典中添加新元素
get(key)：通过键查找特定的数值并返回
has(key)：判断字典中 ...`,l:"audition/js/javascript.html#属性方法",a:"属性方法"},"10.60":{t:"Map 转 Object\r",p:`function map2obj (map){
    let obj = Object.creat(null)
    for (let [key,value] of maps){
         ...`,l:"audition/js/javascript.html#map-转-object",a:"map-转-object"},"10.61":{t:"Object 转 Map\r",p:`function obj2map (obj){
    let map = new Map()
    for (let key of Object.keys[obj]){
        map.s ...`,l:"audition/js/javascript.html#object-转-map",a:"object-转-map"},"10.62":{t:"NaN是什么？有什么特点？\r",p:`NaN不等于自身，也就是 NaN === NaN 为 false NaN为假值，转布尔值为false

NaN本质是一个number，typeof NaN === number

`,l:"audition/js/javascript.html#nan是什么-有什么特点",a:"nan是什么-有什么特点"},"10.63":{t:"JavaScript继承方式有几种？ \r",p:`参考
`,l:"audition/js/javascript.html#javascript继承方式有几种",a:"javascript继承方式有几种"},"10.64":{t:"创建一个对象的方式有哪几种？\r",p:`
new Object创建

const obj = new Object()
obj.name = 'ljt'


字面量创建

const obj = { name: 'ljt' }


工厂模式 ...`,l:"audition/js/javascript.html#创建一个对象的方式有哪几种",a:"创建一个对象的方式有哪几种"},"10.65":{t:"this指向的四种情况？\r",p:`
new操作符创建实例

function Person(name) {
  this.name = name
  console.log(this)
}
// this指向当前person实例对象
 ...`,l:"audition/js/javascript.html#this指向的四种情况",a:"this指向的四种情况"},"10.66":{t:"数组常用方法\r",p:`array



方法
作用
是否影响原数组




push
在数组后添加元素，返回数组长度
✅


pop
删除数组最后一项，返回被删除项
✅


shift
删除数组第一项，并返回被删除项
✅
 ...`,l:"audition/js/javascript.html#数组常用方法",a:"数组常用方法"},"10.67":{t:"Math的常用方法有哪些？\r",p:`


方法
作用




Math.max(...arr)
取arr中的最大值


Math.min(...arr)
取arr中的最小值


Math.ceil(小数)
小数向上取整


Math.f ...`,l:"audition/js/javascript.html#math的常用方法有哪些",a:"math的常用方法有哪些"},"10.68":{t:"哪些因素导致内存泄漏？如何解决？\r",p:"\r",l:"audition/js/javascript.html#哪些因素导致内存泄漏-如何解决",a:"哪些因素导致内存泄漏-如何解决"},"10.69":{t:"讲讲JavaScript的垃圾回收机制\r",p:"\r",l:"audition/js/javascript.html#讲讲javascript的垃圾回收机制",a:"讲讲javascript的垃圾回收机制"},"10.70":{t:"JS中有哪些不同类型的弹出框？\r",p:`在JS中有三种类型的弹出框可用，分别是：
Alert Confirm

Prompt

`,l:"audition/js/javascript.html#js中有哪些不同类型的弹出框",a:"js中有哪些不同类型的弹出框"},"10.71":{t:"如何将 JS 日期转换为ISO标准\r",p:`toISOString() 方法用于将js日期转换为ISO标准。 它使用ISO标准将js Date对象转换为字符串。如：
var date = new Date();
var n = date.toI ...`,l:"audition/js/javascript.html#如何将-js-日期转换为iso标准",a:"如何将-js-日期转换为iso标准"},"10.72":{t:"如何在JS中编码和解码 URL\r",p:`encodeURI() 函数用于在JS中对URL进行编码。它将url字符串作为参数并返回编码的字符串。
注意： encodeURI()不会编码类似这样字符： / ? : @ &amp; = + $ # ...`,l:"audition/js/javascript.html#如何在js中编码和解码-url",a:"如何在js中编码和解码-url"},"10.73":{t:"什么是BOM？有哪些api？\r",p:`BOM就是browser object model，浏览器对象模型



api
作用
代表方法或属性




window.history
操纵浏览器的记录
history.back()  hist ...`,l:"audition/js/javascript.html#什么是bom-有哪些api",a:"什么是bom-有哪些api"},"10.74":{t:"BOM 和 DOM 的关系\r",p:`
BOM全称Browser Object Model，即浏览器对象模型，主要处理浏览器窗口和框架，没有统一遵循的标准
DOM全称Document Object Model，即文档对象模型，是 HTML ...`,l:"audition/js/javascript.html#bom-和-dom-的关系",a:"bom-和-dom-的关系"},"10.75":{t:"JS中的substr()和substring()函数有什么区别\r",p:"",l:"audition/js/javascript.html#js中的substr-和substring-函数有什么区别",a:"js中的substr-和substring-函数有什么区别"},"10.76":{t:"substr()\r",p:`substr() 函数的形式为substr(startIndex,length)。 它从startIndex返回子字符串并返回'length'个字符数。
var s = &quot;hello&quo ...`,l:"audition/js/javascript.html#substr",a:"substr"},"10.77":{t:"substring() \r",p:`substring() 函数的形式为substring(startIndex,endIndex)。 它返回从startIndex到endIndex - 1的子字符串。
var s = &quot;he ...`,l:"audition/js/javascript.html#substring",a:"substring"},"10.78":{t:'解释一下 "use strict" ?\r',p:"“use strict”是Es5中引入的js指令。 使用“use strict”指令的目的是强制执行严格模式下的代码。 在严格模式下，咱们不能在不声明变量的情况下使用变量。 早期版本的js忽略了“us ...",l:"audition/js/javascript.html#解释一下-use-strict",a:"解释一下-use-strict"},"10.79":{t:"input标签\r",p:`
&lt;input&gt; 标签规定了用户可以在其中输入数据的输入字段。
&lt;input&gt; 元素在&lt;form&gt;元素中使用，用来声明允许用户输入数据的 input 控件。输入字段 ...`,l:"audition/js/javascript.html#input标签",a:"input标签"},"10.80":{t:"属性\r",p:`参考
`,l:"audition/js/javascript.html#属性",a:"属性"},"11.0":{t:"# Object.prototype\r",p:"\r",l:"audition/js/objectprototype.html",a:"object-prototype"},"11.1":{t:"object\r",p:`在 JavaScript 中，几乎所有的对象都是 Object 类型的实例，它们都会从 Object.prototype 继承属性和方法
`,l:"audition/js/objectprototype.html#object",a:"object"},"11.2":{t:"Object()\r",p:`创建一个新的 Object 对象。该对象将会包裹（wrapper）传入的参数
`,l:"audition/js/objectprototype.html#object",a:"object"},"11.3":{t:"Object.assign()\r",p:`
通过复制一个或多个对象来创建一个新的对象。浅拷贝
Object.assign()方法将所有可枚举属性从一个或多个源对象复制到目标对象，返回修改后的对象。

const target = { a: 1 ...`,l:"audition/js/objectprototype.html#object-assign",a:"object-assign"},"11.4":{t:"Object.create()\r",p:`
Object.create() 方法用于创建一个新的实例对象，使用现有的对象来作为新创建实例对象的原型对象（prototype）。
新创建实例对象.__proto__ === 传入的对象

cons ...`,l:"audition/js/objectprototype.html#object-create",a:"object-create"},"11.5":{t:"Object.defineProperty()\r",p:`Object.defineProperty() 方法会直接在一个对象上定义一个新属性，或者修改一个对象的现有属性，并返回此对象。
`,l:"audition/js/objectprototype.html#object-defineproperty",a:"object-defineproperty"},"11.6":{t:"语法\r",p:`Object.defineProperty(obj, prop, descriptor)

obj要定义属性的对象。
prop要定义或修改的属性的名称或 Symbol 。
descriptor要定义或 ...`,l:"audition/js/objectprototype.html#语法",a:"语法"},"11.7":{t:"Object.defineProperties()\r",p:`给对象添加多个属性并分别指定它们的配置。
var obj = {};
Object.defineProperties(obj, {
  'property1': {
    value: true,
 ...`,l:"audition/js/objectprototype.html#object-defineproperties",a:"object-defineproperties"},"11.8":{t:"Object.entries()\r",p:"Object.entries() 方法返回一个给定对象自身可枚举属性的键值对数组，其排列与使用 for...in 循环遍历该对象时返回的顺序一致（区别在于 for-in 循环还会枚举原型链中的属性）。 ...",l:"audition/js/objectprototype.html#object-entries",a:"object-entries"},"11.9":{t:"Object.freeze()\r",p:"Object.freeze() 方法可以冻结一个对象。一个被冻结的对象再也不能被修改；冻结了一个对象则不能向这个对象添加新的属性，不能删除已有属性，不能修改该对象已有属性的可枚举性、可配置性、可写性， ...",l:"audition/js/objectprototype.html#object-freeze",a:"object-freeze"},"11.10":{t:"Object.fromEntries() \r",p:`Object.fromEntries() 方法把键值对列表转换为一个对象。
const entries = new Map([
  ['foo', 'bar'],
  ['baz', 42]
]);
 ...`,l:"audition/js/objectprototype.html#object-fromentries",a:"object-fromentries"},"11.11":{t:"Object.getPrototypeOf()\r",p:`Object.getPrototypeOf() 方法返回指定对象的原型（内部[[Prototype]]属性的值）。
`,l:"audition/js/objectprototype.html#object-getprototypeof",a:"object-getprototypeof"},"11.12":{t:"语法\r",p:`Object.getPrototypeOf(object)

object:要返回其原型的对象。
返回值:给定对象的原型。如果没有继承属性，则返回 null 。

const prototype1 = ...`,l:"audition/js/objectprototype.html#语法",a:"语法"},"11.13":{t:"Object.setPrototypeOf()\r",p:`Object.setPrototypeOf() 方法设置一个指定的对象的原型（即，内部[[Prototype]] 属性）到另一个对象或 null。
Object.setPrototypeOf(obj, ...`,l:"audition/js/objectprototype.html#object-setprototypeof",a:"object-setprototypeof"},"11.14":{t:"Object.prototype.isPrototypeOf()\r",p:`isPrototypeOf() 方法用于测试一个对象是否存在于另一个对象的原型链上。针对对象本身，不是对象.prototype
prototypeObj.isPrototypeOf(object)

 ...`,l:"audition/js/objectprototype.html#object-prototype-isprototypeof",a:"object-prototype-isprototypeof"},"11.15":{t:"instanceof\r",p:"instanceof 运算符用于检测构造函数的 prototype 属性是否出现在某个实例对象的原型链上。在表达式 &quot;object instanceof AFunction&quot;中，o ...",l:"audition/js/objectprototype.html#instanceof",a:"instanceof"},"11.16":{t:"Object.getOwnPropertyDescriptor()\r",p:`Object.getOwnPropertyDescriptor() 方法返回指定对象上一个自有属性对应的属性描述符。（自有属性指的是直接赋予该对象的属性，不需要从原型链上进行查找的属性）
const  ...`,l:"audition/js/objectprototype.html#object-getownpropertydescriptor",a:"object-getownpropertydescriptor"},"11.17":{t:"Object.getOwnPropertyNames()\r",p:`
Object.getOwnPropertyNames() 方法返回一个由指定对象的所有自身属性的属性名（包括不可枚举属性但不包括 Symbol 值作为名称的属性）组成的数组。
返回一个数组，该数组对 ...`,l:"audition/js/objectprototype.html#object-getownpropertynames",a:"object-getownpropertynames"},"11.18":{t:"Object.getOwnPropertySymbols()\r",p:`Object.getOwnPropertySymbols() 方法返回一个给定对象自身的所有 Symbol 属性的数组。
var obj = {};
var a = Symbol(&quot;a&qu ...`,l:"audition/js/objectprototype.html#object-getownpropertysymbols",a:"object-getownpropertysymbols"},"11.19":{t:"Object.hasOwn()\r",p:`如果指定的对象自身有指定的属性，则静态方法 Object.hasOwn() 返回 true。如果属性是继承的或者不存在，该方法返回 false。
const object1 = {
  prop: ' ...`,l:"audition/js/objectprototype.html#object-hasown",a:"object-hasown"},"11.20":{t:"Object.prototype.hasOwnProperty()\r",p:`hasOwnProperty() 方法会返回一个布尔值，指示对象自身属性中是否具有指定的属性（也就是，是否有指定的键）。

属性值为null或undefind时也会返回true，有值就会返回true
 ...`,l:"audition/js/objectprototype.html#object-prototype-hasownproperty",a:"object-prototype-hasownproperty"},"11.21":{t:"Object.is() \r",p:`Object.is() 方法判断两个值是否为同一个值。返回一个布尔值
Object.is(value1, value2);
Object.is() 方法判断两个值是否为同一个值，如果满足以下任意条件则 ...`,l:"audition/js/objectprototype.html#object-is",a:"object-is"},"11.22":{t:"Object.is() 与 ==和===\r",p:`
Object.is() 与 == 不同。== 运算符在判断相等前对两边的变量（如果它们不是同一类型）进行强制转换（这种行为将 &quot;&quot; == false 判断为 true），而 Ob ...`,l:"audition/js/objectprototype.html#object-is-与-和",a:"object-is-与-和"},"11.23":{t:"Object.isExtensible()\r",p:`Object.isExtensible() 方法判断一个对象是否是可扩展的（是否可以在它上面添加新的属性）。
`,l:"audition/js/objectprototype.html#object-isextensible",a:"object-isextensible"},"11.24":{t:"Object.isFrozen(obj)\r",p:`Object.isFrozen() 方法判断一个对象是否被冻结。
`,l:"audition/js/objectprototype.html#object-isfrozen-obj",a:"object-isfrozen-obj"},"11.25":{t:"Object.keys()\r",p:`Object.keys() 方法会返回一个由一个给定对象的自身可枚举属性组成的数组，数组中属性名的排列顺序和正常循环遍历该对象时返回的顺序一致。
const object1 = {
  a: 'som ...`,l:"audition/js/objectprototype.html#object-keys",a:"object-keys"},"11.26":{t:"Object.values()\r",p:`Object.values() 方法返回一个给定对象自身的所有可枚举属性值的数组，值的顺序与使用 for...in 循环的顺序相同（区别在于 for-in 循环枚举原型链中的属性）。
var obj  ...`,l:"audition/js/objectprototype.html#object-values",a:"object-values"},"11.27":{t:"Object.preventExtensions()\r",p:`Object.preventExtensions() 方法让一个对象变的不可扩展，也就是永远不能再添加新的属性。
`,l:"audition/js/objectprototype.html#object-preventextensions",a:"object-preventextensions"},"11.28":{t:"Object.prototype.propertyIsEnumerable()\r",p:`propertyIsEnumerable() 方法返回一个布尔值，表示指定的属性是否可枚举。
`,l:"audition/js/objectprototype.html#object-prototype-propertyisenumerable",a:"object-prototype-propertyisenumerable"},"11.29":{t:"Object.seal()\r",p:`Object.seal()方法封闭一个对象，阻止添加新属性并将所有现有属性标记为不可配置。当前属性的值只要原来是可写的就可以改变。
`,l:"audition/js/objectprototype.html#object-seal",a:"object-seal"},"11.30":{t:"Object.prototype.toString()\r",p:`toString() 方法返回一个表示该对象的字符串。该方法旨在重写（自定义）派生类对象的类型转换的逻辑。

默认情况下，toString() 不接受任何参数。然而，继承自 Object 的对象可能用 ...`,l:"audition/js/objectprototype.html#object-prototype-tostring",a:"object-prototype-tostring"},"11.31":{t:"Object.prototype.valueOf()\r",p:`Object 的 valueOf() 方法将 this 值转换为一个对象。此方法旨在用于自定义类型转换的逻辑时，重写派生类对象。
function MyNumberType(n) {
  this.n ...`,l:"audition/js/objectprototype.html#object-prototype-valueof",a:"object-prototype-valueof"},"11.32":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"11.33":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"11.34":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"11.35":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"11.36":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"11.37":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"11.38":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"11.39":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"11.40":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"11.41":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"11.42":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"11.43":{t:"\r",p:`
`,l:"audition/js/objectprototype.html#",a:""},"12.0":{t:"# promise\r",p:`
promise是es6处理异步的一种方式，它的本质是一个对象,
当我们new一个promise，此时我们需要传递一个回调函数，这个函数为立即执行的，称之为（executor）
回调有两个参数 res ...`,l:"audition/js/promise.html",a:"promise"},"12.1":{t:"reject和catch\r",p:`// 一、
promise.then((res) =&gt; {
    console.log('then:', res);
}).catch((err) =&gt; {
    console.l ...`,l:"audition/js/promise.html#reject和catch",a:"reject和catch"},"12.2":{t:"promise的状态\r",p:`
它有三种状态分别为 初始状态pending 已完成fulfilled 已失败rejected。

pending(待定)，执行了executor，状态还在等待中，没有被兑现，也没有被拒绝
fulfi ...`,l:"audition/js/promise.html#promise的状态",a:"promise的状态"},"12.3":{t:"resolve不同值的区别\r",p:`
如果resolve传入一个普通的值或者对象，只能传递接受一个参数，那么这个值会作为then回调的参数

const promise = new Promise((resolve, reject) = ...`,l:"audition/js/promise.html#resolve不同值的区别",a:"resolve不同值的区别"},"12.4":{t:"Promise的实例方法\r",p:`
实例方法，存放在Promise.prototype上的方法，也就是Promise的原型对象上，当我new Promise的时候，会把返回的该对象的 promise[[prototype]]（对象原型 ...`,l:"audition/js/promise.html#promise的实例方法",a:"promise的实例方法"},"12.5":{t:"then方法\r",p:`
then方法可以接受参数，一个参数为成功的回调，另一个参数为失败的回调。

const promise = new Promise((resolve,reject)=&gt;{
   resolve ...`,l:"audition/js/promise.html#then方法",a:"then方法"},"12.6":{t:"catch方法\r",p:`
catch的多次调用

const promise = new Promise((resolve, reject) =&gt; {
  reject('ice error')
})

promise ...`,l:"audition/js/promise.html#catch方法",a:"catch方法"},"12.7":{t:"finally方法\r",p:`无论promise状态是fulfilled还是rejected都会执行一次finally方法
const promise = new Promise((resolve, reject) =&gt; { ...`,l:"audition/js/promise.html#finally方法",a:"finally方法"},"12.8":{t:"Promise中的类方法/静态方法\r",p:`
Promise.resolve

Promise.resolve('ice')
//等价于
new Promise((resolve, reject) =&gt; resolve('ice'))

 ...`,l:"audition/js/promise.html#promise中的类方法-静态方法",a:"promise中的类方法-静态方法"},"13.0":{t:"# 运算符\r",p:"",l:"audition/js/yunsuanfu.html",a:"运算符"},"13.1":{t:"==\r",p:`相等运算符（==）检查其两个操作数是否相等，返回一个布尔值结果。与严格相等运算符（===）不同，它会比较不同类型的操作数，并尝试强制类型转换。
`,l:"audition/js/yunsuanfu.html#",a:""},"13.2":{t:"隐式转换\r",p:`相等运算符（==）最终转换为数字进行比较
&quot;a&quot; -&gt; NaN
{} -&gt; NaN
undefined -&gt; NaN
NaN -&gt; NaN
[] -&gt; ...`,l:"audition/js/yunsuanfu.html#隐式转换",a:"隐式转换"},"14.0":{t:"# Node.js\r",p:"\r",l:"audition/node/nodejs.html",a:"node-js"},"14.1":{t:"Node.js 如何处理 ES6 模块\r",p:`学习 JavaScript 语言，你会发现它有两种格式的模块。&lt;br&gt;
一种是 ES6 模块，简称 ESM；另一种是 Node.js 专用的 CommonJS 模块，简称 CJS。这两种模 ...`,l:"audition/node/nodejs.html#node-js-如何处理-es6-模块",a:"node-js-如何处理-es6-模块"},"14.2":{t:"两种模块的差异\r",p:"语法上面，CommonJS 模块使用require()加载一个模块对象和module.exports输出一个模块对象，ES6 模块使用import引入具体数据和export导出指定数据。&lt;br& ...",l:"audition/node/nodejs.html#两种模块的差异",a:"两种模块的差异"},"14.3":{t:"两种模块的区分\r",p:"Node.js 要求 ES6 模块采用.mjs后缀文件名。也就是说，只要脚本文件里面使用import或者export命令，那么就必须采用.mjs后缀名。Node.js 遇到.mjs文件，就认为它是 E ...",l:"audition/node/nodejs.html#两种模块的区分",a:"两种模块的区分"},"14.4":{t:"加载 \r",p:`ES6 模块import命令可以加载 CommonJS 模块，但是只能整体加载，不能只加载单一的输出项，但是可以这样写：
import packageMain from 'commonjs-packa ...`,l:"audition/node/nodejs.html#加载",a:"加载"},"14.5":{t:"同时支持两种格式的模块\r",p:`是在package.json文件的exports字段，指明两种格式模块各自的加载入口。
&quot;exports&quot;：{ 
    &quot;require&quot;: &quot;./ ...`,l:"audition/node/nodejs.html#同时支持两种格式的模块",a:"同时支持两种格式的模块"},"14.6":{t:"\r",p:"\r",l:"audition/node/nodejs.html#",a:""},"14.7":{t:"",p:"\r",l:"audition/node/nodejs.html#",a:""},"14.8":{t:"\r",p:"\r",l:"audition/node/nodejs.html#",a:""},"14.9":{t:"",p:`
`,l:"audition/node/nodejs.html#",a:""},"15.0":{t:"1. 存储\r",p:`cookie、localstorage和sessionStorage三者都是在开发中用到的临时存储客户端会话信息或者数据的方法
`,l:"audition/node/node的存储.html",a:"_1-存储"},"15.1":{t:"存储的时间有效期不同\r",p:`
cookie的有效期是可以设置的，默认的情况下是关闭浏览器后失效
sessionStorage的有效期是仅保持在当前页面，关闭当前会话页或者浏览器后就会失效
localStorage的有效期是在不进 ...`,l:"audition/node/node的存储.html#存储的时间有效期不同",a:"存储的时间有效期不同"},"15.2":{t:"存储的大小不同\r",p:`
cookie的存储是4kb左右，存储量较小，一般页面最多存储20条左右信息
localStorage和sessionStorage的存储容量是5Mb(官方介绍，可能和浏览器有部分差异性)

`,l:"audition/node/node的存储.html#存储的大小不同",a:"存储的大小不同"},"15.3":{t:"与服务端的通信\r",p:`
cookie会参与到与服务端的通信中，一般会携带在http请求的头部中，例如一些关键密匙验证等。
localStorage和sessionStorage是单纯的前端存储，不参与与服务端的通信

`,l:"audition/node/node的存储.html#与服务端的通信",a:"与服务端的通信"},"15.4":{t:"操作\r",p:`
cookie

cookie的创建（修改和创建相同，创建同样名称会覆盖之前的）document.cookie=&quot;username=John Doe&quot;
cookie的读取 var  ...`,l:"audition/node/node的存储.html#操作",a:"操作"},"15.5":{t:"对于浏览器的支持\r",p:`
cookie出现的时间较早，目前见到的浏览器都支持
localStorage和sessionStorage出现的时间较晚，对于版本较低的浏览器不支持(比如IE8版本以下的都不支持)

`,l:"audition/node/node的存储.html#对于浏览器的支持",a:"对于浏览器的支持"},"15.6":{t:"2. 什么是token？token是用来干嘛的 \r",p:"\r",l:"audition/node/node的存储.html#_2-什么是token-token是用来干嘛的",a:"_2-什么是token-token是用来干嘛的"},"15.7":{t:"token\r",p:"是“令牌”的意思。Token是服务端生成的一串字符串，以作客户端进行请求的一个令牌，当第一次登录后，服务器生成一个Token便将此Token返回给客户端，以后客户端只需带上这个Token前来请求数据即 ...",l:"audition/node/node的存储.html#token",a:"token"},"15.8":{t:"是用来干嘛的\r",p:`使用token机制的身份验证方法

客户端使用用户名和密码请求登录  客户端 --&gt; 服务端
服务端收到请求，验证用户名和密码   **服务端验证 --&gt; 生成token
验证成功后，服务 ...`,l:"audition/node/node的存储.html#是用来干嘛的",a:"是用来干嘛的"},"15.9":{t:"token存在哪里\r",p:`
存localStorage里，后期每次请求接口都需要把他当做一个字段传给后台，会有xss攻击
存cookie里，会自动发送，缺点不能跨域，会有csrf攻击

`,l:"audition/node/node的存储.html#token存在哪里",a:"token存在哪里"},"16.0":{t:"最全前端八股文\r",p:`这里是 html 的面试题

这里是 css 的面试题

这里是 jvavscript 的面试题

这里是 ES6 的面试题

这里是 vue 的面试题

这里是 TypeScript 的面试题

这 ...`,l:"audition/question.html",a:"最全前端八股文"},"17.0":{t:"# TypeScript\r",p:`参考
`,l:"audition/ts/ts.html",a:"typescript"},"17.1":{t:"数组\r",p:`let arr : string[] = [&quot;a&quot;,&quot;b&quot;]
let arr2：Array&lt;string&gt; = [&quot;a&quot;,&qu ...`,l:"audition/ts/ts.html#数组",a:"数组"},"17.2":{t:"函数\r",p:`//函数声明
function sun(x:number,y:number):number{
    return x+y
}
//函数表达式
let mySum:(x:number,y:number ...`,l:"audition/ts/ts.html#函数",a:"函数"},"17.3":{t:"参数\r",p:`//可选参数
function buildNmae(firstName: string, lastName?: string){
    if(lastName){
        return fi ...`,l:"audition/ts/ts.html#参数",a:"参数"},"17.4":{t:"函数重载\r",p:`函数重载或方法重载是使用相同名称和不同参数数量或类型创建多个方法的一种能力。 方法就是为同一个函数提供多个函数类型定义来进行函数重载，编译器会根据这个列表去处理函数的调用
type Combinabl ...`,l:"audition/ts/ts.html#函数重载",a:"函数重载"},"17.5":{t:"元组\r",p:`元组是 TypeScript 中特有的类型，元组最重要的特性是可以限制数组元素的个数和类型，它特别适合用来实现多值返回。
let x: [string, number]; 
// 类型必须匹配且个数必 ...`,l:"audition/ts/ts.html#元组",a:"元组"},"17.6":{t:"元祖类型的解构赋值\r",p:`let employee: [number, string?] = [1, &quot;Semlinker&quot;];
let [id, username] = employee;
console ...`,l:"audition/ts/ts.html#元祖类型的解构赋值",a:"元祖类型的解构赋值"},"17.7":{t:"void\r",p:`void表示没有任何类型，和其他类型是平等关系，不能直接赋值:
let a: void; 
let b: number = a; // Error

你只能为它赋予null和undefined（在st ...`,l:"audition/ts/ts.html#void",a:"void"},"17.8":{t:"never\r",p:`never类型表示的是那些永不存在的值的类型。
值会永不存在的两种情况：

如果一个函数执行时抛出了异常，那么这个函数永远不存在返回值（因为抛出异常会直接中断程序运行，这使得程序运行不到返回值那一步， ...`,l:"audition/ts/ts.html#never",a:"never"},"17.9":{t:"any\r",p:`在 TypeScript 中，任何类型都可以被归为 any 类型。这让 any 类型成为了类型系统的顶级类型.
`,l:"audition/ts/ts.html#any",a:"any"},"17.10":{t:"unknown\r",p:"unknown与any一样，所有类型都可以分配给unknown unknown与any的最大区别是： 任何类型的值可以赋值给any，同时any类型的值也可以赋值给任何类型。unknown 任何类型的值 ...",l:"audition/ts/ts.html#unknown",a:"unknown"},"17.11":{t:"object、Object 和 \r",p:`
小 object 代表的是所有非原始类型，也就是说我们不能把 number、string、boolean、symbol等 原始类型赋值给 object。在严格模式下，null 和 undefined ...`,l:"audition/ts/ts.html#",a:""},"17.12":{t:"类型推断\r",p:`我们把 TypeScript 这种基于赋值表达式推断类型的能力称之为类型推断
在 TypeScript 中，具有初始化值的变量、有默认值的函数参数、函数返回的类型都可以根据上下文推断出来。比如我们能根 ...`,l:"audition/ts/ts.html#类型推断",a:"类型推断"},"17.13":{t:"类型断言\r",p:`// 尖括号 语法
let someValue: any = &quot;this is a string&quot;;
let strLength: number = (&lt;string&gt; ...`,l:"audition/ts/ts.html#类型断言",a:"类型断言"},"17.14":{t:"非空断言\r",p:"在上下文中当类型检查器无法断定类型时，一个新的后缀表达式操作符 ! 可以用于断言操作对象是非 null 和非 undefined 类型。具体而言，x! 将从 x 值域中排除 null 和 undefi ...",l:"audition/ts/ts.html#非空断言",a:"非空断言"},"17.15":{t:"确定赋值断言\r",p:`允许在实例属性和变量声明后面放置一个 ! 号，从而告诉 TypeScript 该属性会被明确地赋值。为了更好地理解它的作用，我们来看个具体的例子：
let x!: number;
initialize ...`,l:"audition/ts/ts.html#确定赋值断言",a:"确定赋值断言"},"17.16":{t:"字面量类型\r",p:`TypeScript 支持 3 种字面量类型：字符串字面量类型、数字字面量类型、布尔字面量类型，对应的字符串字面量、数字字面量、布尔字面量分别拥有与其值一样的字面量类型
{
  let specifi ...`,l:"audition/ts/ts.html#字面量类型",a:"字面量类型"},"17.17":{t:"let和const分析\r",p:`将 const 定义为一个不可变更的常量，在缺省类型注解的情况下，TypeScript 推断出它的类型直接由赋值字面量的类型决定
{
  const str = 'this is string'; / ...`,l:"audition/ts/ts.html#let和const分析",a:"let和const分析"},"17.18":{t:"接口\r",p:`在面向对象语言中，接口（Interfaces）是一个很重要的概念，它是对行为的抽象，而具体如何行动需要由类（classes）去实现（implement）。
TypeScript 中的接口是一个非常灵活 ...`,l:"audition/ts/ts.html#接口",a:"接口"},"17.19":{t:"可选 | 只读属性\r",p:`interface Person {
  readonly name: string;
  age?: number;
}

只读属性用于限制只能在对象刚刚创建的时候修改其值。此外 TypeScrip ...`,l:"audition/ts/ts.html#可选-只读属性",a:"可选-只读属性"},"17.20":{t:"任意属性\r",p:`有时候我们希望一个接口中除了包含必选和可选属性之外，还允许有其他的任意属性，这时我们可以使用 索引签名 的形式来满足上述要求。
interface Person {
    name: string; ...`,l:"audition/ts/ts.html#任意属性",a:"任意属性"},"17.21":{t:"鸭式辨型法\r",p:`所谓的鸭式辨型法就是像鸭子一样走路并且嘎嘎叫的就叫鸭子，即具有鸭子特征的认为它就是鸭子，也就是通过制定规则来判定对象是否实现这个接口。
interface LabeledValue {
  label ...`,l:"audition/ts/ts.html#鸭式辨型法",a:"鸭式辨型法"},"17.22":{t:"绕开额外属性检查的方式\r",p:`
鸭式辨型法
类型断言
索引签名

`,l:"audition/ts/ts.html#绕开额外属性检查的方式",a:"绕开额外属性检查的方式"},"17.23":{t:"索引签名\r",p:`interface Props { 
  name: string; 
  age: number; 
  money?: number;
  [key: string]: any;
}

let p ...`,l:"audition/ts/ts.html#索引签名",a:"索引签名"},"17.24":{t:"interface 和 type\r",p:`
TypeScript 的核心原则之一是对值所具有的结构进行类型检查。 而接口的作用就是为这些类型命名和为你的代码或第三方代码定义数据模型。
type(类型别名)会给一个类型起个新名字。 type 有 ...`,l:"audition/ts/ts.html#interface-和-type",a:"interface-和-type"},"17.25":{t:"Objects / Functions\r",p:`两者都可以用来描述对象或函数的类型，但是语法不同
//interface
interface Point {
  x: number;
  y: number;
}

interface SetPoi ...`,l:"audition/ts/ts.html#objects-functions",a:"objects-functions"},"17.26":{t:"Other Types\r",p:`与接口不同，类型别名还可以用于其他类型，如基本类型（原始值）、联合类型、元组。
// primitive
type Name = string;

// object
type PartialPoin ...`,l:"audition/ts/ts.html#other-types",a:"other-types"},"17.27":{t:"接口可以定义多次,类型别名不可以\r",p:`与类型别名不同，接口可以定义多次，会被自动合并为单个接口。
interface Point { x: number; }
interface Point { y: number; }
const po ...`,l:"audition/ts/ts.html#接口可以定义多次-类型别名不可以",a:"接口可以定义多次-类型别名不可以"},"17.28":{t:"扩展\r",p:`两者的扩展方式不同，但并不互斥。接口可以扩展类型别名，同理，类型别名也可以扩展接口。

接口的扩展就是继承，通过 extends 来实现。类型别名的扩展就是交叉类型，通过 &amp; 来实现。

接口 ...`,l:"audition/ts/ts.html#扩展",a:"扩展"},"17.29":{t:"泛型\r",p:`用了一个 类型 T，这个 T 是一个抽象类型，只有在调用的时候才确定它的值，这就不用我们复制粘贴无数份代码了。
function identity&lt;T&gt;(arg: T): T {
  re ...`,l:"audition/ts/ts.html#泛型",a:"泛型"},"17.30":{t:"泛型约束\r",p:`类型约束使用 extends 关键字。简单来说就是你定义一个类型，然后让 T 实现这个接口即可
interface Sizeable {
  size: number;
}
function trac ...`,l:"audition/ts/ts.html#泛型约束",a:"泛型约束"},"17.31":{t:" ",p:"",l:"audition/ts/ts.html#",a:""},"17.32":{t:"泛型工具\r",p:`

typeof
typeof 的主要用途是在类型上下文中获取变量或者属性的类型


keyof
keyof 操作符是在 TypeScript 2.1 版本引入的，该操作符可以用于获取某种类型的所有键 ...`,l:"audition/ts/ts.html#泛型工具",a:"泛型工具"},"18.0":{t:"# vue-router\r",p:`官方文档
`,l:"audition/vue/vue-router.html",a:"vue-router"},"18.1":{t:"vue-router\r",p:"",l:"audition/vue/vue-router.html#vue-router",a:"vue-router"},"18.2":{t:"vue-router是什么，描述一下它的原理？\r",p:`Vue Router是Vue官方的路由管理器，有hash和history两种模式

hash模式是通过监听hashchange事件来实现更新页面部分内容的操作，url后面会带有#号
history模式 ...`,l:"audition/vue/vue-router.html#vue-router是什么-描述一下它的原理",a:"vue-router是什么-描述一下它的原理"},"18.3":{t:"如何实现\r",p:"vue-router中有个监听器，用来监听History的变化（浏览器地址改变、点击前进后退按钮）。当监听到History变化之后，vue-router就会依据路由表当中声明了的路由对应匹配的组件，然 ...",l:"audition/vue/vue-router.html#如何实现",a:"如何实现"},"18.4":{t:"hash模式\r",p:"即url中的#以及后面部分，#相当于一个锚点，#后面的内容就是锚点值，当监听锚点值的变化就会改变局部的页面数据。当浏览器向服务器发送请求时，只会把#前面部分发送给服务器，一般前面部分的是不变的，所以h ...",l:"audition/vue/vue-router.html#hash模式",a:"hash模式"},"18.5":{t:"history模式\r",p:"HTML5 Mode是html5新增 history模式，所以也称为history 模式。history 模式改变 url 的方式会导致浏览器向服务器发送请求，但是history 模式可以传输复杂一些 ...",l:"audition/vue/vue-router.html#history模式",a:"history模式"},"18.6":{t:"路由跳转方式有哪些？\r",p:`
内置组件跳转
router.push({ path: '/home' }),router.replace({ path: '/home' })

`,l:"audition/vue/vue-router.html#路由跳转方式有哪些",a:"路由跳转方式有哪些"},"18.7":{t:"说一下路由守卫？\r",p:`
为什么：如果需要用户登陆，我们来守卫页面，强制用户跳转到登录页面

路由守卫分为全局路由守卫，路由独享守卫，组件路由守卫

全局路由守卫

全局前置守卫beforeEach,接收to、from、ne ...`,l:"audition/vue/vue-router.html#说一下路由守卫",a:"说一下路由守卫"},"18.8":{t:"完整的导航解析流程\r",p:`
导航被触发。
在失活的组件里调用 beforeRouteLeave 守卫。
调用全局的 beforeEach 守卫。
在重用的组件里调用 beforeRouteUpdate 守卫(2.2+)。
在路 ...`,l:"audition/vue/vue-router.html#完整的导航解析流程",a:"完整的导航解析流程"},"18.9":{t:"懒加载\r",p:`为给客户更好的客户体验，首屏组件加载速度更快一些，解决白屏问题，懒加载简单来说就是延迟加载或按需加载，即在需要的时候的时候进行加载。
也就是，组件现在路由里注册但不进行组件的加载与执行，等到需要访问组 ...`,l:"audition/vue/vue-router.html#懒加载",a:"懒加载"},"18.10":{t:"懒加载实现\r",p:`
懒加载实现的前提：ES6的动态加载模块 - import（），调用import（）之处，被作为分离的模块起点，意思是，被请求的模块和它引用的所有子模块，会分离到一个单独的 chunk 中。

`,l:"audition/vue/vue-router.html#懒加载实现",a:"懒加载实现"},"18.11":{t:"Vue-router路由懒加载的方式\r",p:`
vue-router配置路由，使用vue的异步组件技术，可以实现懒加载，此时一个组件会生成一个js文件。
component: resolve =&gt; require(['放入需要加载的路由地址 ...`,l:"audition/vue/vue-router.html#vue-router路由懒加载的方式",a:"vue-router路由懒加载的方式"},"18.12":{t:"路由元信息\r",p:`将任意信息附加到路由上，如过渡名称、谁可以访问路由等。这些事情可以通过接收属性对象的meta属性来实现，并且它可以在路由地址和导航守卫上都被访问到。
`,l:"audition/vue/vue-router.html#路由元信息",a:"路由元信息"},"18.13":{t:"数据获取\r",p:`有时候，进入某个路由后，需要从服务器获取数据。例如，在渲染用户信息时，你需要从服务器获取用户的数据。我们可以通过两种方式来实现：

导航完成之后获取：先完成导航，然后在接下来的组件生命周期钩子中获取数 ...`,l:"audition/vue/vue-router.html#数据获取",a:"数据获取"},"19.0":{t:"# vue\r",p:"\r",l:"audition/vue/vue.html",a:"vue"},"19.1":{t:"单页面应用\r",p:`单页应用(SPA - single page application)

只在第一次加载页面时，返回唯一的html页面和它的公共静态资源，后续的页面跳转都不会从服务端拿html文件。（hash和his ...`,l:"audition/vue/vue.html#单页面应用",a:"单页面应用"},"19.2":{t:"vue生命周期\r",p:`


Vue2(选项式API)
Vue3(setup)(选项式API)
描述




beforeCreate
-
实例创建前


created
-
实例创建后


beforeMount
onBe ...`,l:"audition/vue/vue.html#vue生命周期",a:"vue生命周期"},"19.3":{t:"vue父子组件生命周期\r",p:`
渲染过程
父beforeCreate -&gt; 父created -&gt; 父beforeMount -&gt; 子beforeCreate -&gt; 子created -&gt; 子befo ...`,l:"audition/vue/vue.html#vue父子组件生命周期",a:"vue父子组件生命周期"},"19.4":{t:"注意\r",p:`如果子组件是异步组件的话它们的执行顺序会发生改变，会先执行完父组件的生命周期然后再执行子组件的生命周期
`,l:"audition/vue/vue.html#注意",a:"注意"},"19.5":{t:"v-if和v-show\r",p:`
v-if表示一个dom元素是否被创建，而v-show则是控制这个dom元素的display属性是否为none
一般在频繁切换状态的地方使用v-show,v-if则更适合条件不经常改变的场景，因为它切 ...`,l:"audition/vue/vue.html#v-if和v-show",a:"v-if和v-show"},"19.6":{t:"v-for和v-if优先级\r",p:`
开发过程中一般不建议同时将v-for和v-if放在一个标签中使用
Vue2中v-for的优先级会更高，所以会先执行循环，再进行v-if判断，所以这样就会导致无论需不需展示这个元素，都会先遍历整个列表 ...`,l:"audition/vue/vue.html#v-for和v-if优先级",a:"v-for和v-if优先级"},"19.7":{t:"说一下computed和watch\r",p:`
computed是计算属性,当一个属性受一个或者多个属性影响的时候可以使用.watch是侦听器,当我们需要根据一个属性的变化而做出一些处理的时候,可以使用watch来对这个属性进行监听
comput ...`,l:"audition/vue/vue.html#说一下computed和watch",a:"说一下computed和watch"},"19.8":{t:"computed和methods的区别？\r",p:`computed和methods的差异是它具备缓存性，如果依赖项不变时不会重新计算。
`,l:"audition/vue/vue.html#computed和methods的区别",a:"computed和methods的区别"},"19.9":{t:"computed和watch使用场景\r",p:`
计算属性computed常用场景是简化在template模板中的复杂表达式，模板中出现太多逻辑判断会造成模板不易维护。
computed不支持异步
都是以 Vue 的依赖追踪机制为基础，当某个依赖数 ...`,l:"audition/vue/vue.html#computed和watch使用场景",a:"computed和watch使用场景"},"19.10":{t:"computed的原理\r",p:`computed 的实现是基于 Watcher 实例对象(被观察者)的
`,l:"audition/vue/vue.html#computed的原理",a:"computed的原理"},"19.11":{t:"computed的两种定义方式\r",p:`一种是方法，另一种是 get，set 属性。而且，其内部监听的对象必须是已经定义响应式的属性，比如 data 的属性、vuex 的属性。
`,l:"audition/vue/vue.html#computed的两种定义方式",a:"computed的两种定义方式"},"19.12":{t:"computed属性的初始化\r",p:`
vue 在创建 computed 属性时候，遍历computed属性，为每个computed属性都创建一个watcher,对每个computed属性进行get劫持
get劫持是最关键的步骤

将co ...`,l:"audition/vue/vue.html#computed属性的初始化",a:"computed属性的初始化"},"19.13":{t:"依赖收集的时机\r",p:`computed 收集时机和 data 一样，是在组件挂载前，但是其收集对象是自己属性对应的 watch，而 data 本身所有数据对应一个 watch。
`,l:"audition/vue/vue.html#依赖收集的时机",a:"依赖收集的时机"},"19.14":{t:"watch和watchEffect区别和用法\r",p:`
watch 那样接收一个明确的数据源,watchEffect 也是一个监听器,它只接收一个回调函数。而在这个回调函数当中，它会自动监听响应数据，当回调函数里面的响应数据发生变化，回调函数就会立即执行 ...`,l:"audition/vue/vue.html#watch和watcheffect区别和用法",a:"watch和watcheffect区别和用法"},"19.15":{t:"vue2和vue3区别\r",p:`
写法上的区别:vue2使用的是options(选项)Api,vue3的是composition Api(当然vue3也兼容composition api)。options Api中methods，c ...`,l:"audition/vue/vue.html#vue2和vue3区别",a:"vue2和vue3区别"},"19.16":{t:"vue插件使用\r",p:`将组件实例挂载到全局，
vue实例会有一个use函数,它接受的是一个带有install函数的对象和一个可选的选项对象,当我们使用 vue.use(plugin)或者app.use(plugin)会调用 ...`,l:"audition/vue/vue.html#vue插件使用",a:"vue插件使用"},"19.17":{t:"vue插槽\r",p:`插槽slot可以理解为占坑，当使用一个组件的时候，在组件标签里的对应的内容就会替换掉这个组件中的slot标签。

插槽分为默认插槽，具名插槽，作用域插槽。
默认插槽 子组件中用slot标签来确定渲染位 ...`,l:"audition/vue/vue.html#vue插槽",a:"vue插槽"},"19.18":{t:"组件通信\r",p:`


方式
Vue2
Vue3




父传子
props
props


子传父
$emit
emits


父传子
$attrs
attrs


子传父
$listeners
无(合并到 attr ...`,l:"audition/vue/vue.html#组件通信",a:"组件通信"},"19.19":{t:"vuex\r",p:`
Vuex是Vue中的全局状态管理框架，它可以管理应用的所有组件的状态。并不是每个项目都需要引入Vuex的，当我们的项目有很多个页面，并且这些页面共享着多个数据状态，此时我们可以引入Vuex。
Vue ...`,l:"audition/vue/vue.html#vuex",a:"vuex"},"19.20":{t:"pinia\r",p:`
创建Store，import {defineStore} from 'pinia',

import {defineStore} from 'pinia'
exporet default mySto ...`,l:"audition/vue/vue.html#pinia",a:"pinia"},"19.21":{t:"调用其他store\r",p:`在 action 里调用其他 store 里的 action 也比较简单，引入对应的 store 后即可访问其内部的方法了。
// src/store/app.ts

export const use ...`,l:"audition/vue/vue.html#调用其他store",a:"调用其他store"},"19.22":{t:"vue自定义指令\r",p:`vue自定义指令
`,l:"audition/vue/vue.html#vue自定义指令",a:"vue自定义指令"},"19.23":{t:"keep-alive\r",p:`&lt;KeepAlive&gt; 是一个内置组件，它的功能是在多个组件间动态切换时缓存被移除的组件实例。

通常我们切换组件的时候，上一个组件就会被销毁，而当我们使用&lt;KeepAlive&gt ...`,l:"audition/vue/vue.html#keep-alive",a:"keep-alive"},"19.24":{t:"activated\r",p:`
首次执行执行顺序：created =&gt; mounted =&gt; activated ...
第二次或以后使用组件时触发activated， beforeCreate created bef ...`,l:"audition/vue/vue.html#activated",a:"activated"},"19.25":{t:"deactivated\r",p:`
使用了keep-alive就不会调用beforeDestroy(组件销毁前钩子)和destroyed(组件销毁)，因为组件没被销毁，被缓存起来了。

`,l:"audition/vue/vue.html#deactivated",a:"deactivated"},"19.26":{t:"vue2混入-Mixin\r",p:`混入 (mixin) 提供了一种非常灵活的方式，来分发 Vue 组件中的可复用功能。一个混入对象可以包含任意组件选项。当组件使用混入对象时，所有混入对象的选项将被“混合”进入该组件本身的选项。

Mi ...`,l:"audition/vue/vue.html#vue2混入-mixin",a:"vue2混入-mixin"},"19.27":{t:"`Object.defineProperty`和`proxy`区别\r",p:`
Object.defineProperty 只能代理属性，Proxy 代理的是对象。
对象上新增属性，Proxy可以监听到，Object.defineProperty不能。
Object.defin ...`,l:"audition/vue/vue.html#object-defineproperty-和-proxy-区别",a:"object-defineproperty-和-proxy-区别"},"19.28":{t:"vue3内置组件\r",p:`vue3新增了两个内置组件分别是Teleport和Suspense。
`,l:"audition/vue/vue.html#vue3内置组件",a:"vue3内置组件"},"19.29":{t:"teleport\r",p:`可以称之为传送门，作用将其插槽内容渲染到 DOM 中的另一个位置，接收两个参数to（要去的位置）和disabled（是否留在原位置）。接收比如下面代码
&lt;teleport to=&quot;#p ...`,l:"audition/vue/vue.html#teleport",a:"teleport"},"19.30":{t:"Suspense组件\r",p:`
&lt;Suspense&gt; 组件用于协调对组件树中嵌套的异步依赖的处理。
它一般用于包裹多个异步组件处理多个异步组件加载前与完成后的统一状态
&lt;Suspense&gt; 组件有两个插槽： ...`,l:"audition/vue/vue.html#suspense组件",a:"suspense组件"},"19.31":{t:"nextTick及原理\r",p:"",l:"audition/vue/vue.html#nexttick及原理",a:"nexttick及原理"},"19.32":{t:"vue中的nextTick是干什么用的?\r",p:`在下次 DOM 更新循环结束之后执行延迟回调。在修改数据之后立即使用这个方法，获取更新后的 DOM。
这是什么意思呢,其实vue中修改data不会立刻触发dom更新;而是把需要更新的Watcher加入 ...`,l:"audition/vue/vue.html#vue中的nexttick是干什么用的",a:"vue中的nexttick是干什么用的"},"19.33":{t:"vue虚拟dom,diff算法\r",p:"",l:"audition/vue/vue.html#vue虚拟dom-diff算法",a:"vue虚拟dom-diff算法"},"19.34":{t:"什么是虚拟dom？\r",p:`每当我们用原生JS或者JQ操作DOM时，浏览器会从头开始进行DOM树的构建，频繁的操作DOM开销是很大的。
而虚拟DOM就是为了减少这些操作的，虚拟DOM首先会通过状态生成一个虚拟节点树（js对象）， ...`,l:"audition/vue/vue.html#什么是虚拟dom",a:"什么是虚拟dom"},"19.35":{t:"说一下diff算法（对比两棵vdom 树，找到有差异的部分）\r",p:`在vue中是当状态发生改变，用来计算改变后的虚拟DOM与改变前的虚拟DOM之间的差异的算法。
diff算法的本质是找出两个对象之间的差异，目的是尽可能复用节点，也就是通过移动代替新增。
两棵树的 di ...`,l:"audition/vue/vue.html#说一下diff算法-对比两棵vdom-树-找到有差异的部分",a:"说一下diff算法-对比两棵vdom-树-找到有差异的部分"},"19.36":{t:"props使用，透传\r",p:`
props 父传子 在父组件里引用的子组件上使用v-bind或：传给子组件，子组件用const props = defineProps([&quot;isShow&quot;])接收
可透传：在上级 ...`,l:"audition/vue/vue.html#props使用-透传",a:"props使用-透传"},"19.37":{t:"emit\r",p:`
定义一个方法,将参数hide传递给父组件，父组件通过@hide监听并接收参数。
可透传

子组件children.vue
const emit = defineEmit([&quot;hide&qu ...`,l:"audition/vue/vue.html#emit",a:"emit"},"20.0":{t:"# vue 的响应式\r",p:"\r",l:"audition/vue/vue响应式原理.html",a:"vue-的响应式"},"20.1":{t:"观察者模式和发布订阅模式\r",p:"\r",l:"audition/vue/vue响应式原理.html#观察者模式和发布订阅模式",a:"观察者模式和发布订阅模式"},"20.2":{t:"什么是观察者模式\r",p:"当对象之间存在一对多的依赖关系时，其中一个对象的状态发生改变，所有依赖它的对象都会收到通知，这就是观察者模式。在观察者模式中，只有两种主体：目标对象 (Object) 和 观察者 (Observer) ...",l:"audition/vue/vue响应式原理.html#什么是观察者模式",a:"什么是观察者模式"},"20.3":{t:"什么是发布订阅模式\r",p:"基于一个事件（主题）通道，希望接收通知的对象 Subscriber 通过自定义事件订阅主题，被激活事件的对象 Publisher 通过发布主题事件的方式通知各个订阅该主题的 Subscriber 对象 ...",l:"audition/vue/vue响应式原理.html#什么是发布订阅模式",a:"什么是发布订阅模式"},"20.4":{t:"vue2的响应式原理\r",p:"大意：通过observe里的defineReactive方法里面的Object.defineProperty方法的get（读取数据触发，收集依赖）和set（修改数据触发，派发更新依赖）进行响应式的绑定 ...",l:"audition/vue/vue响应式原理.html#vue2的响应式原理",a:"vue2的响应式原理"},"20.5":{t:"Vue2 响应系统\r",p:`其核心有三点：observe（响应式）、watcher(依赖)、dep（依赖管理）
在 vue2 初始化数据 data 和 computed 数据过程中。会涉及到以下几个对象：

Observe （响 ...`,l:"audition/vue/vue响应式原理.html#vue2-响应系统",a:"vue2-响应系统"},"20.6":{t:"Vue2 observe（响应式）\r",p:"\r",l:"audition/vue/vue响应式原理.html#vue2-observe-响应式",a:"vue2-observe-响应式"},"20.7":{t:"Object.defineProperty 数据劫持、数据代理\r",p:`被Object.defineProperty绑定过的对象，会变成「响应式」化。也就是改变这个对象的时候会触发get和set事件。进而触发一些视图更新。
const obj = {}

let val  ...`,l:"audition/vue/vue响应式原理.html#object-defineproperty-数据劫持、数据代理",a:"object-defineproperty-数据劫持、数据代理"},"20.8":{t:"defineReactive\r",p:`我们需要一个全局的变量来保存这个属性的值
// value使用了参数默认值
function defineReactive(data, key, value = data[key]) {
  cons ...`,l:"audition/vue/vue响应式原理.html#definereactive",a:"definereactive"},"20.9":{t:"observe\r",p:`如果obj有多个属性呢？我们可以新建一个类Observer来遍历该对象，Vue中用Observer类来管理上述响应式化Object.defineProperty的过程。
class Observer  ...`,l:"audition/vue/vue响应式原理.html#observe",a:"observe"},"20.10":{t:"数组是怎么做到响应式的\r",p:"改写了Array.prototype叫arraymothods，以Array.prototype为原型，创建了arraymothods的对象以object.setPrototypeOf强制让vue的数 ...",l:"audition/vue/vue响应式原理.html#数组是怎么做到响应式的",a:"数组是怎么做到响应式的"},"20.11":{t:"Vue2 watcher\r",p:`
dep收集的依赖就是watcher

2. observe中在数据被读的时候，触发getter方法，执行Dep来收集watcher（依赖），此时watcher在dep集合里
3. Dep使用发布订阅 ...`,l:"audition/vue/vue响应式原理.html#vue2-watcher",a:"vue2-watcher"},"20.12":{t:"watcher和数据之间的关系\r",p:`watcher订阅一个或多个数据，数据称为wacther的依赖，数据变化时（setter方法）通知watcher，watcher收到后执行回调，通知组件,通过虚拟dom和diff算法进行页面更新
!w ...`,l:"audition/vue/vue响应式原理.html#watcher和数据之间的关系",a:"watcher和数据之间的关系"},"20.13":{t:"watcher依赖的数据改变方式有\r",p:`
直接渲染render，
有通过computed计算属性改变

常见的场景有下面这几个：

数据变 → 使用数据的视图变
数据变 → 使用数据的计算属性变 → 使用计算属性的视图变
数据变 → 开发者 ...`,l:"audition/vue/vue响应式原理.html#watcher依赖的数据改变方式有",a:"watcher依赖的数据改变方式有"},"20.14":{t:"Vue2 dep\r",p:`使用发布订阅者模式

每个属性拥有自己的消息订阅器 dep，dep类里的this.subs=[],数组里存放所有订阅了该属性的观察者对象watcher,
我们通过defineReactive方法将da ...`,l:"audition/vue/vue响应式原理.html#vue2-dep",a:"vue2-dep"},"20.15":{t:"DEP怎么收集依赖的\r",p:`我们如何知道data中的某个属性被使用了，答案就是Object.defineProperty，因为读取某个属性就会触发get方法。可以将代码进行如下改造：
function defineReactiv ...`,l:"audition/vue/vue响应式原理.html#dep怎么收集依赖的",a:"dep怎么收集依赖的"},"20.16":{t:"vue3 的响应式原理\r",p:`因为 Object.definePorperty 只能对 对象的已知属性 进行操作，所有才会导致 没有在 data 中进行声明的对象属性直接赋值时无法触发视图更新

碍于 Object.defineP ...`,l:"audition/vue/vue响应式原理.html#vue3-的响应式原理",a:"vue3-的响应式原理"},"20.17":{t:"vue3 proxy\r",p:`Vue3 的响应式原理依赖了 Proxy 这个核心 API，通过 Proxy 可以劫持对象的某些操作。
const obj = { a: 1 };
const p = new Proxy(obj, { ...`,l:"audition/vue/vue响应式原理.html#vue3-proxy",a:"vue3-proxy"},"20.18":{t:"vue3的收集依赖\r",p:`get时，收集不同代理对象不同属性所依赖的副作用函数
set时，取出当前属性所依赖的所有副作用函数，重新执行
!内部的执行过程

调用 reactive() 返回一个 Proxy 代理对象，并劫持对象 ...`,l:"audition/vue/vue响应式原理.html#vue3的收集依赖",a:"vue3的收集依赖"},"20.19":{t:"vue3 reactive\r",p:`reactive 会返回如下一个 Proxy 对象
const reactive = (target) =&gt; {
  return new Proxy(target, {
    get(tar ...`,l:"audition/vue/vue响应式原理.html#vue3-reactive",a:"vue3-reactive"},"20.20":{t:"vue3 effect\r",p:"首先定义全局的 activeEffect，它永远指向当前正在执行的 effect 副作用函数。effect 为 fn 创建一个内部的副作用函数，然后立即执行，此时会触发对象的 get 操作，调用 tr ...",l:"audition/vue/vue响应式原理.html#vue3-effect",a:"vue3-effect"},"20.21":{t:"vue3 track\r",p:`track 会建立一个 对象（state） =&gt; 属性（counter） =&gt; effect 的一个依赖关系
const targetMap = new WeakMap();
functi ...`,l:"audition/vue/vue响应式原理.html#vue3-track",a:"vue3-track"},"20.22":{t:"vue3 trigger\r",p:`数据变化的时候就会触发代理对象的 set 操作，从而调用 trigger 方法
function trigger(target, key) {
  const depsMap = targetMap. ...`,l:"audition/vue/vue响应式原理.html#vue3-trigger",a:"vue3-trigger"},"20.23":{t:"副作用函数\r",p:"如果函数依赖于外部的状态，无法保证输出相同，就会带来副作用。Vue 通过一个副作用（effect）函数来跟踪当前正在运行的函数。副作用是一个函数包裹器，在函数被调用前就启动跟踪，而 Vue 在派发更新 ...",l:"audition/vue/vue响应式原理.html#副作用函数",a:"副作用函数"},"20.24":{t:"vue2/3的响应式原理比较\r",p:`
在 Vue 中体现最为明显的一点就是：Proxy 代理对象之后不仅可以拦截对象属性的读取、更新、方法调用之外，对整个对象的新增、删除、枚举等也能直接拦截，而 Object.definePropert ...`,l:"audition/vue/vue响应式原理.html#vue2-3的响应式原理比较",a:"vue2-3的响应式原理比较"},"20.25":{t:"vue3响应式核心方法\r",p:`响应式数据声明的核心API，ref,shallowRef,reactive,shallowReactive,readonly,shallowReadonly

shallow浅层作用形式,整个定义 类 ...`,l:"audition/vue/vue响应式原理.html#vue3响应式核心方法",a:"vue3响应式核心方法"},"20.26":{t:"核心方法注意\r",p:`
ref 虽然常常有文章说一般只用来 声明基础数据的响应式，但是其实所有的数据类型声明响应式时都可以使用ref，只是内部为了同时实现基础数据的响应式处理，封装成了一个具有 value 属性的对象，所以 ...`,l:"audition/vue/vue响应式原理.html#核心方法注意",a:"核心方法注意"},"20.27":{t:"activeEffect和effect\r",p:`
activeEffect自动把effect函数收集起来放进对应的dep里
effect副作用函数，函数收集起来放进dep里

let activeEffect
function effect(fn) ...`,l:"audition/vue/vue响应式原理.html#activeeffect和effect",a:"activeeffect和effect"},"20.28":{t:"track函数\r",p:"track函数用来把effect函数收集起来放进dep里，dep为什么用Set呢？因为Set可以自动去重。搜集起来之后，以后只要变量一改变，就执行trigger函数通知dep里所有依赖money变量的 ...",l:"audition/vue/vue响应式原理.html#track函数",a:"track函数"},"20.29":{t:"trigger\r",p:`function trigger(target,key){
    let depsMap = targetMAP.get(target)
    if(depsMap){
        let d ...`,l:"audition/vue/vue响应式原理.html#trigger",a:"trigger"},"20.30":{t:"Map\r",p:`对象里每一个属性都有一个dep，用Map用来存储dep
`,l:"audition/vue/vue响应式原理.html#map",a:"map"},"20.31":{t:"WeakMap\r",p:`来存储每个对象对应的Map
`,l:"audition/vue/vue响应式原理.html#weakmap",a:"weakmap"},"20.32":{t:"reactive\r",p:`receiver相当于proxy代理的对象，替代原对象target，在receiver上访问和修改
function reactive(target){
    const handler = {
  ...`,l:"audition/vue/vue响应式原理.html#reactive",a:"reactive"},"20.33":{t:"Reflect\r",p:`
get(target, key, receiver)：个人理解就是，访问target的key属性，但是this是指向receiver，所以实际是访问的值是receiver的key的值，但是这可不是直 ...`,l:"audition/vue/vue响应式原理.html#reflect",a:"reflect"},"20.34":{t:"proxy和Reflect\r",p:`
Proxy和Reflect的方法都是一一对应的，在Proxy里使用Reflect会提高语义化
Proxy的get对应Reflect.get
Proxy的set对应Reflect.set

`,l:"audition/vue/vue响应式原理.html#proxy和reflect",a:"proxy和reflect"},"21.0":{t:"# vue自定义指令\r",p:`vue 官方提供了v-text、v-for、v-model、v-if 等常用的指令。除此之外vue 还允许开发者自定义指令。面试经常会问什么是自定义指令?你用自定义指令做过哪些功能?
`,l:"audition/vue/vue自定义指令/vue自定义指令.html",a:"vue自定义指令"},"21.1":{t:"什么是自定义指令?\r",p:`vue 允许开发者自定义指令
`,l:"audition/vue/vue自定义指令/vue自定义指令.html#什么是自定义指令",a:"什么是自定义指令"},"21.2":{t:"自定义组件注册\r",p:"vue中指令的注册和组件的注册一样，提供了全局注册和局部注册两种方式，全局注册就是指我们定义的指令可以在项目中任意地方都可以使用，局部注册则意味着只能在注册的当前组件中使用。接下来我们就来学习这两种注 ...",l:"audition/vue/vue自定义指令/vue自定义指令.html#自定义组件注册",a:"自定义组件注册"},"21.3":{t:"钩子函数\r",p:`
directive的第二个参数是钩子函数对象

const myDirective = {
  // 在绑定元素的 attribute 前 或事件监听器应用前调用
  created(el, bin ...`,l:"audition/vue/vue自定义指令/vue自定义指令.html#钩子函数",a:"钩子函数"},"21.4":{t:"注意\r",p:`
当在组件上使用自定义指令时，它会始终应用于组件的根节点，和透传 attributes 类似。
在vue3中如果组件有多个根结点，则指令将会被忽略且抛出一个警告。
组件的一个根结点就是在一个&lt;d ...`,l:"audition/vue/vue自定义指令/vue自定义指令.html#注意",a:"注意"},"21.5":{t:"指令的使用\r",p:"\r",l:"audition/vue/vue自定义指令/vue自定义指令.html#指令的使用",a:"指令的使用"},"21.6":{t:"在`main.js`中引入指令文件\r",p:`全局挂载
import { createApp } from 'vue'
import App from './App.vue'
import vDebounce from '指令地址.js';
co ...`,l:"audition/vue/vue自定义指令/vue自定义指令.html#在-main-js-中引入指令文件",a:"在-main-js-中引入指令文件"},"21.7":{t:"常用自定义指令",p:"",l:"audition/vue/vue自定义指令/vue自定义指令.html#常用自定义指令",a:"常用自定义指令"},"22.0":{t:"# v-copy\r",p:`const vCopy = {
    beforeMount(el, binding) {
        el.copyContent = binding.value
        el.add ...`,l:"audition/vue/vue自定义指令/常用自定义指令/一键复制.html",a:"v-copy"},"23.0":{t:"# v-debounce\r",p:`

`,l:"audition/vue/vue自定义指令/常用自定义指令/防抖.html",a:"v-debounce"},"24.0":{t:"# 最全前端代码",p:"",l:"code/introductor.html",a:"最全前端代码"},"25.0":{t:"# vue3响应式proxy\r",p:`let activeEffect
function effect(fn){
    activeEffect = fn
    activeEffect()
    activeEffect=null ...`,l:"code/vue3响应式/vue3响应式.html",a:"vue3响应式proxy"},"26.0":{t:"# v-copy\r",p:`const vCopy = {
    beforeMount(el, binding) {
        el.copyContent = binding.value
        el.add ...`,l:"code/vue的自定义指令/一键复制.html",a:"v-copy"},"27.0":{t:"# v-debounce\r",p:`

`,l:"code/vue的自定义指令/防抖.html",a:"v-debounce"},"28.0":{t:"# 创建对象\r",p:"\r",l:"code/创建对象/creatobj.html",a:"创建对象"},"28.1":{t:"直接创建\r",p:`let current = {
    name: 'John',
    age: 20
}
console.log(current)

`,l:"code/创建对象/creatobj.html#直接创建",a:"直接创建"},"28.2":{t:"new object()创建\r",p:`let obj = new Object()
obj.name = 'John'
obj.age = 20

console.log(obj)

`,l:"code/创建对象/creatobj.html#new-object-创建",a:"new-object-创建"},"28.3":{t:"工厂方法1\r",p:`function createPerson(name, age) {
    // let o = new Object()
    return {
        name,
        ag ...`,l:"code/创建对象/creatobj.html#工厂方法1",a:"工厂方法1"},"28.4":{t:"工厂方法2\r",p:`function createPerson2(name, age) {
    let o = new Object()
    o.name = name
    o.age = age
    r ...`,l:"code/创建对象/creatobj.html#工厂方法2",a:"工厂方法2"},"28.5":{t:"构造函数\r",p:`function Person(name, age) {
    this.name = name
    this.age = age
}

let john3 = new Person('John ...`,l:"code/创建对象/creatobj.html#构造函数",a:"构造函数"},"28.6":{t:"原型（待定）\r",p:`function Person2() {
    
}
Person2.prototype.name = &quot;John&quot;
Person2.prototype.age = 28

le ...`,l:"code/创建对象/creatobj.html#原型-待定",a:"原型-待定"},"29.0":{t:"# 排序算法\r",p:"\r",l:"code/排序/排序.html",a:"排序算法"},"29.1":{t:"冒泡\r",p:`不多说闭着眼也写得出来
function bubblesort(arr) {
    for (var i = 0; i &lt; arr.length; i++) {
        for (va ...`,l:"code/排序/排序.html#冒泡",a:"冒泡"},"29.2":{t:"选择排序\r",p:`从i = 0开始从后面挑一个比a[i]小的且是最小的数与a[i]交换位置
function selectsort(arr) {
    for (var i = 0; i &lt; arr.lengt ...`,l:"code/排序/排序.html#选择排序",a:"选择排序"},"29.3":{t:"插入排序\r",p:`默认第一个元素被排好序，从第二个元素开始依次与之前的元素比较，指到比较到如果大于当前的的元素则退出循环，插入到当前的的元素的下一位
function insertsort(arr){
    for( ...`,l:"code/排序/排序.html#插入排序",a:"插入排序"},"29.4":{t:"希尔排序\r",p:"取一个增量gap，然后将所有距离为gap的元素分在同一组，并对每一组的元素进行直接插入排序。然后再取一个比第一增量小的整数作为第二增量，重复上述操作…,当增量的大小减到1时，就相当于整个序列被分到一组 ...",l:"code/排序/排序.html#希尔排序",a:"希尔排序"},"29.5":{t:"快速排序\r",p:`找到一个主元pivot的key和value，一般是中间的，让数组形成左边是小于key右边是大于key，然后左边的和右边的递归继续排序
function quicksort (arr){
    let ...`,l:"code/排序/排序.html#快速排序",a:"快速排序"},"30.0":{t:"# 哈希表\r",p:"\r",l:"code/数据结构/哈希/hash.html",a:"哈希表"},"30.1":{t:"哈希函数\r",p:`function hashFunc(str, size) {
    let hash = 0
    for (let i = 0; i &lt; str.length; i++) {
       ...`,l:"code/数据结构/哈希/hash.html#哈希函数",a:"哈希函数"},"30.2":{t:"put\r",p:`hashTable.prototype.put = function (key, value) {
    let index = hashFunc(key, this.limit)
    let  ...`,l:"code/数据结构/哈希/hash.html#put",a:"put"},"30.3":{t:"get\r",p:`hashTable.prototype.get = function (key) {
    let index = hashFunc(key, this.limit)
    let bucket  ...`,l:"code/数据结构/哈希/hash.html#get",a:"get"},"30.4":{t:"remove\r",p:`hashTable.prototype.remove = function (key) {
    let index = hashFunc(key, this.limit)
    let buck ...`,l:"code/数据结构/哈希/hash.html#remove",a:"remove"},"30.5":{t:"判断质数\r",p:`//判断质数
hashTable.prototype.isPrime= function(num) {
    let temp = parseInt(Math.sqrt(num));
    for ...`,l:"code/数据结构/哈希/hash.html#判断质数",a:"判断质数"},"30.6":{t:"得到质数\r",p:`hashTable.prototype.getPrime= function(num) {
    while(!this.isPrime(num)){
        num++
    }
    ...`,l:"code/数据结构/哈希/hash.html#得到质数",a:"得到质数"},"30.7":{t:"其他\r",p:`hashTable.prototype.isEmpty = function () {
    return this.count == 0
}

hashTable.prototype.size = ...`,l:"code/数据结构/哈希/hash.html#其他",a:"其他"},"31.0":{t:"# 栈\r",p:`普通构造函数封装
function Stack() {
    this.arr = [];

}

Stack.prototype.push = function(element) {
    th ...`,l:"code/数据结构/栈/栈.html",a:"栈"},"31.1":{t:"例子\r",p:`十进制转二进制
function dec2bin (number){
    const stack = new Stack()
    while (number &gt; 0) {
        ...`,l:"code/数据结构/栈/栈.html#例子",a:"例子"},"32.0":{t:"# 二叉搜索树\r",p:"",l:"code/数据结构/树/二叉搜索树.html",a:"二叉搜索树"},"32.1":{t:"什么是二叉搜索树?\r",p:`

二叉搜索树（BST，Binary Search Tree），也称二叉排序树或二叉查找树


二叉搜索树是一颗二叉树, 可以为空；如果不为空，满足以下性质：

非空左子树的所有键值小于其根结点的键值 ...`,l:"code/数据结构/树/二叉搜索树.html#什么是二叉搜索树",a:"什么是二叉搜索树"},"32.2":{t:"二叉搜索树的特点:\r",p:`
二叉搜索树的特点就是相对较小的值总是保存在左结点上, 相对较大的值总是保存在右结点上.
那么利用这个特点, 我们可以做什么事情呢?
查找效率非常高, 这也是二叉搜索树中, 搜索的来源.

`,l:"code/数据结构/树/二叉搜索树.html#二叉搜索树的特点",a:"二叉搜索树的特点"},"32.3":{t:"二叉搜索树常见的操作\r",p:`
insert(key)：向树中插入一个新的键。
search(key)：在树中查找一个键，如果结点存在，则返回true；如果不存在，则返回false。
inOrderTraverse：通过中序遍历方 ...`,l:"code/数据结构/树/二叉搜索树.html#二叉搜索树常见的操作",a:"二叉搜索树常见的操作"},"32.4":{t:"创建二叉搜索树\r",p:`
封装binarySerachTree的构造函数.
还需要封装一个用于保存每一个结点的类Node

该类包含三个属性: 结点对应的key, 指向的左子树, 指向的右子树


对于binarySerac ...`,l:"code/数据结构/树/二叉搜索树.html#创建二叉搜索树",a:"创建二叉搜索树"},"32.5":{t:"insert(key)\r",p:`插入叶子结点
    binarySerachTree.prototype.insert = function (key) {
        let newNode = new Node(key); ...`,l:"code/数据结构/树/二叉搜索树.html#insert-key",a:"insert-key"},"32.6":{t:"遍历二叉搜索树\r",p:`遍历二叉搜索树
`,l:"code/数据结构/树/二叉搜索树.html#遍历二叉搜索树",a:"遍历二叉搜索树"},"32.7":{t:"先序遍历\r",p:`先序遍历,从根节点开始
    binarySerachTree.prototype.preOrderTraversal = function (handler) {
        return t ...`,l:"code/数据结构/树/二叉搜索树.html#先序遍历",a:"先序遍历"},"32.8":{t:"中序遍历\r",p:`中序遍历，从左子树开始，根节点在中间
    binarySerachTree.prototype.inOrderTraversal = function (handler) {
        re ...`,l:"code/数据结构/树/二叉搜索树.html#中序遍历",a:"中序遍历"},"32.9":{t:"后序遍历\r",p:`根节点在最后
    binarySerachTree.prototype.postOrderTraversal = function (handler) {
        return this. ...`,l:"code/数据结构/树/二叉搜索树.html#后序遍历",a:"后序遍历"},"32.10":{t:"最大最小值\r",p:`    binarySerachTree.prototype.min = function () {
        let node = this.root
        while (node. ...`,l:"code/数据结构/树/二叉搜索树.html#最大最小值",a:"最大最小值"},"32.11":{t:"查找特定值 search(key)\r",p:`
查找特定值-递归法

    binarySerachTree.prototype.search = function (key) {
        return this.searchNode( ...`,l:"code/数据结构/树/二叉搜索树.html#查找特定值-search-key",a:"查找特定值-search-key"},"32.12":{t:"二叉搜索树的删除\r",p:`删除节点要从查找要删的节点开始, 找到节点后, 需要考虑三种情况:

该节点是也结点(没有子节点, 比较简单)
该节点有一个子节点(也相对简单)
该节点有两个子节点.(情况比较复杂)

查找删除的节点 ...`,l:"code/数据结构/树/二叉搜索树.html#二叉搜索树的删除",a:"二叉搜索树的删除"},"32.13":{t:"情况一: 没有子节点\r",p:`
这种情况相对比较简单, 我们需要检测current的left以及right是否都为null.
都为null之后还要检测一个东西, 就是是否current就是根, 都为null, 并且为跟根, 那么相 ...`,l:"code/数据结构/树/二叉搜索树.html#情况一-没有子节点",a:"情况一-没有子节点"},"32.14":{t:"情况二: 一个子节点\r",p:`::: warning caution
tip warning danger
:::
这种情况也不是很难.

要删除的current结点, 只有2个连接(如果有两个子结点, 就是三个连接了), 一个连 ...`,l:"code/数据结构/树/二叉搜索树.html#情况二-一个子节点",a:"情况二-一个子节点"},"32.15":{t:"情况三: 两个子节点\r",p:`&lt;!-- 又分三种情况 --&gt;

如果我们要删除的节点有两个子节点, 甚至子节点还有子节点, 这种情况下我们需要从下面的子节点中找到一个节点, 来替换当前的节点.


但是找到的这个节点有 ...`,l:"code/数据结构/树/二叉搜索树.html#情况三-两个子节点",a:"情况三-两个子节点"},"32.16":{t:"删除节点完整代码\r",p:`//删除
binarySerachTree.prototype.remove = function (key) {
    let current = this.root
    let parent ...`,l:"code/数据结构/树/二叉搜索树.html#删除节点完整代码",a:"删除节点完整代码"},"33.0":{t:"# 链表\r",p:"\r",l:"code/数据结构/链表/链表.html",a:"链表"},"33.1":{t:"js普通构造函数\r",p:`function linkedList() {
    function node(data) {
        this.data = data;
        this.next = null ...`,l:"code/数据结构/链表/链表.html#js普通构造函数",a:"js普通构造函数"},"33.2":{t:"增 append\r",p:`    linkedList.prototype.append = function (data) {
        var newNode = new node(data);
        // ...`,l:"code/数据结构/链表/链表.html#增-append",a:"增-append"},"33.3":{t:"tostring\r",p:`    linkedList.prototype.tostring = function () {
        var str = &quot;&quot;;
        var curren ...`,l:"code/数据结构/链表/链表.html#tostring",a:"tostring"},"33.4":{t:"insert\r",p:`    linkedList.prototype.insert = function (position, data) {
        var newNode = new node(data)
  ...`,l:"code/数据结构/链表/链表.html#insert",a:"insert"},"33.5":{t:"get\r",p:`    linkedList.prototype.get = function (position) {
        if (position &lt; 0 || position &gt;= t ...`,l:"code/数据结构/链表/链表.html#get",a:"get"},"33.6":{t:"indexOf\r",p:`    linkedList.prototype.indexOf = function (data) {
        let current = this.head
        let ind ...`,l:"code/数据结构/链表/链表.html#indexof",a:"indexof"},"33.7":{t:"update\r",p:`    linkedList.prototype.update = function (position, data) {
        if (position &lt; 0 || positio ...`,l:"code/数据结构/链表/链表.html#update",a:"update"},"33.8":{t:"remove\r",p:`    linkedList.prototype.remove = function (position) {
        if (position &lt; 0 || position &gt; ...`,l:"code/数据结构/链表/链表.html#remove",a:"remove"},"33.9":{t:"removedata\r",p:`    linkedList.prototype.removedata = function (data) {
        let current = this.head
        let  ...`,l:"code/数据结构/链表/链表.html#removedata",a:"removedata"},"33.10":{t:"isEmpty、size、clear\r",p:`    linkedList.prototype.isEmpty = function () {
        return this.length === 0
    }

    linkedL ...`,l:"code/数据结构/链表/链表.html#isempty、size、clear",a:"isempty、size、clear"},"33.11":{t:"js普通构造函数版本code\r",p:`:::details 完整代码
function linkedList() {
    function node(data) {
        this.data = data;
         ...`,l:"code/数据结构/链表/链表.html#js普通构造函数版本code",a:"js普通构造函数版本code"},"33.12":{t:"class语法糖版本code\r",p:`:::details 全部代码
class linkedList {
    // function node(data) {
    //     this.data = data;
    //  ...`,l:"code/数据结构/链表/链表.html#class语法糖版本code",a:"class语法糖版本code"},"34.0":{t:"# 优先级队列\r",p:"\r",l:"code/数据结构/队列/优先级队列.html",a:"优先级队列"},"34.1":{t:"普通构造函数封装\r",p:`
function Queue() {
    this.arr = [];

    
    Queue.prototype.dequeue = function () {
        ret ...`,l:"code/数据结构/队列/优先级队列.html#普通构造函数封装",a:"普通构造函数封装"},"34.2":{t:"class语法糖封装\r",p:`class Queue {
    constructor() {
        this.arr = [];
    }
    enqueue(value) {
        this.arr ...`,l:"code/数据结构/队列/优先级队列.html#class语法糖封装",a:"class语法糖封装"},"35.0":{t:"# 队列\r",p:"\r",l:"code/数据结构/队列/队列.html",a:"队列"},"35.1":{t:"普通构造函数封装\r",p:`function Queue() {
    this.arr = [];
    Queue.prototype.enqueue = function (element) {
        thi ...`,l:"code/数据结构/队列/队列.html#普通构造函数封装",a:"普通构造函数封装"},"35.2":{t:"例子\r",p:`function myQueue(numlist, num) {
    const queue = new Queue();
    for (let i = 0; i &lt; numlist.l ...`,l:"code/数据结构/队列/队列.html#例子",a:"例子"},"36.0":{t:"# 数组\r",p:`\r
\r`,l:"code/数组/array.html",a:"数组"},"36.1":{t:"Array.prototype.every() \r",p:`判断是否符合条件，有一个不符合就不行,返回true或false
let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
let result6 = arr.every((i ...`,l:"code/数组/array.html#array-prototype-every",a:"array-prototype-every"},"36.2":{t:"Array.prototype.some() \r",p:`判断是否符合条件，有一个符合就行,返回true或false
let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
let result7 = arr.some((item ...`,l:"code/数组/array.html#array-prototype-some",a:"array-prototype-some"},"36.3":{t:"Array.prototype.find()\r",p:`找到符合条件的第一个数,不改变原数组
let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
let result8 = arr.find((item, index) =& ...`,l:"code/数组/array.html#array-prototype-find",a:"array-prototype-find"},"36.4":{t:"Array.prototype.findLast()\r",p:`反方向查找，找到符合条件的第一个数,不改变原数组
let result99 = arr.findLast((item, index) =&gt; {
    return item &gt; 5
}) ...`,l:"code/数组/array.html#array-prototype-findlast",a:"array-prototype-findlast"},"36.5":{t:"Array.prototype.findIndex()\r",p:`找到符合条件的第一个数的索引,里面为回调函数,不改变原数组
let result9 = arr.findIndex((item, index) =&gt; {
    return item &gt; ...`,l:"code/数组/array.html#array-prototype-findindex",a:"array-prototype-findindex"},"36.6":{t:"Array.prototype.indexOf()\r",p:`返回某个元素的第一个索引，里面是一个值,不改变原数组
let result11 = arr.indexOf(6)
console.log('result11:', result11) //result ...`,l:"code/数组/array.html#array-prototype-indexof",a:"array-prototype-indexof"},"36.7":{t:"Array.prototype.lastIndexOf()\r",p:`方法返回指定元素在数组中的最后一个的索引
let result12 = arr.lastIndexOf(10)
console.log('result12:', result12) //result1 ...`,l:"code/数组/array.html#array-prototype-lastindexof",a:"array-prototype-lastindexof"},"36.8":{t:"Array.prototype.includes()\r",p:`判断是否包含某个元素,返回true或false
let result10 = arr.includes(10)

console.log('result10:', result10)

`,l:"code/数组/array.html#array-prototype-includes",a:"array-prototype-includes"},"36.9":{t:"Array.prototype.map()\r",p:`将数组中的每个元素映射到另一个数组中，不改变原数组,产生一个新的数组
let result14 = arr.map((item, index) =&gt; {
    return item * 2
 ...`,l:"code/数组/array.html#array-prototype-map",a:"array-prototype-map"},"36.10":{t:"Array.prototype.forEach()\r",p:`方法对数组的每个元素执行一次给定的函数，不产生数组，对原数组也没影响。
let arr8 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
let result27 = arr8.f ...`,l:"code/数组/array.html#array-prototype-foreach",a:"array-prototype-foreach"},"36.11":{t:"Array.prototype.flat()\r",p:`flat() 方法创建一个新的数组，并根据指定深度递归地将所有子数组元素拼接到新的数组中。
let arr = [1, [2, 3],[ 4, [5, [6, 7], 8], 9], 10]
let  ...`,l:"code/数组/array.html#array-prototype-flat",a:"array-prototype-flat"},"36.12":{t:"Array.prototype.flatMap()\r",p:`
flatMap() 方法对数组中的每个元素应用给定的回调函数，然后将结果展开一级，返回一个新数组。* 它等价于在调用 map() 方法后再调用深度为 1 的 flat() 方法（arr.map(.. ...`,l:"code/数组/array.html#array-prototype-flatmap",a:"array-prototype-flatmap"},"36.13":{t:"Array.prototype.fill ()\r",p:`用一个固定值填充一个数组中从起始索引（默认为 0）到终止索引（默认为 array.length）内的全部元素。它返回修改后的数组，改变原数组
//填充一个数到最后
let result15 = arr ...`,l:"code/数组/array.html#array-prototype-fill",a:"array-prototype-fill"},"36.14":{t:"Array.prototype.filter ()\r",p:`返回一个过滤后的新数组,不改变原数组
let result13 = arr.filter((item, index) =&gt; {
    return item &gt; 5
})

consol ...`,l:"code/数组/array.html#array-prototype-filter",a:"array-prototype-filter"},"36.15":{t:"Array.from()\r",p:`静态方法从可迭代或类数组对象创建一个新的浅拷贝的数组实例。
let arrfrom = 'foobar'
let result16 = Array.from(arrfrom)

console.log ...`,l:"code/数组/array.html#array-from",a:"array-from"},"36.16":{t:"Array.of() \r",p:`方法通过可变数量的参数创建一个新的 Array 实例，而不考虑参数的数量或类型。
Array.of() 和 Array() 构造函数之间的区别在于对单个参数的处理：Array.of(7) 创建一个具有 ...`,l:"code/数组/array.html#array-of",a:"array-of"},"36.17":{t:"Array.prototype.join() \r",p:`方法用于将数组中的元素连接成字符串。
let result18 = arr.join(',')

console.log('result18:', result18) //result18: '1,2 ...`,l:"code/数组/array.html#array-prototype-join",a:"array-prototype-join"},"36.18":{t:"Array.prototype.pop() \r",p:`方法用于删除数组中的最后一个元素,返回删除后的元素,改变原数组
let arr4 = [1, 2, 3, 4, 5, 6, 7, 8]
let result19 = arr4.pop()

conso ...`,l:"code/数组/array.html#array-prototype-pop",a:"array-prototype-pop"},"36.19":{t:"Array.prototype.push() \r",p:`方法用于添加一个或多个元素到数组的末尾。并返回该数组的新长度,改变原数组
let arr5 = [1, 2, 3, 4, 5, 6, 7, 8]
let result20 = arr5.push(9) ...`,l:"code/数组/array.html#array-prototype-push",a:"array-prototype-push"},"36.20":{t:"Array.prototype.shift()\r",p:`
方法从数组中删除第一个元素，并返回该元素的值。改变原数组
Array.prototype.pop() 有着和 shift相似的行为，但是是作用在数组的最后一个元素上的。

let arr11 = [ ...`,l:"code/数组/array.html#array-prototype-shift",a:"array-prototype-shift"},"36.21":{t:"Array.prototype.unshift()\r",p:`方法将一个或多个元素添加到数组的开头，并返回该数组的新长度,改变原数组。
let arr15 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
let result34 = arr1 ...`,l:"code/数组/array.html#array-prototype-unshift",a:"array-prototype-unshift"},"36.22":{t:"Array.prototype.keys()\r",p:`keys() 方法返回一个包含数组中每个索引键的 Array Iterator 对象。
let result21 = arr5.keys()

console.log('result21:', res ...`,l:"code/数组/array.html#array-prototype-keys",a:"array-prototype-keys"},"36.23":{t:"Array.prototype.values()\r",p:`values() 方法返回一个新的 Array Iterator 对象，该对象包含数组每个索引的值。
let result23 = arr5.values()

console.log('result ...`,l:"code/数组/array.html#array-prototype-values",a:"array-prototype-values"},"36.24":{t:"Array.prototype.entries()\r",p:`返回一个新的数组迭代器对象,类似generater函数
let arr6 = [&quot;a&quot;, &quot;b&quot;, &quot;c&quot;, &quot;d&quot;,  ...`,l:"code/数组/array.html#array-prototype-entries",a:"array-prototype-entries"},"36.25":{t:"Array.prototype.reduce()\r",p:`累加
`,l:"code/数组/array.html#array-prototype-reduce",a:"array-prototype-reduce"},"36.26":{t:"Array.prototype.reduceRight()\r",p:`reduceRight() 方法接受一个函数作为累加器（accumulator）和数组的每个值（从右到左）将其减少为单个值。
let arr9 = [[1, 2],[ 3, 4], [5, 6], [ ...`,l:"code/数组/array.html#array-prototype-reduceright",a:"array-prototype-reduceright"},"36.27":{t:"Array.prototype.reverse()\r",p:`方法将数组中元素的位置颠倒，并返回该数组。数组的第一个元素会变成最后一个，数组的最后一个元素变成第一个。该方法会改变原数组。
let arr10 = [1, 2, 3, 4, 5, 6, 7, 8,  ...`,l:"code/数组/array.html#array-prototype-reverse",a:"array-prototype-reverse"},"36.28":{t:"Array.prototype.slice()\r",p:`slice() 方法返回一个新的数组对象，这一对象是一个由 begin 和 end 决定的原数组的浅拷贝（包括 begin，不包括end）。原始数组不会被改变。
let arr12 = [1, 2,  ...`,l:"code/数组/array.html#array-prototype-slice",a:"array-prototype-slice"},"36.29":{t:"Array.prototype.sort()\r",p:`sort() 方法用原地算法对数组的元素进行排序，并返回数组。默认排序顺序是在将元素转换为字符串，然后比较它们的 UTF-16 代码单元值序列时构建的
let arr13 = [1, 2, 3, 4, ...`,l:"code/数组/array.html#array-prototype-sort",a:"array-prototype-sort"},"36.30":{t:"Array.prototype.splice()\r",p:`splice() 方法通过删除或替换现有元素或者原地添加新的元素来修改数组，并以数组形式返回被修改的内容。此方法会改变原数组。
let arr14 = [1, 2, 3, 4, 5, 6, 7, 8, ...`,l:"code/数组/array.html#array-prototype-splice",a:"array-prototype-splice"},"36.31":{t:"Array.prototype.toLocaleString()\r",p:`返回一个字符串表示数组中的元素。数组中的元素将使用各自的 toLocaleString 方法转成字符串，这些字符串将使用一个特定语言环境的字符串（例如一个逗号 &quot;,&quot;）隔开。
le ...`,l:"code/数组/array.html#array-prototype-tolocalestring",a:"array-prototype-tolocalestring"},"36.32":{t:"Array.prototype.toString()\r",p:`方法返回一个字符串，表示指定的数组及其元素。
let arr17 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
let result36 = arr17.toString()

 ...`,l:"code/数组/array.html#array-prototype-tostring",a:"array-prototype-tostring"},"37.0":{t:"# 数组扁平化\r",p:`let arr3 = [1, 2, [3, 4, 5, 6, [7, 8, [9]]]]

`,l:"code/数组/array2one.html",a:"数组扁平化"},"37.1":{t:"flat\r",p:`let result16 = arr3.flat(Infinity)
console.log('result16:', result16)

`,l:"code/数组/array2one.html#flat",a:"flat"},"37.2":{t:"tostring\r",p:`function flatten(arr) {
    return arr.toString().split(',').map((item, index) =&gt; parseFloat(item ...`,l:"code/数组/array2one.html#tostring",a:"tostring"},"37.3":{t:"递归\r",p:"",l:"code/数组/array2one.html#递归",a:"递归"},"37.4":{t:"一层\r",p:`let arr = [1, 2, 3, [6, 5, 4]]
let result = []
for (let i = 0; i &lt; arr.length; i++) {
    result  ...`,l:"code/数组/array2one.html#一层",a:"一层"},"37.5":{t:"多层\r",p:`function flatten2(arr) {
    let result = []
    for (let i = 0; i &lt; arr.length; i++) {
        i ...`,l:"code/数组/array2one.html#多层",a:"多层"},"37.6":{t:"forEach递归\r",p:`const eachFlatten = (arr = [], deep = 1) =&gt; {
    const result = [];
        (function flat(arr,d ...`,l:"code/数组/array2one.html#foreach递归",a:"foreach递归"},"37.7":{t:"reduce递归\r",p:`const reduceflat = (arr = [], deep = 1) =&gt; {
    if(deep&lt;=0) return arr;
    return arr.reduce ...`,l:"code/数组/array2one.html#reduce递归",a:"reduce递归"},"38.0":{t:"# reduce function\r",p:`let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

`,l:"code/数组/reduce.html",a:"reduce-function"},"38.1":{t:"累加\r",p:`let result1 = arr.reduce((pre,cur)=&gt;{
    return pre + cur
},0)
console.log('result:', result1)

`,l:"code/数组/reduce.html#累加",a:"累加"},"38.2":{t:"最大值\r",p:`let result2 = arr.reduce((pre,cur)=&gt;{
    return Math.max(pre,cur)})

console.log('result2:', res ...`,l:"code/数组/reduce.html#最大值",a:"最大值"},"38.3":{t:"数组去重\r",p:`let result3 = arr.reduce((pre,cur)=&gt;{
    if(pre.indexOf(cur) == -1){
        pre.push(cur)
    } ...`,l:"code/数组/reduce.html#数组去重",a:"数组去重"},"38.4":{t:"分类\r",p:`const arr2 = [1,1,2,3,3,5,6,6]

let result4 = arr2.reduce((pre,cur)=&gt;{
    if(pre[cur]){
         ...`,l:"code/数组/reduce.html#分类",a:"分类"},"38.5":{t:"翻转字符串\r",p:"let str = 'result,wolder'\nlet result5 = Array.from(str).reduce((pre,cur)=&gt;{ \n    return `${cur}${ ...",l:"code/数组/reduce.html#翻转字符串",a:"翻转字符串"},"39.0":{t:"# 流光按钮\r",p:"\r",l:"components/button/flowingbutton.html",a:"流光按钮"},"39.1":{t:"展示效果\r",p:`&lt;Flowing-button&gt;流光按钮&lt;/Flowing-button&gt;
`,l:"components/button/flowingbutton.html#展示效果",a:"展示效果"},"39.2":{t:"全局挂载\r",p:`import { createApp } from 'vue'
import App from './App.vue'
import  LJT  from 'ljt-btn'
const app =  ...`,l:"components/button/flowingbutton.html#全局挂载",a:"全局挂载"},"39.3":{t:"局部挂载\r",p:`import {Button} from 'ljt-btn'

在组件内挂载之后只需要引用下面这行代码，你就可以看到流光按钮啦！
&lt;Button&gt;流光按钮&lt;/Button&gt;

`,l:"components/button/flowingbutton.html#局部挂载",a:"局部挂载"},"39.4":{t:"禁用\r",p:`使用disabled给按钮添加禁用功能
&lt;Flowing-button disabled=&quot;true&quot;&gt;流光按钮&lt;/Flowing-button&gt;
&lt; ...`,l:"components/button/flowingbutton.html#禁用",a:"禁用"},"40.0":{t:"Button 按钮\r",p:"\r",l:"components/button/normal.html",a:"button-按钮"},"40.1":{t:"效果展示\r",p:`普通按钮
&lt;L-button &gt;默认&lt;/L-button&gt;
&lt;L-button type=&quot;primary&quot;&gt;primary&lt;/L-but ...`,l:"components/button/normal.html#效果展示",a:"效果展示"},"40.2":{t:"全局挂载\r",p:`import { createApp } from 'vue'
import App from './App.vue'
import  LJT  from 'ljt-btn'
const app =  ...`,l:"components/button/normal.html#全局挂载",a:"全局挂载"},"40.3":{t:"局部挂载\r",p:`import {LButton} from 'ljt-btn'

在组件内挂载之后只需要引用下面这行代码，你就可以看到按钮啦！
&lt;L-button type=&quot;success&quot ...`,l:"components/button/normal.html#局部挂载",a:"局部挂载"},"40.4":{t:"类型\r",p:`可以选择想要的类型，例如：
type = 'primary'|'success'
//事例
&lt;L-button type=&quot;primary&quot;&gt;primary&lt;/L ...`,l:"components/button/normal.html#类型",a:"类型"},"40.5":{t:"朴素按钮\r",p:`给按钮添加plain变为朴素按钮,例如：
&lt;L-button type=&quot;primary&quot; plain&gt;primary&lt;/L-button&gt;
&lt;L-b ...`,l:"components/button/normal.html#朴素按钮",a:"朴素按钮"},"40.6":{t:"圆角\r",p:`给按钮添加round变为圆角按钮,例如：
&lt;L-button type=&quot;primary&quot; round&gt;primary&lt;/L-button&gt;
&lt;L-b ...`,l:"components/button/normal.html#圆角",a:"圆角"},"40.7":{t:"禁用\r",p:`给按钮添加disabled变为不可选中状态,例如：
&lt;L-button type=&quot;primary&quot; disabled&gt;primary&lt;/L-button&gt; ...`,l:"components/button/normal.html#禁用",a:"禁用"},"40.8":{t:"给按钮添加icon\r",p:"给按钮添加icon=&quot;name&quot;属性,选择自己喜欢的name就可以在按钮上添加icon,如果icon想放在右侧只需要添加icon-position=&quot;right&quot ...",l:"components/button/normal.html#给按钮添加icon",a:"给按钮添加icon"},"41.0":{t:"安装\r",p:`npm install ljt-btn

`,l:"components/guild/installation.html",a:"安装"},"42.0":{t:"# icon\r",p:"\r",l:"components/icon/icon.html",a:"icon"},"42.1":{t:"效果展示\r",p:`&lt;Licon name=&quot;apple-line&quot; color=&quot;red&quot;&gt;&lt;/Licon&gt;
&lt;Licon name=&quot;a ...`,l:"components/icon/icon.html#效果展示",a:"效果展示"},"42.2":{t:"全局挂载\r",p:`import { createApp } from 'vue'
import App from './App.vue'
import  LJT  from 'ljt-btn'
const app =  ...`,l:"components/icon/icon.html#全局挂载",a:"全局挂载"},"42.3":{t:"局部挂载\r",p:`import {Licon} from 'ljt-btn'

在组件内挂载之后只需要引用下面这行代码，选择你想要的图标name，你就可以看到图标啦！
&lt;Licon name=&quot;jinr ...`,l:"components/icon/icon.html#局部挂载",a:"局部挂载"},"42.4":{t:"徽标提示\r",p:`我们可以设置dot属性后，让我们图标右上角展示一个小红点；设置badge属性后，会在图标右上角展示相应的徽标,例如：
&lt;Licon name=&quot;apple-line&quot; dot ...`,l:"components/icon/icon.html#徽标提示",a:"徽标提示"},"42.5":{t:"颜色\r",p:`我们可以设置color属性更改你想要的颜色,例如：
&lt;Licon name=&quot;apple-line&quot; color=&quot;red&quot;/&gt;

说明：部分图标不 ...`,l:"components/icon/icon.html#颜色",a:"颜色"},"42.6":{t:"使用\r",p:"",l:"components/icon/icon.html#使用",a:"使用"},"42.7":{t:"logo\r",p:`&lt;Licon name=&quot;apple-line&quot; color=&quot;red&quot;/&gt;
&lt;Licon name=&quot;apple-fill&quo ...`,l:"components/icon/icon.html#logo",a:"logo"},"42.8":{t:"链接\r",p:`&lt;Licon name=&quot;attachment-2&quot; /&gt;
&lt;Licon name=&quot;attachment-line&quot; /&gt;
&lt;L ...`,l:"components/icon/icon.html#链接",a:"链接"},"42.9":{t:"筛选\r",p:`&lt;Licon name=&quot;apps-fill&quot; /&gt;
&lt;Licon name=&quot;shaixuan&quot; /&gt;
&lt;Licon name= ...`,l:"components/icon/icon.html#筛选",a:"筛选"},"42.10":{t:"点赞收藏\r",p:`&lt;Licon name=&quot;dianzan&quot; /&gt;
&lt;Licon name=&quot;shandian&quot; /&gt;
&lt;Licon name=&q ...`,l:"components/icon/icon.html#点赞收藏",a:"点赞收藏"},"42.11":{t:"声音\r",p:`&lt;Licon name=&quot;shengyinguanbi&quot; /&gt;
&lt;Licon name=&quot;shengyin&quot; /&gt;
&lt;Licon  ...`,l:"components/icon/icon.html#声音",a:"声音"},"42.12":{t:"箭头\r",p:`&lt;Licon name=&quot;a-xiala2&quot; /&gt;
&lt;Licon name=&quot;jinru&quot; /&gt;
&lt;Licon name=&quo ...`,l:"components/icon/icon.html#箭头",a:"箭头"},"42.13":{t:"分享\r",p:`&lt;Licon name=&quot;dianhua&quot; /&gt;
&lt;Licon name=&quot;a-fenxiang2&quot; /&gt;
&lt;Licon name ...`,l:"components/icon/icon.html#分享",a:"分享"},"42.14":{t:"删除\r",p:`&lt;Licon name=&quot;shanchu&quot; /&gt;
&lt;Licon name=&quot;guanbi&quot; /&gt;
&lt;Licon name=&quo ...`,l:"components/icon/icon.html#删除",a:"删除"},"42.15":{t:"编写文字\r",p:`&lt;Licon name=&quot;bianji&quot; /&gt;
&lt;Licon name=&quot;bofangjilu&quot; /&gt;
&lt;Licon name=& ...`,l:"components/icon/icon.html#编写文字",a:"编写文字"},"42.16":{t:"设置帮助\r",p:`&lt;Licon name=&quot;shezhi&quot; /&gt;
&lt;Licon name=&quot;saoyisao&quot; /&gt;
&lt;Licon name=&qu ...`,l:"components/icon/icon.html#设置帮助",a:"设置帮助"},"43.0":{t:"# bilibili错题\r",p:"\r",l:"fighting/bilibili/bilibili.html",a:"bilibili错题"},"43.1":{t:"定时器\r",p:`宏任务的定时器谁先到时间谁先执行
setTimeout(function(){
    console.log(1);
},2000)
setTimeout(function(){
    conso ...`,l:"fighting/bilibili/bilibili.html#定时器",a:"定时器"},"43.2":{t:"哪个样式在现代浏览器默认样式下设置宽度不生效`display:table-row`\r",p:`参考
table标签（display:table） 类似于 &lt;table&gt;
1. table可设置宽高、margin、border、padding等属性。属性值的单位可以使用px，百分比值 ...`,l:"fighting/bilibili/bilibili.html#哪个样式在现代浏览器默认样式下设置宽度不生效-display-table-row",a:"哪个样式在现代浏览器默认样式下设置宽度不生效-display-table-row"},"43.3":{t:"Object.prototype.toString.call(undefined)\r",p:`[object Undefined],object小写，Undefined首字母大写
`,l:"fighting/bilibili/bilibili.html#object-prototype-tostring-call-undefined",a:"object-prototype-tostring-call-undefined"},"43.4":{t:"obj对象里的箭头函数的this指向的是obj的上下文\r",p:`别再错了指向的是obj的上下文，指不到里面的
const obj = {
    a:1,
    foo:()=&gt;{
        console.log(this.a)
    }
}
o ...`,l:"fighting/bilibili/bilibili.html#obj对象里的箭头函数的this指向的是obj的上下文",a:"obj对象里的箭头函数的this指向的是obj的上下文"},"43.5":{t:"input标签的输入类型\r",p:`输入类型
没有telphone类型只有tel类型
`,l:"fighting/bilibili/bilibili.html#input标签的输入类型",a:"input标签的输入类型"},"43.6":{t:"状态码\r",p:`405：请求中的方法不允许使用
302：（临时移动）服务器目前从不同位置的网页响应请求，但请求者应继续使用原有位置来进行以后的请求。而不是拒绝处理该请求
`,l:"fighting/bilibili/bilibili.html#状态码",a:"状态码"},"43.7":{t:"影响原数组\r",p:`splice,push,pop,shift,unshift,reverse,sort会影响原数组
其他的不会
`,l:"fighting/bilibili/bilibili.html#影响原数组",a:"影响原数组"},"43.8":{t:"clip-path\r",p:`clip-path 属性使用裁剪方式创建元素的可显示区域。区域内的部分显示，区域外的隐藏。可以指定一些特定形状。
`,l:"fighting/bilibili/bilibili.html#clip-path",a:"clip-path"},"43.9":{t:"promise的catch\r",p:`promise的catch只会执行第一个，和then不同不会传递到最后
Promise.rehect(0).catch((e)=&gt;e).catch(console.log(e))

只会执行第一 ...`,l:"fighting/bilibili/bilibili.html#promise的catch",a:"promise的catch"},"43.10":{t:"对象键值\r",p:`var a={},b='123',c=123
a[b]='b'
a[c]='c'
console.log(a[b]) //c
var a={},b=Symbol('123'),c=Symbol('12 ...`,l:"fighting/bilibili/bilibili.html#对象键值",a:"对象键值"},"43.11":{t:"分析\r",p:`情况一转为字符串后相当于重复赋值，情况二Symbol是唯一的b和c不一样，情况三{key:'123'}和{key:'456'}转为字符串都是[object,Object]，所以和情况一一样重复赋值
`,l:"fighting/bilibili/bilibili.html#分析",a:"分析"},"43.12":{t:"总结\r",p:`
Object对象转换为字符串和判断数据类型都是直接调用 toStirng() 方法，得到的结果都是 [object Object]。
除了Obeject之外的其他类型，直接调用 toStirng() ...`,l:"fighting/bilibili/bilibili.html#总结",a:"总结"},"43.13":{t:"let var\r",p:`let块级作用域输出0-1-2
for(let i = 0; i &lt; 3; i++) {
    setTimeout(function(){
        console.log(i)},0 ...`,l:"fighting/bilibili/bilibili.html#let-var",a:"let-var"},"43.14":{t:"过渡效果transition\r",p:`若过渡起始值或过渡开始值为auto，则浏览器不会自己计算成具体数字值，而是不发生过渡效果。所以要过渡某些属性，首先需要将其重置成具体数字值
.box{
    transition: hight 1s ...`,l:"fighting/bilibili/bilibili.html#过渡效果transition",a:"过渡效果transition"},"43.15":{t:'`<input type="text" />`change事件和inpute事件\r',p:`用户键入内容改变时，触发inpute事件，且当标签失焦后触发change事件
`,l:"fighting/bilibili/bilibili.html#input-type-text-change事件和inpute事件",a:"input-type-text-change事件和inpute事件"},"43.16":{t:"定位的top属性\r",p:`top属性规定内部元素的顶部边缘，定义了一个定位元素的上外边距与其包含块的上内边距
`,l:"fighting/bilibili/bilibili.html#定位的top属性",a:"定位的top属性"},"43.17":{t:"取余\r",p:`1 % 6 = 1,2 % 6 = 2,3 % 6 = 3,4 % 6 = 4,-7 % 3 = -1
`,l:"fighting/bilibili/bilibili.html#取余",a:"取余"},"43.18":{t:"三栏布局\r",p:`flex方法时，display:flex应该设置在父元素上
使用浮动时先写left再写right再写中间的，顺序不能乱
`,l:"fighting/bilibili/bilibili.html#三栏布局",a:"三栏布局"},"43.19":{t:"leecode 279",p:"",l:"fighting/bilibili/bilibili.html#leecode-279",a:"leecode-279"},"44.0":{t:"# 错题集\r",p:`你可上点心吧
`,l:"fighting/introductor.html",a:"错题集"},"46.0":{t:"# 介绍\r",p:`通过vitepress和github pages在这里记录我的学习blog
这里有什么

面试题
代码手撕
封装好的组件库
错题集
...待更新

鹏之徙于南冥也,水击三千里,抟扶摇而上者九万里 —— ...`,l:"introduce/introduce.html",a:"介绍"},"47.0":{t:"快速开始\r",p:`从这里开始你的 面试题 之旅

等不及了从这里开始你的 代码手撕 之旅

等不及了从这里开始你的 组件库 之旅

温故而知新  错题集 长点心！
`,l:"introduce/quickstart.html",a:"快速开始"}},n={previewLength:100,buttonLabel:"搜索",placeholder:"情输入关键词",allow:[],ignore:[]},r={INDEX_DATA:t,PREVIEW_LOOKUP:e,Options:n};export{r as default};
