const t={map:'[{"ajax":["0.0","0.2","11.48"],"什么是ajax":["0.1"],"json字符串转换集json对象":["0.3"],"ajax几种请求方式":["0.4"],"什么情况造成跨域":["0.5"],"跨域解决方案有哪些":["0.6"],"使用axios怎么中止请求":["0.7"],"axios的请求响应拦截":["0.8"],"css":["1.0","5.12","36.6"],"清除浮动":["1.2"],"flex":["1.6","1.7","1.8","1.9"],"自适应布局rem":["1.16"],"clip":["1.24","62.8"],"行内元素和块元素":["1.25"],"text":["1.26"],"对齐":["1.27"],"动画":["1.28"],"响应式布局rem和em":["1.29"],"css选择器排序":["1.30","36.16"],"属性选择器和伪类选择器":["1.31"],"伪元素选择器":["1.32"],"盒模型":["2.3"],"指定盒模型的类型":["2.5"],"媒体查询":["2.9"],"es6":["3.0"],"定义":["3.2"],"用法":["3.3"],"默认导出与默认导入注意点":["3.4"],"按需导入与按需导出注意点":["3.5"],"generator":["3.14"],"js新增简单数据类型symbol":["4.0"],"dom":["5.0","5.2"],"什么是dom":["5.1"],"javascript和css会不会影响dom树构建和渲染":["5.3"],"javascript对dom树构建和渲染的影响":["5.4"],"规避javascript线程阻塞dom现象":["5.5"],"css对dom树构建和渲染的影响":["5.6"],"domcontentloaded":["5.7"],"dom文档加载的步骤为":["5.8"],"网页的渲染":["5.9"],"dom树的构建是文档加载完成开始的":["5.10"],"render":["5.11"],"js":["5.13","11.10"],"virtual":["5.14","5.15"],"vue的virtual":["5.16"],"vnode":["5.17"],"dom常用接口":["5.18"],"document":["5.19"],"常用属性":["5.20","5.25","5.27"],"element":["5.21"],"dom元素对象属性":["5.22"],"window":["5.23"],"常用方法":["5.24","5.28"],"event":["5.26"],"html八股文":["6.0"],"重绘":["6.12"],"避免重排重绘":["6.13"],"触发合成层":["6.15"],"层压缩":["6.16"],"层爆炸":["6.17"],"为什么要语义化":["6.19"],"iframe":["6.20"],"seo":["7.0"],"什么是seo":["7.1"],"优化的三要素":["7.2"],"tdk是搜索引擎判断页面主题内容的关键":["7.3"],"提升页面关键词密度":["7.4"],"细枝末节但不可忽视的优化":["7.5"],"w3c标准":["8.0"],"概念":["8.1"],"体现":["8.2"],"意义":["8.3"],"http":["9.0"],"http概述":["9.1"],"http特点":["9.2"],"tcp":["9.3","9.20","9.24"],"http与https的区别":["9.4"],"http1":["9.5"],"url的组成":["9.6"],"http请求":["9.7"],"请求行":["9.8"],"get与post的区别":["9.9"],"什么情况下使用post请求":["9.10"],"请求头":["9.11"],"请求体":["9.12"],"http响应":["9.13"],"响应状态行":["9.14"],"常见状态码":["9.15"],"响应头":["9.16"],"浏览器输入url按回车背后经历了哪些":["9.17"],"url":["9.18"],"dns":["9.19"],"处理请求":["9.21"],"浏览器收到http响应":["9.22"],"渲染页面":["9.23"],"三次握手":["9.25"],"四次挥手":["9.26"],"cookie":["9.27","9.31","21.10"],"ip":["9.28"],"tcp和udp":["9.29"],"http无状态的协议":["9.30"],"进程和线程":["9.32"],"安全":["10.0"],"xss":["10.1"],"web安全有哪些方面":["10.2"],"csrf和xss":["10.3"],"防范":["10.4","10.5"],"ssl":["10.6"],"对称加密":["10.7"],"非对称加密":["10.8"],"javascript八股文":["11.0"],"async":["11.5"],"defer":["11.6"],"不同":["11.7"],"立即执行函数是闭包":["11.8"],"class类的函数默认是严格模式":["11.9"],"eventloop事件循环":["11.11"],"同步异步":["11.12"],"宏任务和微任务":["11.13"],"settimeout的误区":["11.14"],"nexttick":["11.15"],"队列执行顺序":["11.16"],"深拷贝浅拷贝":["11.17"],"深拷贝":["11.18","38.3"],"浅拷贝":["11.19"],"赋值和浅拷贝的区别":["11.20"],"闭包":["11.21"],"内存泄漏":["11.22"],"内存的生命周期":["11.23"],"垃圾回收机制":["11.24"],"执行上下文":["11.25"],"isnan":["11.26"],"hasownproperty":["11.27"],"valueof":["11.29"],"javascript变量在内存中具体存储形式":["11.30"],"javascript的装箱和拆箱":["11.31"],"装箱":["11.32"],"拆箱":["11.33"],"null和undefined的异同点有哪些":["11.34"],"为什么typeof":["11.35"],"与":["11.36"],"javascript的隐式转换规则":["11.37"],"双等号左右两边的转换规则":["11.38"],"undefined":["11.39"],"null":["11.40"],"为什么是":["11.41"],"什么是匿名函数":["11.43"],"绑定点击事件有几种方式":["11.44"],"addeventlistener的第三个参数是干嘛的":["11.45"],"函数声明和函数表达式的区别":["11.46"],"javascript的事件流模型有哪些":["11.47"],"load":["11.49"],"如何阻止事件冒泡":["11.50"],"如何阻止事件默认行为":["11.51"],"什么是事件委托":["11.52"],"如何实现数组去重":["11.53"],"nan是什么":["11.54"],"javascript继承方式有几种":["11.55"],"class继承super":["11.56"],"数组常用方法":["11.57"],"math的常用方法有哪些":["11.58"],"js中有哪些不同类型的弹出框":["11.59"],"如何将":["11.60"],"如何在js中编码和解码":["11.61"],"什么是bom":["11.62"],"bom":["11.63"],"js中的substr":["11.64"],"substr":["11.65"],"substring":["11.66"],"解释一下":["11.67"],"input标签":["11.68"],"属性":["11.69"],"arguements":["11.70"],"类数组转数组方法":["11.71"],"for":["11.72"],"可迭代对象":["11.73"],"new的过程":["11.74"],"事件处理函数event":["11.75"],"object":["12.0","12.1","12.2","12.3","12.4","12.5","12.7","12.8","12.9","12.10","12.11","12.13","12.14","12.16","12.17","12.18","12.19","12.20","12.21","12.22","12.23","12.24","12.25","12.26","12.27","12.28","12.29","12.30","12.31","14.10","27.39","28.7","62.3"],"语法":["12.6","12.12"],"instanceof":["12.15"],"promise":["13.0","39.0","40.1"],"reject和catch":["13.1"],"promise的状态":["13.2"],"resolve不同值的区别":["13.3"],"promise的实例方法":["13.4"],"then方法":["13.5"],"catch方法":["13.6"],"finally方法":["13.7"],"promise中的类方法":["13.8"],"promise其他":["13.9"],"acync":["13.10"],"set":["14.0","14.1","14.2","14.3"],"转为数组":["14.4"],"所以set可以使用数组里的":["14.5"],"因此":["14.6"],"map":["14.7","14.9","28.30"],"属性方法":["14.8"],"this":["15.0"],"node环境和浏览器环境":["15.1"],"this方法":["15.2"],"this指向的四种情况":["15.3"],"运算符":["16.0"],"隐式转换":["16.2"],"优先级":["16.3"],"数组":["17.0","25.1","52.0"],"数组的方法":["17.1"],"数组去重":["17.2","36.0","54.3"],"数组找一个值的方法":["17.3"],"entries":["17.4"],"javascript中的正则表达式":["18.0"],"项目":["19.0","33.0"],"组件时怎么封装的":["19.1"],"表单样式":["19.2"],"glup打包样式文件":["19.3"],"为什么选择gulp":["19.4"],"ts用在哪些方面":["19.5"],"axios怎么进行二次封装的":["19.6"],"怎么用的pinia":["19.7"],"node":["19.8","20.0","20.1"],"前后端分离":["19.9"],"http23":["19.10"],"https":["19.11"],"静态资源缓存":["19.12"],"layout":["19.13"],"优化跨端应用性能":["19.14"],"webgpu":["19.15"],"pnpm和npm":["19.16"],"monorepo":["19.17"],"两种模块的差异":["20.2"],"两种模块的区分":["20.3"],"加载":["20.4"],"同时支持两种格式的模块":["20.5"],"nodejs的内置模块":["20.6"],"process":["20.7"],"path":["20.8"],"fs":["20.9"],"存储的时间有效期不同":["21.1"],"存储的大小不同":["21.2"],"与服务端的通信":["21.3"],"操作":["21.4"],"对于浏览器的支持":["21.5"],"token":["21.7"],"是用来干嘛的":["21.8"],"token存在哪里":["21.9"],"vite":["22.0","22.3","33.4"],"命令":["22.1"],"vite脚手架":["22.2"],"webpack":["23.0","23.1","23.8"],"mode":["23.2"],"entry":["23.3"],"output":["23.4"],"loader":["23.5"],"bable":["23.6"],"plugin":["23.7"],"devtool":["23.9"],"最全前端八股文":["24.0"],"typescript":["25.0"],"函数":["25.2"],"参数":["25.3"],"函数重载":["25.4"],"元组":["25.5"],"元祖类型的解构赋值":["25.6"],"void":["25.7"],"never":["25.8"],"any":["25.9"],"unknown":["25.10"],"类型推断":["25.12"],"类型断言":["25.13"],"非空断言":["25.14"],"确定赋值断言":["25.15"],"字面量类型":["25.16"],"let和const分析":["25.17"],"接口":["25.18"],"可选":["25.19"],"任意属性":["25.20"],"鸭式辨型法":["25.21"],"绕开额外属性检查的方式":["25.22"],"索引签名":["25.23"],"interface":["25.24"],"objects":["25.25"],"other":["25.26"],"接口可以定义多次":["25.27"],"扩展":["25.28"],"泛型":["25.29"],"泛型约束":["25.30"],"泛型工具":["25.32"],"vue":["26.0","26.1","26.2","26.11","27.0","27.51","28.0"],"如何实现":["26.3"],"hash模式":["26.4"],"history模式":["26.5"],"路由跳转方式有哪些":["26.6"],"说一下路由守卫":["26.7"],"完整的导航解析流程":["26.8"],"懒加载":["26.9"],"懒加载实现":["26.10"],"路由元信息":["26.12"],"数据获取":["26.13"],"vue路由的传参方式":["26.14"],"params和query":["26.15"],"对vue的理解":["27.1"],"单页面应用":["27.2"],"vue生命周期":["27.3"],"setup":["27.4"],"各自生命周期的事情":["27.5"],"vue父子组件生命周期":["27.6"],"注意":["27.7","29.4"],"v":["27.8","27.9","27.52","30.0","31.0","42.0","43.0"],"说一下computed和watch":["27.10"],"computed和methods的区别":["27.11"],"computed和watch使用场景":["27.12"],"computed的原理":["27.13"],"computed的两种定义方式":["27.14"],"computed属性的初始化":["27.15"],"computed":["27.16"],"依赖收集的时机":["27.17"],"watch和watcheffect区别和用法":["27.18"],"vue2和vue3区别":["27.19"],"vue初始化阶段":["27.20"],"vue2":["27.21","28.5","28.6","28.11","28.14","28.24"],"数组的改进":["27.22"],"vue插件使用":["27.23"],"vue插槽":["27.24"],"组件通信":["27.25"],"prosps":["27.26"],"emit":["27.27","27.50"],"attrs":["27.28"],"ref":["27.29"],"slot":["27.30","27.55"],"vuex":["27.31"],"pinia":["27.32","34.6"],"调用其他store":["27.33"],"vue自定义指令":["27.34","29.0"],"keep":["27.35"],"activated":["27.36"],"deactivated":["27.37"],"vue2混入":["27.38"],"vue3内置组件":["27.40"],"teleport":["27.41"],"suspense组件":["27.42"],"nexttick及原理":["27.43"],"vue中的nexttick是干什么用的":["27.44"],"vue虚拟dom":["27.45"],"什么是虚拟dom":["27.46"],"说一下diff算法":["27.47"],"vue的diff流程":["27.48"],"props使用":["27.49"],"suspense":["27.53"],"ref和reactive区别":["27.54"],"观察者模式和发布订阅模式":["28.1"],"什么是观察者模式":["28.2"],"什么是发布订阅模式":["28.3"],"vue2的响应式原理":["28.4"],"definereactive":["28.8"],"observe":["28.9"],"数组是怎么做到响应式的":["28.10"],"watcher和数据之间的关系":["28.12"],"watcher依赖的数据改变方式有":["28.13"],"dep怎么收集依赖的":["28.15"],"vue3":["28.16","28.17","28.19","28.20","28.21","28.22"],"vue3的收集依赖":["28.18"],"副作用函数":["28.23"],"vue3响应式核心方法":["28.25"],"核心方法注意":["28.26"],"activeeffect和effect":["28.27"],"track函数":["28.28"],"trigger":["28.29"],"weakmap":["28.31"],"reactive":["28.32"],"reflect":["28.33"],"proxy和reflect":["28.34"],"什么是自定义指令":["29.1"],"自定义组件注册":["29.2"],"钩子函数":["29.3"],"指令的使用":["29.5"],"在":["29.6"],"常用自定义指令":["29.7"],"npm包管理器":["33.1"],"git":["33.2"],"vue2和vue3的区别":["33.3"],"vite的优势在哪":["33.5"],"请求可以取消吗":["33.6"],"代码题":["33.7"],"vue的生命周期":["34.0"],"vue数据挂载在哪个生命周期":["34.1"],"vue的data为什么要return":["34.2"],"axios的拦截响应怎么做":["34.3"],"组件通讯的方式":["34.4"],"vuex的五大部分":["34.5"],"computed和watch区别":["34.7","36.2"],"组件的技术选型你应该怎么考虑":["34.8"],"data是个什么格式的":["34.9"],"你的前端是怎么学的":["34.10"],"项目都有那些组件":["35.0"],"垂直居中":["35.1"],"选择器":["35.2"],"dom的接口":["35.3"],"组件通讯方式":["35.4"],"vue通信方式":["35.5"],"数组有那些属性":["36.1"],"那些地方可以用到watch":["36.3"],"vue3的生命周期":["36.4"],"在哪个生命周期拿数据":["36.5"],"flex布局的常用属性":["36.7"],"垂直居中的方式":["36.8"],"vue的通讯方式":["36.9"],"position的属性":["36.10"],"vue的单向数据流":["36.11"],"为什么要用异步任务":["36.12"],"为什么要用promise":["36.13"],"同步任务异步任务任务队列是一个什么样的关系":["36.14"],"事件循环":["36.15"],"最全前端代码":["37.0"],"code":["38.0"],"防抖":["38.1"],"节流":["38.2"],"递归实现深拷贝":["38.4"],"json实现简单的":["38.5"],"promiseall":["40.0"],"vue3响应式proxy":["41.0"],"创建对象":["44.0"],"直接创建":["44.1"],"new":["44.2"],"工厂方法1":["44.3"],"工厂方法2":["44.4"],"构造函数":["44.5","63.2"],"原型":["44.6"],"排序算法":["45.0"],"冒泡":["45.1"],"选择排序":["45.2"],"插入排序":["45.3"],"希尔排序":["45.4"],"快速排序":["45.5"],"哈希表":["46.0"],"哈希函数":["46.1"],"put":["46.2"],"get":["46.3","49.5"],"remove":["46.4","49.8"],"判断质数":["46.5"],"得到质数":["46.6"],"其他":["46.7"],"栈":["47.0"],"例子":["47.1","51.2"],"二叉搜索树":["48.0"],"什么是二叉搜索树":["48.1"],"二叉搜索树的特点":["48.2"],"二叉搜索树常见的操作":["48.3"],"创建二叉搜索树":["48.4"],"insert":["48.5","49.4"],"遍历二叉搜索树":["48.6"],"先序遍历":["48.7"],"中序遍历":["48.8"],"后序遍历":["48.9"],"最大最小值":["48.10"],"查找特定值":["48.11"],"二叉搜索树的删除":["48.12"],"情况一":["48.13"],"情况二":["48.14"],"情况三":["48.15"],"删除节点完整代码":["48.16"],"链表":["49.0"],"js普通构造函数":["49.1"],"增":["49.2"],"tostring":["49.3"],"indexof":["49.6"],"update":["49.7"],"removedata":["49.9"],"isempty":["49.10"],"js普通构造函数版本code":["49.11"],"class语法糖版本code":["49.12"],"优先级队列":["50.0"],"普通构造函数封装":["50.1","51.1"],"class语法糖封装":["50.2"],"队列":["51.0"],"array":["52.1","52.2","52.3","52.4","52.5","52.6","52.7","52.8","52.9","52.10","52.11","52.12","52.13","52.14","52.15","52.16","52.17","52.18","52.19","52.20","52.21","52.22","52.23","52.24","52.25","52.26","52.27","52.28","52.29","52.30","52.31","52.32"],"数组扁平化":["53.0"],"一层":["53.4"],"多层":["53.5"],"foreach递归":["53.6"],"reduce递归":["53.7"],"reduce":["54.0"],"累加":["54.1"],"最大值":["54.2"],"分类":["54.4"],"翻转字符串":["54.5"],"流光按钮":["55.0"],"展示效果":["55.1"],"全局挂载":["55.2","56.2","59.2"],"局部挂载":["55.3","56.3","59.3"],"禁用":["55.4","56.7","57.2","60.2"],"button":["56.0"],"效果展示":["56.1","59.1"],"类型":["56.4"],"朴素按钮":["56.5"],"圆角":["56.6"],"给按钮添加icon":["56.8"],"输入框":["57.0"],"普通输入框":["57.1"],"尺寸":["57.3"],"一键清空":["57.4"],"密码框":["57.5"],"带icon输入框":["57.6"],"复合输入框":["57.7"],"自适应高度文本域":["57.8"],"安装":["58.0"],"icon":["59.0"],"徽标提示":["59.4"],"颜色":["59.5"],"使用":["59.6"],"logo":["59.7"],"链接":["59.8"],"筛选":["59.9"],"点赞收藏":["59.10"],"声音":["59.11"],"箭头":["59.12"],"分享":["59.13"],"删除":["59.14"],"编写文字":["59.15"],"设置帮助":["59.16"],"超链接":["60.0"],"下划线":["60.1"],"文件上传":["61.0"],"点击上传":["61.1"],"拖拽上传":["61.2"],"bilibili错题":["62.0"],"定时器":["62.1"],"哪个样式在现代浏览器默认样式下设置宽度不生效":["62.2"],"obj对象里的箭头函数的this指向的是obj的上下文":["62.4"],"input标签的输入类型":["62.5"],"状态码":["62.6"],"影响原数组":["62.7"],"promise的catch":["62.9"],"对象键值":["62.10"],"分析":["62.11"],"总结":["62.12"],"let":["62.13"],"过渡效果transition":["62.14"],"input":["62.15"],"定位的top属性":["62.16"],"取余":["62.17"],"三栏布局":["62.18"],"leecode":["62.19"],"日常错题":["63.0"],"箭头函数":["63.1"],"错题集":["64.0"],"介绍":["66.0"],"快速开始":["67.0"]},{"0":["1.8","11.42","16.2","33.7","39.0","45.2","49.11","49.12","50.1","52.13"],"1":["0.6","0.8","1.1","1.6","1.7","1.8","1.9","1.11","2.7","2.10","3.1","3.2","3.3","3.4","3.5","4.0","5.3","5.4","5.7","5.8","5.9","5.15","5.18","6.1","6.13","6.14","6.15","6.16","6.17","6.19","7.2","7.5","8.2","9.9","9.10","9.11","9.15","9.17","9.18","9.19","10.2","11.1","11.7","11.12","11.13","11.14","11.23","11.30","11.37","11.38","11.41","11.42","11.53","11.68","11.71","11.75","12.3","13.0","13.2","13.3","13.4","13.5","13.6","13.8","15.2","15.3","16.2","16.3","17.1","18.0","19.1","19.2","19.10","21.0","21.1","21.2","21.3","21.4","21.5","21.8","21.9","23.0","23.3","23.4","25.22","25.32","26.6","26.7","26.8","26.10","26.11","26.14","27.1","27.6","27.9","27.10","27.12","27.15","27.18","27.19","27.22","27.29","27.31","27.32","27.36","27.37","27.42","27.48","28.11","28.13","28.14","28.24","28.25","28.26","28.27","28.34","29.3","33.0","33.3","33.5","33.7","34.5","34.6","36.0","36.2","36.3","36.10","36.12","36.14","48.2","48.4","48.11","48.12","48.15","53.1","54.4","62.2","62.12","62.13","62.17"],"2":["0.6","1.3","1.12","2.10","3.6","4.0","5.18","6.2","6.13","8.2","9.15","11.2","12.3","13.8","19.10","21.6","25.32","26.8","27.48","28.13","34.6","36.0","48.4","48.12","53.2","57.8","62.13"],"3":["0.6","1.5","1.13","3.7","6.3","8.2","9.15","11.3","13.8","25.16","26.8","28.13","48.12","53.3"],"4":["0.6","1.10","3.8","6.4","9.15","11.4"],"5":["1.14","3.9","6.5","9.15"],"6":["1.15","3.10","6.6","62.17"],"7":["1.17","3.11","6.7"],"8":["1.18","1.19","3.12","6.8"],"9":["1.20","3.13","6.9"],"10":["1.21","6.10","10.1"],"11":["1.22","6.11"],"12":["1.23","6.14"],"13":["2.0","6.18"],"14":["2.1"],"15":["2.2"],"16":["2.4"],"17":["2.6"],"18":["2.7"],"19":["2.8"],"20":["2.10"],"100":["2.10"],"123":["62.10"],"200":["9.15"],"201":["9.15"],"202":["9.15"],"203":["9.15"],"204":["9.15"],"279":["62.19"],"405":["62.6"],"3000":["0.2"],"ajax作用是什么":["0.1"],"常见的方法":["0.2"],"xhr":["0.2"],"js":["0.2","4.0","11.3","11.27","11.33","11.50","11.51","11.53","11.60","11.72","12.26","13.1","13.3","13.5","13.6","13.7","13.8","13.9","14.5","14.6","14.10","15.1","15.3","16.2","17.4","20.0","20.1","20.3","25.3","25.4","25.7","25.23","27.32","27.55","28.4","28.8","28.9","28.15","28.17","28.19","28.21","28.29","28.32","29.3","29.6","30.0","33.7","34.3","36.0","38.1","38.2","38.4","38.5","39.0","40.0","40.1","41.0","42.0","44.1","44.3","44.4","44.5","44.6","45.1","45.3","45.5","46.1","46.2","46.3","46.4","46.5","46.6","46.7","47.0","47.1","48.5","48.7","48.8","48.9","48.10","48.11","48.16","49.1","49.2","49.3","49.4","49.5","49.6","49.7","49.8","49.9","49.10","49.11","49.12","50.1","50.2","51.1","51.2","52.17","53.0","53.2","53.4","53.5","53.6","53.7","54.1","54.2","54.3","54.4","54.5","55.2","55.3","56.2","56.3","59.2","59.3","62.1","62.10"],"const":["0.2","4.0","13.3","13.5","13.6","13.7","13.8","17.4","25.17","28.17","28.19","29.3","30.0","36.0","42.0","51.2","53.6","53.7","54.4"],"new":["0.2","11.33","11.74","13.3","13.5","13.8","36.0","41.0","49.11"],"xmlhttprequest":["0.2"],"open":["0.2"],"get":["0.2","0.4","9.8","9.9","28.33"],"http":["0.2","9.1","9.30","9.31","19.10"],"localhost":["0.2"],"goods":["0.2"],"json对象转换json字符串":["0.3"],"他们的优缺点":["0.4"],"常用的post":["0.4"],"delete":["0.4","14.3"],"同源策略限制":["0.5"],"不同源会造成跨域":["0.5"],"jsonp":["0.6"],"只能解决get跨域":["0.6"],"问的最多":["0.6"],"原理":["0.6"],"动态创建一个script标签":["0.6"],"利用script标签的src属性不受同源策略限制":["0.6"],"因为所有的src属性和href属性都不受同源策略限制":["0.6"],"可以请求第三方服务器数据内容":["0.6"],"步骤":["0.6"],"去创建一个script标签":["0.6"],"script的src属性设置接口地址":["0.6"],"接口参数":["0.6"],"必须要带一个自定义函数名":["0.6"],"要不然后台无法返回数据":["0.6"],"axios":["0.7","11.48","34.3"],"响应拦截":["0.8"],"全局错误处理":["0.8"],"你可以在响应拦截器中检查响应的状态码":["0.8"],"并根据不同的状态码执行相应的操作":["0.8"],"例如":["0.8","56.4"],"如果响应状态码是401":["0.8"],"未授权":["0.8"],"你可以执行相应的操作":["0.8"],"例如重新登录或跳转到登录页面":["0.8"],"统一的数据处理":["0.8"],"你可以在响应拦截器中对响应数据进行处理":["0.8"],"例如将响应的":["0.8"],"数据格式化":["0.8"],"转换成特定的数据结构":["0.8"],"或进行数据解析":["0.8"],"全局":["0.8"],"loading状态管理":["0.8"],"你可以在请求发送和响应返回的过程中显示和隐藏全局loading状态":["0.8"],"通过在请求开始时显示loading状态":["0.8"],"然后在响应拦截器中隐藏loading状态":["0.8"],"常见的水平垂直居中实现方案":["1.1"],"最简单的方案当然是flex布局":["1.1"],"css":["1.1","1.26","1.27","1.31","2.10","24.0"],"father":["1.1"],"display":["1.1","1.11","62.2"],"清除浮动是为了解决浮动元素导致的父元素高度塌陷问题":["1.2"],"使用额外的空元素清除浮动":["1.2"],"html":["1.2","5.2","24.0"],"div":["1.2","2.10","6.3","27.55","57.7","61.2"],"bfc问题":["1.3"],"触发bfc的元素":["1.3"],"auto":["1.7"],"none":["1.9","1.11"],"常规方法":["1.11"],"结构消失":["1.11"],"逃逸视窗":["1.12"],"position":["1.12","1.21","49.4","49.8"],"移行变换":["1.13"],"vw":["1.15"],"自适应布局使用rem作为单位":["1.16"],"其原理是基于":["1.16"],"浏览器默认字体大小":["1.16"],"的相对值来计算元素的尺寸":["1.16"],"flex":["1.17"],"布局如何使用":["1.17"],"是":["1.17","3.14","21.7","23.7"],"grid布局":["1.18"],"如何用":["1.19"],"居中为什么要使用":["1.20"],"transform":["1.20"],"为什么不使用":["1.20"],"marginleft":["1.20"],"介绍下粘性布局":["1.21"],"sticky":["1.21"],"说出":["1.22"],"css3":["1.23","2.8"],"中":["1.23","15.2"],"transition":["1.23"],"和":["1.23","9.29","11.63","12.22","23.5","25.24","27.21","27.39","33.4"],"animation":["1.23","1.28"],"的属性分别有哪些":["1.23"],"path":["1.24","62.8"],"块级元素以块状形式显示":["1.25"],"并占据一行或多行的空间":["1.25"],"aline":["1.26"],"h1":["1.26","6.2"],"align":["1.26","1.27"],"vertical":["1.27"],"属性设置一个元素的垂直对齐方式":["1.27"],"rem相对于根元素":["1.29"],"内联样式的权重为1000":["1.30","36.16"],"属性选择器使用方括号":["1.31"],"来指定属性和属性值":["1.31"],"伪类选择器选择处于特定状态或特定位置的元素":["1.31"],"它们通过在选择器后面使用冒号":["1.31"],"和关键词来指定":["1.31"],"选择已选中的复选框":["1.31"],"不用js":["1.31"],"input":["1.31","11.68","19.2"],"伪元素选择器允许在元素的特定位置插入额外的内容":["1.32"],"如何实现一个自适应的正方形":["2.1"],"清除浮动的方法":["2.2"],"clear":["2.2","49.10"],"清除浮动":["2.2"],"css盒模型是指在html中":["2.3"],"每个元素都被视为一个矩形的盒子":["2.3"],"其包括四个部分":["2.3"],"内容":["2.3"],"两种盒模型以及区别":["2.4"],"可以使用box":["2.5"],"如何触发重排和重绘":["2.6"],"如何优化图片":["2.7"],"对于很多装饰类图片":["2.7"],"新增了那些东西":["2.8"],"选择器":["2.8"],"盒子模型属性":["2.8"],"媒体查询是css3中新增的一种功能":["2.9"],"它允许开发者根据设备屏幕尺寸":["2.9"],"实现三栏布局的7种方法":["2.10"],"浮动float":["2.10"],"calc":["2.10"],"height":["2.10"],"100px":["2.10"],"left":["2.10"],"float":["2.10"],"width":["2.10"],"200px":["2.10"],"background":["2.10"],"color":["2.10","59.1"],"red":["2.10","59.1"],"middle":["2.10"],"400px":["2.10"],"green":["2.10"],"right":["2.10"],"blue":["2.10"],"margin":["2.10"],"负值":["2.10"],"新增了let":["3.6"],"const关键字":["3.6"],"作用域":["3.7"],"常见的作用域主要分为几个类型":["3.7"],"全局作用域":["3.7"],"新增了箭头函数":["3.9"],"es6新增了模块化":["3.12"],"生成器":["3.14"],"新增简单数据类型symbol":["4.0"],"用于表示一个独一无二的值":["4.0"],"a":["4.0","11.3","11.28","16.2","25.1","28.17","45.2","59.12","62.10"],"symbol":["4.0","11.3","12.18"],"symbol创建实例不需要new":["4.0"],"console":["4.0","13.1","15.3"],"log":["4.0","13.1","15.3"],"不能在调用symbol时使用new关键字":["4.0"],"因为symbol是基本数据类型":["4.0"],"而不是对象":["4.0"],"唯一性":["4.0"],"使用symbol":["4.0"],"创建一个symbol类型的值并赋值给a变量后":["4.0"],"你就得到了一个在内存中独一无二的值":["4.0"],"数据类型的修饰":["4.0"],"文档对象模型":["5.1"],"从网络传给渲染引擎的":["5.1"],"树如何生成":["5.2"],"渲染引擎内部":["5.2"],"有一个叫html":["5.2"],"解析器":["5.2"],"htmlparser":["5.2"],"的模块":["5.2"],"它的职责就是负责将html":["5.2"],"字节流转换为":["5.2"],"结构":["5.2"],"解析器并不是等整个文档加载完成之后再解析的":["5.2"],"而是网络进程加载了多少数据":["5.2"],"解析器便解析多少数据":["5.2"],"网络进程接收到响应头之后":["5.2"],"执行到":["5.4"],"javascript":["5.4","5.5","5.6","15.2","16.3","23.5"],"dom":["5.6","5.13","5.14","5.16","5.17","11.63","27.44","29.3"],"的过程中":["5.6"],"如果遇到了":["5.6"],"脚本":["5.6"],"那么需要先暂停":["5.6"],"解析去执行":["5.6"],"文档解析完毕":["5.7"],"加载js然后html和css":["5.9"],"构建":["5.10"],"树是":["5.11"],"的解析注意点":["5.12"],"操作真实":["5.13"],"的代价":["5.13"],"就是一个js对象模拟的dom树":["5.14"],"参考这篇":["5.14"],"虚拟":["5.14"],"就是为了解决浏览器性能问题而被设计出来的":["5.14"],"dom的实现":["5.15"],"模拟":["5.17"],"document":["5.18","5.25","11.49","21.4"],"表示整个文档":["5.18"],"提供了操作和访问文档的方法和属性":["5.18"],"getelementbyid":["5.19"],"id":["5.19","27.32"],"根据元素的":["5.19"],"属性获取对应的元素节点":["5.19"],"documentelement":["5.20"],"返回文档的根元素节点":["5.20"],"getattribute":["5.21"],"dom元素对象":["5.22"],"element":["5.22","47.0"],"具有许多属性":["5.22"],"用于访问和操作元素的不同方面":["5.22"],"下面列举一些常见的属性":["5.22"],"classlist":["5.22"],"返回一个domtokenlist对象":["5.22"],"包含了元素的类名":["5.22"],"class":["5.22","28.4","28.9","39.0","49.12","50.2","57.7","61.2"],"列表":["5.22"],"alert":["5.24"],"message":["5.24"],"显示一个带有消息和确定按钮的对话框":["5.24"],"confirm":["5.24"],"获取当前窗口的":["5.25"],"type":["5.27","25.4","25.24","56.1","62.15"],"事件的类型":["5.27"],"如":["5.27"],"click":["5.27"],"preventdefault":["5.28"],"取消事件的默认行为":["5.28"],"什么是":["6.1"],"title":["6.2"],"与":["6.2","11.26","11.29","12.22","14.7"],"行内元素和块级元素分别有哪些":["6.3"],"有何区别":["6.3"],"怎样转换":["6.3"],"常见的块级元素":["6.3"],"p":["6.3"],"label的作用是什么":["6.4"],"是怎么用的":["6.4"],"label元素不会向用户呈现任何特殊效果":["6.4"],"但是":["6.4"],"a元素除了用于导航外":["6.5"],"还有什么作用":["6.5"],"怎么处理html5新标签兼容问题":["6.7"],"html5新增了哪些新特性":["6.8"],"移除了哪些元素":["6.8"],"html5主要是关于图像":["6.8"],"位置":["6.8"],"网页的渲染":["6.9"],"渲染树":["6.10"],"当页面发生变化时浏览器会对页面重新绘制":["6.12"],"避免频繁使用":["6.13"],"style":["6.13"],"而是采用修改class的方式":["6.13"],"使":["6.13"],"合成层":["6.14"],"使用css3硬件加速":["6.15"],"将元素的属性设置为transform":["6.15"],"opacity":["6.15"],"层隐式合成的例子":["6.16"],"同合成层重叠也会使元素提升为合成层":["6.17"],"谈谈html语义化":["6.18"],"页面结构":["6.19"],"使页面没有css的情况下":["6.19"],"inline":["6.20"],"frame":["6.20"],"是html中的一个元素":["6.20"],"seo":["7.1"],"所以要在title里面言简意赅的体现出页面的主要内容":["7.3"],"关键词密度":["7.4"],"页面上经常会有各种图片":["7.5"],"对于搜索引擎来说":["7.5"],"它是不识别图片上的内容的":["7.5"],"你可能知道代码中img标签的alt属性是为了图片加载失败的时候":["7.5"],"web标准简单来说可以分为结构":["8.1"],"需要声明":["8.2"],"doctype":["8.2"],"需要定义语言编码":["8.2"],"标签规范可以提高搜索引擎对页面的抓取效率":["8.3"],"对seo":["8.3"],"hypertext":["9.1","9.30"],"transfer":["9.1"],"protocal":["9.1"],"全称为超文本传输协议":["9.1"],"支持客户端":["9.2"],"服务端模式":["9.2"],"简单快速":["9.2"],"ip":["9.3","9.20"],"http协议传输的数据都是未加密的":["9.4"],"也就是明文的":["9.4"],"可以用抓包工具直接抓下来并且可见":["9.4"],"而https则是利用了网景公司设计的ssl":["9.4"],"secure":["9.4"],"0与http2":["9.5"],"协议":["9.6"],"请求行包括三个方面":["9.8"],"请求方法":["9.8"],"请求地址":["9.8"],"协议版本":["9.8"],"方法名":["9.8"],"功能":["9.8"],"向指定的资源发出":["9.8"],"一般用于信息获取":["9.9"],"使用url传递参数并且可见":["9.9"],"无法使用缓存文件":["9.10"],"请求头可用于传递一些附加信息":["9.11"],"格式为":["9.11"],"键":["9.11"],"值":["9.11"],"注意":["9.11","11.61"],"冒号后面有一个空格":["9.11"],"常见的请求":["9.11"],"header":["9.11"],"名称":["9.11"],"作用":["9.11","11.57","11.58"],"authorization":["9.11"],"用于设置身份认证信息":["9.11"],"user":["9.11","9.29"],"又叫请求正文":["9.12"],"http响应报文分为三个部分":["9.13"],"状态码":["9.14"],"对应的信息":["9.14"],"2xx":["9.15"],"成功":["9.15"],"服务器已成功处理了请求":["9.15"],"通常":["9.15"],"这表示服务器提供了请求的网页":["9.15"],"已创建":["9.15"],"请求成功并且服务器创建了新的资源":["9.15"],"已接受":["9.15"],"服务器已接受请求":["9.15"],"但尚未处理":["9.15"],"非授权信息":["9.15"],"但返回的信息可能来自另一来源":["9.15"],"无内容":["9.15"],"服务器成功处理了请求":["9.15"],"响应体":["9.16"],"参考这篇博文":["9.17"],"url":["9.17","11.61"],"解析":["9.18"],"查询":["9.19"],"连接":["9.20"],"服务器处理收到的请求":["9.21"],"浏览器解码响应":["9.22"],"建立连接是三次握手":["9.24"],"three":["9.25"],"way":["9.25","9.26"],"handshake":["9.25","9.26"],"tcp":["9.26","9.29"],"的连接的拆除需要发送四个包":["9.26"],"因此称为四次挥手":["9.26"],"four":["9.26"],"transmission":["9.29"],"control":["9.29"],"protocol":["9.29"],"udp":["9.29"],"datagram":["9.29"],"是两种在计算机网络中常用的传输层协议":["9.29"],"session":["9.31"],"token":["9.31"],"是一种":["9.31"],"存储在客户端":["9.31"],"通常是浏览器":["9.31"],"的小型文本文件":["9.31"],"由服务器通过":["9.31"],"响应头":["9.31"],"进程和线程是操作系统中用于执行任务的两个基本概念":["9.32"],"cross":["10.1","10.3"],"site":["10.1","10.3"],"scripting":["10.1"],"攻击是一种常见的":["10.1"],"web":["10.1"],"安全漏洞":["10.1"],"也是":["10.1"],"owasp":["10.1"],"top":["10.1","36.10"],"攻击中排名前三的漏洞之一":["10.1"],"它通常利用":["10.1"],"web安全是指保护web应用程序和web服务器免受各种安全威胁的一系列措施":["10.2"],"web安全覆盖了很多方面":["10.2"],"包括但不限于以下几个方面":["10.2"],"身份认证和授权":["10.2"],"身份认证是验证用户身份的过程":["10.2"],"而授权是确定用户是否有权访问某些资源的过程":["10.2"],"csrf":["10.3","10.4"],"攻击的措施":["10.4","10.5"],"xss":["10.5"],"输入验证和过滤":["10.5"],"对于用户输入的数据":["10.5"],"对称加密是一种加密方式":["10.7"],"js数据类型判断":["11.3"],"typeof":["11.3","25.32","38.4"],"检测基础数据类型和函数很好用":["11.3"],"它能准确判断出的数据类型有":["11.3"],"number":["11.3","11.26","25.11"],"string":["11.3","25.1","25.3","25.4","25.11","25.21"],"boolean":["11.3","25.11"],"undefined":["11.3","16.2"],"bigint":["11.3"],"function":["11.3","11.27","11.53","13.9","15.3","25.2","25.3","25.21","25.32","28.8","28.15","28.29","28.32","33.7","38.1","38.2","38.4","38.5","40.0","40.1","41.0","44.3","44.4","44.5","45.1","45.5","46.1","46.2","46.3","46.4","46.7","47.0","47.1","48.5","48.9","48.11","48.16","49.1","49.4","49.8","49.9","49.11","49.12","50.1","51.1","51.2","53.5","54.0"],"它的缺点就是不能准确判断":["11.3"],"null":["11.3","11.35","11.38","12.13","38.4","41.0","48.16","49.11","49.12"],"的类型":["11.3"],"而是返回":["11.3"],"object":["11.3","11.62","11.63","12.6","12.12","12.15","14.9","25.11","25.32","28.9","28.16","38.4","44.2"],"对于数组":["11.3"],"日期":["11.3"],"普通对象等数据":["11.3"],"统一返回":["11.3"],"所以在判断基本数据类型":["11.3"],"除了":["11.3"],"和函数类型时":["11.3"],"都会使用它":["11.3"],"num":["11.3","51.2"],"str":["11.3"],"true":["11.3","11.41","12.22","16.2","48.16"],"false":["11.3","12.22"],"func":["11.3"],"有":["11.5"],"如果一个script加了defer属性":["11.6"],"class类里的函数默认是严格模式":["11.9"],"执行机制":["11.10"],"同步任务执行完":["11.11"],"就会去任务队列中拿一个宏任务放到执行栈中执行":["11.11"],"执行完该宏任务中的所有微任务":["11.11"],"再到任务队列中拿宏任务":["11.11"],"同步任务":["11.12","36.14"],"指排队在主线程上依次执行的任务":["11.12"],"事件循环由宏任务和在":["11.13"],"settimeout的回调不一定在指定时间后能执行":["11.14"],"永远大于":["11.15"],"调用栈":["11.16"],"深拷贝是将一个对象从内存中完整的拷贝一份出来":["11.18"],"如果属性是基本类型":["11.19"],"赋值":["11.20"],"新对象改变":["11.20"],"在javascript中":["11.21","36.13"],"closure":["11.21"],"是指能够访问外部函数作用域中变量的函数":["11.21"],"当一个内部函数引用了其外部函数的变量时":["11.21"],"就形成了一个闭包":["11.21"],"比如":["11.22"],"从全局对象":["11.24"],"window":["11.24"],"函数在执行时":["11.25"],"isnan的区别":["11.26"],"找到静态方法定义在实例对象上的属性":["11.27"],"找不到实例方法定义在原型对象上的属性":["11.27"],"person":["11.27","15.3","25.19"],"tostring":["11.29","12.30","52.32","53.2"],"把基本数据类型转化为对应的引用数据类型的操作":["11.32"],"将引用数据类型转化为对应的基本数据类型的操作":["11.33"],"通过valueof或者tostring方法实现拆箱操作":["11.33"],"var":["11.33","12.26","49.4","49.11","49.12","62.10","62.13"],"objnum":["11.33"],"都是空变量":["11.34"],"都是假值":["11.34"],"的区别":["11.36","14.7"],"按照双等号左右两边的转换规则":["11.41"],"匿名函数":["11.43"],"三种":["11.44","36.8"],"第三个变量传一个布尔值":["11.45"],"函数声明":["11.46","25.2"],"享受函数提升":["11.46"],"函数表达式":["11.46"],"事件冒泡":["11.47"],"ready":["11.49"],"当所有子元素都需要绑定相同的事件的时候":["11.52"],"使用":["11.53","11.73","55.4"],"map":["11.53","14.0","14.5","14.10","52.9"],"去重":["11.53"],"quchong1":["11.53"],"arr":["11.53","25.1","33.7","36.0","45.1","47.0","50.1","50.2","51.1","53.4","53.5","53.6","53.7"],"有什么特点":["11.54"],"参考":["11.55","11.69","14.7","25.0","62.2"],"super":["11.56"],"否影响原数组":["11.57"],"array":["11.57","11.71","14.4","17.1","33.7"],"方法":["11.57","11.58","14.5","36.0"],"是否影响原数组":["11.57"],"push":["11.57","47.0","50.2","52.19"],"在数组后添加元素":["11.57"],"math":["11.58"],"max":["11.58"],"在js中有三种类型的弹出框可用":["11.59"],"日期转换为iso标准":["11.60"],"toisostring":["11.60"],"encodeuri":["11.61"],"函数用于在js中对url进行编码":["11.61"],"它将url字符串作为参数并返回编码的字符串":["11.61"],"有哪些api":["11.62"],"bom就是browser":["11.62"],"model":["11.62","57.6"],"浏览器对象模型":["11.62"],"api":["11.62","28.17","33.3"],"的关系":["11.63"],"bom全称browser":["11.63"],"和substring":["11.64"],"函数的形式为substr":["11.65"],"函数的形式为substring":["11.66"],"use":["11.67"],"类数组":["11.70"],"arguments":["11.70"],"是一个特殊的对象":["11.70"],"表示函数调用时传入的参数列表":["11.70"],"from":["11.71","17.1","27.32","52.15","55.2","56.2","59.2"],"in和for":["11.72"],"of":["11.72","11.73","17.1","52.16"],"in用key遍历":["11.72"],"用于遍历对象的可枚举属性":["11.72"],"遍历的顺序不保证与对象属性的添加顺序一致":["11.72"],"of用值遍历":["11.72"],"用于遍历可迭代对象":["11.72"],"iterable":["11.72","11.73"],"的元素":["11.72"],"有哪些":["11.73"],"for":["11.73","12.26"],"循环来遍历其元素":["11.73"],"要成为可迭代对象":["11.73"],"创建一个空对象":["11.74"],"关键字会创建一个空对象":["11.74"],"event":["11.75"],"target":["11.75","28.33"],"表示事件的目标元素":["11.75"],"即触发事件的":["11.75"],"具体元素":["11.75"],"prototype":["12.0","12.4","12.13","12.14","12.15","12.20","12.28","12.30","12.31","46.2","46.3","46.4","46.7","47.0","48.5","48.7","48.8","48.9","48.10","48.11","48.16","49.2","49.4","49.5","49.6","49.7","49.8","49.9","49.11","50.1","51.1","52.1","52.2","52.3","52.4","52.5","52.6","52.7","52.8","52.9","52.10","52.11","52.12","52.13","52.14","52.17","52.18","52.19","52.20","52.21","52.22","52.23","52.24","52.25","52.26","52.27","52.28","52.29","52.30","52.31","52.32","62.3"],"在":["12.1","15.1","15.2","25.9","27.33","28.24"],"创建一个新的":["12.2"],"assign":["12.3"],"通过复制一个或多个对象来创建一个新的对象":["12.3"],"浅拷贝":["12.3"],"create":["12.4"],"方法用于创建一个新的实例对象":["12.4"],"使用现有的对象来作为新创建实例对象的原型对象":["12.4"],"新创建实例对象":["12.4"],"proto":["12.4"],"defineproperty":["12.5","12.6","27.39","28.7","28.15"],"obj":["12.6","12.26","25.32","28.17","38.4"],"prop":["12.6","25.32"],"descriptor":["12.6"],"defineproperties":["12.7"],"给对象添加多个属性并分别指定它们的配置":["12.7"],"entries":["12.8","52.24"],"方法返回一个给定对象自身可枚举属性的键值对数组":["12.8"],"freeze":["12.9"],"fromentries":["12.10"],"getprototypeof":["12.11","12.12"],"要返回其原型的对象":["12.12"],"setprototypeof":["12.13"],"方法设置一个指定的对象的原型":["12.13"],"即":["12.13"],"内部":["12.13"],"属性":["12.13","27.16","28.4","28.21","56.8"],"到另一个对象或":["12.13"],"isprototypeof":["12.14"],"方法用于测试一个对象是否存在于另一个对象的原型链上":["12.14"],"针对对象本身":["12.14"],"不是":["12.14"],"对象":["12.14","28.19","28.21"],"prototypeobj":["12.14"],"运算符用于检测构造函数的":["12.15"],"属性是否出现在某个实例对象的原型链上":["12.15"],"在表达式":["12.15"],"getownpropertydescriptor":["12.16"],"方法返回指定对象上一个自有属性对应的属性描述符":["12.16"],"getownpropertynames":["12.17"],"getownpropertysymbols":["12.18"],"方法返回一个给定对象自身的所有":["12.18"],"属性的数组":["12.18"],"hasown":["12.19"],"如果指定的对象自身":["12.19"],"有指定的属性":["12.19"],"则":["12.19"],"静态方法":["12.19","13.8","17.1"],"hasownproperty":["12.20"],"方法会返回一个布尔值":["12.20"],"指示对象自身属性中是否具有指定的属性":["12.20"],"也就是":["12.20"],"是否有指定的键":["12.20"],"is":["12.21","12.22"],"方法判断两个值是否为同一个值":["12.21"],"不同":["12.22"],"运算符在判断相等前对两边的变量":["12.22"],"如果它们不是同一类型":["12.22"],"进行强制转换":["12.22"],"这种行为将":["12.22"],"判断为":["12.22"],"而":["12.22"],"isextensible":["12.23"],"isfrozen":["12.24"],"keys":["12.25","28.9","52.22"],"values":["12.26","52.23"],"方法返回一个给定对象自身的所有可枚举属性值的数组":["12.26"],"值的顺序与使用":["12.26"],"in":["12.26"],"循环的顺序相同":["12.26"],"区别在于":["12.26"],"循环枚举原型链中的属性":["12.26"],"foo":["12.26"],"preventextensions":["12.27"],"seal":["12.29"],"方法返回一个表示该对象的字符串":["12.30"],"该方法旨在重写":["12.30"],"自定义":["12.30"],"派生类对象的类型转换的逻辑":["12.30"],"默认情况下":["12.30"],"valueof":["12.31"],"的":["12.31"],"promise是es6处理异步的一种方式":["13.0"],"它的本质是一个对象":["13.0"],"一":["13.1"],"promise":["13.1","13.3","13.5","13.6","13.8","36.13"],"then":["13.1"],"res":["13.1"],"catch":["13.1"],"err":["13.1"],"它有三种状态分别为":["13.2"],"初始状态pending":["13.2"],"已完成fulfilled":["13.2"],"已失败rejected":["13.2"],"如果resolve传入一个普通的值或者对象":["13.3"],"只能传递接受一个参数":["13.3"],"那么这个值会作为then回调的参数":["13.3"],"resolve":["13.3","13.5","13.8","39.0"],"实例方法":["13.4","14.3"],"then方法可以接受参数":["13.5"],"一个参数为成功的回调":["13.5"],"另一个参数为失败的回调":["13.5"],"reject":["13.5","13.8"],"request":["13.5"],"success":["13.5","56.1"],"catch的多次调用":["13.6"],"无论promise状态是fulfilled还是rejected都会执行一次finally方法":["13.7"],"ice":["13.8"],"等价于":["13.8"],"error":["13.8"],"all":["13.8"],"fulfilled状态":["13.8"],"promise1":["13.8"],"settimeout":["13.8","62.1"],"resolve里储存异步数据":["13.9"],"外部则还是同步的":["13.9"],"fn":["13.9","41.0"],"await":["13.10"],"acync里面没有await则不起作用相当于还是同步的":["13.10"],"await调用函数后":["13.10"],"当前函数后的所有代码":["13.10"],"集合":["14.1","14.7"],"是一种叫做集合的数据结构":["14.1"],"向":["14.1"],"加入值的时候":["14.1"],"不会发生类型转换":["14.1"],"实例属性":["14.2"],"constructor":["14.2","14.8","28.4","28.9","39.0","49.12","50.2"],"构造函数":["14.2","14.8"],"value":["14.3","19.2","28.9","28.26","39.0","46.2","50.2"],"存在即删除集合中value":["14.3"],"has":["14.3"],"from方法可以将":["14.4"],"set":["14.4","14.6","28.22","36.0"],"结构转为数组":["14.4"],"filter":["14.5","52.14"],"很容易实现交集":["14.6"],"intersect":["14.6"],"并集":["14.6"],"union":["14.6"],"差集":["14.6"],"difference":["14.6"],"字典":["14.7"],"size":["14.8","49.10","57.5","57.6"],"转":["14.9","14.10"],"node":["15.1","20.3","49.11","49.12"],"环境下":["15.1"],"全局的":["15.1"],"this":["15.2","15.3","27.51","28.4","28.9","39.0","46.7","47.0","48.16","49.11","49.12","50.1","50.2","51.1"],"的值一般有以下几种情况":["15.2"],"全局作用域中的":["15.2"],"new操作符创建实例":["15.3"],"name":["15.3","25.19","27.32","56.8","59.1","59.7","59.8","59.9","59.10","59.12","59.13","59.14","59.15","59.16"],"相等运算符":["16.1","16.2"],"最终转换为数字进行比较":["16.2"],"nan":["16.2"],"中一些常见运算符的优先级":["16.3"],"从高到低":["16.3"],"从可迭代或者类数组对象创建一个浅拷贝的数组实例":["17.1"],"创建一个数组":["17.1"],"参数是数组的值":["17.1"],"通过使用迭代器和解构赋值把索引和值一起返回":["17.4"],"regular":["18.0"],"expression":["18.0"],"简称regexp":["18.0"],"是一种强大的文本匹配工具":["18.0"],"它可以用来查找":["18.0"],"替换":["18.0"],"分割文本等":["18.0"],"下面是一些基本的正则表达式语法和用法":["18.0"],"创建正则表达式对象":["18.0"],"表单输入框":["19.2"],"常规":["19.2"],"禁用":["19.2"],"尺寸":["19.2"],"一键清空":["19.2"],"密码显示隐藏":["19.2"],"带icon图标":["19.2"],"文本域自适应宽高":["19.2"],"复合型输入框":["19.2"],"input组件的核心功能":["19.2"],"双向数据绑定":["19.2"],"原生input的v":["19.2"],"model其实就是":["19.2"],"因为vite打包样式文件是会把所有的组件的样式合并到一个css文件中":["19.3"],"gulp很方便":["19.4"],"在组件库上ts主要用来写打包的配置文件":["19.5"],"把api放在一个文件":["19.6"],"pinia里存放了一个data是一个空数组":["19.7"],"js构建的后端服务器怎么写的":["19.8"],"并行开发":["19.9"],"前后端分离允许前端和后端团队并行开发":["19.9"],"不受彼此的依赖关系限制":["19.9"],"这可以显著加快整个开发过程":["19.9"],"2是http":["19.10"],"1的升级版本":["19.10"],"mitm":["19.11"],"在https通信中":["19.11"],"配置资源文件的缓存可以通过使用http响应头中的cache":["19.12"],"control和expires字段来实现":["19.12"],"这些字段可以告诉客户端":["19.12"],"浏览器":["19.12","21.10"],"如何缓存和重新获取资源文件":["19.12"],"使用cache":["19.12"],"shift":["19.13","50.1","50.2","52.20"],"布局偏移":["19.13"],"代码优化":["19.14"],"选择高效的框架和库":["19.14"],"选择经过优化和性能良好的框架和库":["19.14"],"以确保代码执行效率和响应速度":["19.14"],"减少重绘和回流":["19.14"],"避免频繁的dom操作":["19.14"],"合并多个操作":["19.14"],"webgpu是一种新兴的web标准":["19.15"],"而pnpm使用":["19.16"],"硬链接技术":["19.16"],"如何处理":["20.1"],"es6":["20.1","20.4"],"语法上面":["20.2"],"commonjs":["20.2","20.4"],"要求":["20.3"],"模块import命令":["20.4"],"可以":["20.4"],"是在package":["20.5"],"json文件的exports字段":["20.5"],"指明两种格式模块各自的加载入口":["20.5"],"可以直接在node中使用":["20.6"],"process表示控制当前node进程":["20.7"],"获取文件夹路径":["20.8"],"读取磁盘中的文件":["20.9"],"cookie":["21.4"],"cookie的创建":["21.4"],"修改和创建相同":["21.4"],"创建同样名称会覆盖之前的":["21.4"],"username":["21.4"],"john":["21.4"],"使用token机制的身份验证方法":["21.8"],"客户端使用用户名和密码请求登录":["21.8"],"客户端":["21.8"],"cookie是一种在客户端":["21.10"],"存储数据的机制":["21.10"],"它允许服务器在浏览器中存储少量的数据":["21.10"],"并在需要时读取这些数据":["21.10"],"相较于webpack":["22.0"],"json":["22.1","23.5"],"pnpm":["22.2"],"config":["22.3","23.1"],"使用步骤":["23.0"],"单一入口":["23.3"],"打包成一个文件":["23.3"],"filename":["23.4"],"webpack":["23.5","23.7"],"只能理解":["23.5"],"文件":["23.5"],"这是":["23.5"],"兼容问题":["23.6"],"将新代码转为旧代码":["23.6"],"提高兼容性":["23.6"],"插件":["23.7"],"dev":["23.8"],"sourcemap":["23.9"],"这里是":["24.0"],"的面试题":["24.0"],"ts":["25.1","25.2","25.6","25.10","25.13","25.17","25.19","25.20","25.21","25.25","25.32"],"let":["25.1","25.6","25.10","25.13","41.0","46.2","46.4","48.16","53.4","54.1","54.2","54.3","54.5"],"sun":["25.2"],"可选参数":["25.3"],"buildnmae":["25.3"],"firstname":["25.3"],"函数重载或方法重载是使用相同名称和不同参数数量或类型创建多个方法的一种能力":["25.4"],"方法就是为同一个函数提供多个函数类型定义来进行函数重载":["25.4"],"编译器会根据这个列表去处理函数的调用":["25.4"],"combinable":["25.4"],"元组是":["25.5"],"typescript":["25.5","25.16","25.17","25.24","25.32"],"中特有的类型":["25.5"],"void表示没有任何类型":["25.7"],"和其他类型是平等关系":["25.7"],"不能直接赋值":["25.7"],"never类型表示的是那些永不存在的值的类型":["25.8"],"值会永不存在的两种情况":["25.8"],"如果一个函数执行时抛出了异常":["25.8"],"那么这个函数永远不存在返回值":["25.8"],"因为抛出异常会直接中断程序运行":["25.8"],"这使得程序运行不到返回值那一步":["25.8"],"即具有不可达的终点":["25.8"],"也就永不存在返回了":["25.8"],"函数中执行无限循环的代码":["25.8"],"死循环":["25.8"],"unknown与any一样":["25.10"],"所有类型都可以分配给unknown":["25.10"],"unknown与any的最大区别是":["25.10"],"任何类型的值可以赋值给any":["25.10"],"同时any类型的值也可以赋值给任何类型":["25.10"],"任何类型的值都可以赋值给它":["25.10"],"但它只能赋值给unknown和any":["25.10"],"notsure":["25.10"],"小":["25.11"],"代表的是所有非原始类型":["25.11"],"也就是说我们不能把":["25.11"],"我们把":["25.12"],"尖括号":["25.13"],"语法":["25.13"],"在上下文中当类型检查器无法断定类型时":["25.14"],"一个新的后缀表达式操作符":["25.14"],"允许在实例属性和变量声明后面放置一个":["25.15"],"号":["25.15"],"从而告诉":["25.15"],"支持":["25.16"],"将":["25.17"],"定义为一个不可变更的常量":["25.17"],"在缺省类型注解的情况下":["25.17"],"推断出它的类型直接由赋值字面量的类型决定":["25.17"],"在面向对象语言中":["25.18"],"只读属性":["25.19"],"interface":["25.19","25.21","25.23"],"readonly":["25.19","28.25"],"有时候我们希望一个接口中除了包含必选和可选属性之外":["25.20"],"还允许有其他的任意属性":["25.20"],"这时我们可以使用":["25.20"],"索引签名":["25.20"],"的形式来满足上述要求":["25.20"],"所谓的鸭式辨型法就是像鸭子一样走路并且嘎嘎叫的就叫鸭子":["25.21"],"即具有鸭子特征的认为它就是鸭子":["25.21"],"也就是通过制定规则来判定对象是否实现这个接口":["25.21"],"labeledvalue":["25.21"],"label":["25.21"],"props":["25.23","27.25","27.49","34.4"],"functions":["25.25"],"两者都可以用来描述对象或函数的类型":["25.25"],"但是语法不同":["25.25"],"types":["25.26"],"与接口不同":["25.26"],"类型别名还可以用于其他类型":["25.26"],"如基本类型":["25.26"],"原始值":["25.26"],"类型别名不可以":["25.27"],"与类型别名不同":["25.27"],"两者的扩展方式不同":["25.28"],"但并不互斥":["25.28"],"接口可以扩展类型别名":["25.28"],"同理":["25.28"],"类型别名也可以扩展接口":["25.28"],"接口的扩展就是继承":["25.28"],"通过":["25.28","28.17"],"用了一个":["25.29"],"类型":["25.29"],"t":["25.29","25.32"],"这个":["25.29"],"类型约束使用":["25.30"],"extends":["25.30","25.32"],"关键字":["25.30"],"的主要用途是在类型上下文中获取变量或者属性的类型":["25.32"],"keyof":["25.32"],"操作符是在":["25.32"],"版本引入的":["25.32"],"该操作符可以用于获取某种类型的所有键":["25.32"],"其返回类型是联合类型":["25.32"],"k":["25.32"],"key":["25.32","28.33","46.2","46.4","48.3","48.5","48.11","48.16"],"return":["25.32","27.32","38.4","40.0","46.7","50.1","50.2"],"在以上代码中":["25.32"],"我们使用了":["25.32"],"的泛型和泛型约束":["25.32"],"首先定义了":["25.32"],"类型并使用":["25.32"],"关键字约束该类型必须是":["25.32"],"router":["26.0","26.1"],"router是什么":["26.2"],"描述一下它的原理":["26.2"],"vue":["26.3","27.15","27.16","27.48","29.0","29.1","36.11"],"即url中的":["26.4"],"以及后面部分":["26.4"],"html5":["26.5"],"mode是html5新增":["26.5"],"所以也称为history":["26.5"],"内置组件跳转":["26.6"],"为什么":["26.7"],"如果需要用户登陆":["26.7"],"我们来守卫页面":["26.7"],"强制用户跳转到登录页面":["26.7"],"路由守卫分为全局路由守卫":["26.7"],"路由独享守卫":["26.7"],"组件路由守卫":["26.7"],"全局路由守卫":["26.7"],"全局前置守卫beforeeach":["26.7"],"接收to":["26.7"],"导航被触发":["26.8"],"在失活的组件里调用":["26.8"],"beforerouteleave":["26.8"],"守卫":["26.8"],"为给客户更好的客户体验":["26.9"],"router路由懒加载的方式":["26.11"],"router配置路由":["26.11"],"将任意信息附加到路由上":["26.12"],"有时候":["26.13"],"进入某个路由后":["26.13"],"动态路由参数":["26.14","26.15"],"params":["26.15"],"传递方式":["26.15"],"是通过路由的路径进行传递的":["26.15"],"他是一个流行的前端框架":["27.1"],"单页应用":["27.2"],"vue2":["27.3","27.25","27.51","34.0","34.4"],"选项式api":["27.3","34.0"],"vue3":["27.3","27.25","34.0","34.4"],"setup":["27.3","27.5"],"setup函数是组件中的一个特殊函数":["27.4"],"beforecreate":["27.5"],"created":["27.5","29.3"],"常用于":["27.5"],"数据请求":["27.5"],"渲染过程":["27.6"],"父beforecreate":["27.6"],"如果子组件是异步组件的话它们的执行顺序会发生改变":["27.7"],"if和v":["27.8"],"for和v":["27.9"],"if优先级":["27.9"],"computed是计算属性":["27.10"],"当一个属性受一个或者多个属性影响的时候可以使用":["27.10"],"watch是侦听器":["27.10"],"当我们需要根据一个属性的变化而做出一些处理的时候":["27.10"],"computed和methods的差异是它具备缓存性":["27.11"],"计算属性computed常用场景是":["27.12"],"computed":["27.13","27.17"],"一种是方法":["27.14"],"在创建":["27.15","27.16"],"watch":["27.18"],"写法上的区别":["27.19","33.3"],"vue2使用的是options":["27.19","33.3"],"选项":["27.19","33.3"],"解析组件配置":["27.20"],"vue首先会解析组件的配置对象":["27.20"],"包括模板":["27.20"],"template":["27.20","27.55"],"数据":["27.20"],"data":["27.20","28.4","28.8","49.4","49.9","49.11","49.12"],"计算属性":["27.20"],"实现响应式的核心是通过":["27.21"],"数据劫持":["27.21","28.7"],"响应式数组":["27.22"],"将组件实例挂载到全局":["27.23"],"插槽slot可以理解为占坑":["27.24"],"当使用一个组件的时候":["27.24"],"在组件标签里的对应的":["27.24"],"内容就会替换":["27.24"],"掉这个组件中的":["27.24"],"slot标签":["27.24"],"插槽分为默认插槽":["27.24"],"具名插槽":["27.24","27.55"],"作用域插槽":["27.24","27.30"],"默认插槽":["27.24"],"子组件中用slot标签来确定渲染位置":["27.24"],"方式":["27.25","34.4"],"父传子":["27.25","27.49","34.4"],"props定义在子组件里":["27.26"],"子组件通过自定义事件往父组件里传值":["27.27"],"父组件调用子组件通过v":["27.27"],"on接收":["27.27"],"父组件里给子组件自定义事件":["27.27"],"xxx":["27.27"],"在vue中":["27.29"],"使用ref可以在组件中引用子组件或dom元素":["27.29"],"可以传递数据的插槽":["27.30"],"子组件可以将数据传给父组件":["27.30"],"vuex是vue中的全局状态管理框架":["27.31"],"它可以管理应用的所有组件的状态":["27.31"],"并不是每个项目都需要引入vuex的":["27.31"],"创建store":["27.32"],"import":["27.32","55.2","56.2","56.3","59.2"],"definestore":["27.32"],"exporet":["27.32"],"default":["27.32"],"mystore":["27.32"],"ljt":["27.32"],"state":["27.32","28.21","34.5","39.0"],"孙悟空":["27.32"],"action":["27.33"],"里调用其他":["27.33"],"store":["27.33","34.6"],"里的":["27.33"],"也比较简单":["27.33"],"引入对应的":["27.33"],"alive":["27.35"],"keepalive":["27.35"],"是一个内置组件":["27.35"],"它的功能是在多个组件间动态切换时缓存被移除的组件实例":["27.35"],"首次执行执行顺序":["27.36"],"mixin":["27.38"],"混入":["27.38"],"proxy":["27.39","28.17","28.19"],"vue3新增了两个内置组件分别是teleport和suspense":["27.40"],"可以称之为传送门":["27.41"],"作用将其插槽内容渲染到":["27.41"],"suspense":["27.42"],"在下次":["27.44"],"diff算法":["27.45"],"每当我们用原生js或者jq操作dom时":["27.46"],"对比两棵vdom":["27.47"],"树":["27.47"],"找到有差异的部分":["27.47"],"生成新的虚拟dom树":["27.48"],"在每次数据更新时":["27.48"],"js会重新构建一棵新的虚拟dom树":["27.48"],"表示新的ui结构":["27.48"],"透传":["27.49"],"在父组件里引用的子组件上使用":["27.49"],"v":["27.49","57.6","57.7"],"bind":["27.49","39.0"],"定义一个方法":["27.50"],"将参数hide传递给父组件":["27.50"],"父组件通过":["27.50"],"nexttick":["27.51"],"for的key":["27.52"],"suspense是一种用于在异步组件加载期间显示占位符内容的特性":["27.53"],"ref适合基础类型的值将其包装为响应式对象":["27.54"],"父":["27.55"],"的响应式":["28.0"],"当对象之间存在一对多的依赖关系时":["28.2"],"其中一个对象的状态发生改变":["28.2"],"基于一个事件":["28.3"],"主题":["28.3"],"通道":["28.3"],"希望接收通知的对象":["28.3"],"大意":["28.4"],"通过observe里的definereactive方法里面的object":["28.4"],"defineproperty方法的get":["28.4"],"读取数据触发":["28.4"],"收集依赖":["28.4"],"和set":["28.4"],"修改数据触发":["28.4"],"派发更新依赖":["28.4"],"进行响应式的绑定":["28.4"],"在set里数据变了":["28.4"],"监听到了就去更新视图":["28.4"],"details":["28.4","49.11","49.12"],"显示代码":["28.4"],"响应式数据处理":["28.4"],"构造一个响应式对象":["28.4"],"observer":["28.4","28.9"],"walk":["28.4","28.9"],"遍历对象的每个":["28.4"],"已定义":["28.4"],"分别执行":["28.4"],"响应系统":["28.5"],"其核心有三点":["28.5"],"observe":["28.5","28.6"],"响应式":["28.5"],"watcher":["28.5","28.11"],"数据代理":["28.7"],"被object":["28.7"],"defineproperty绑定过的对象":["28.7"],"我们需要一个全局的变量来保存这个属性的值":["28.8"],"value使用了参数默认值":["28.8"],"如果obj有多个属性呢":["28.9"],"我们可以新建一个类observer来遍历该对象":["28.9"],"vue中用observer类来管理上述响应式化object":["28.9"],"defineproperty的过程":["28.9"],"改写了array":["28.10"],"dep收集的依赖就是watcher":["28.11"],"watcher订阅一个或多个数据":["28.12"],"直接渲染render":["28.13"],"有通过computed计算属性改变":["28.13"],"常见的场景有下面这几个":["28.13"],"数据变":["28.13"],"使用数据的视图变":["28.13"],"使用数据的计算属性变":["28.13"],"使用计算属性的视图变":["28.13"],"dep":["28.14"],"使用发布订阅者模式":["28.14"],"每个属性拥有自己的消息订阅器":["28.14"],"dep类里的this":["28.14"],"subs":["28.14"],"我们如何知道data中的某个属性被使用了":["28.15"],"答案就是object":["28.15"],"因为读取某个属性就会触发get方法":["28.15"],"可以将代码进行如下改造":["28.15"],"的响应式原理":["28.16"],"因为":["28.16"],"的响应式原理依赖了":["28.17"],"这个核心":["28.17"],"可以劫持对象的某些操作":["28.17"],"get时":["28.18"],"收集不同代理对象不同属性所依赖的副作用函数":["28.18"],"set时":["28.18"],"取出当前属性所依赖的所有副作用函数":["28.18"],"重新执行":["28.18"],"内部的执行过程":["28.18"],"reactive":["28.19","28.25"],"会返回如下一个":["28.19"],"effect":["28.20","28.21","41.0"],"首先定义全局的":["28.20"],"activeeffect":["28.20","41.0"],"它永远指向当前正在执行的":["28.20"],"track":["28.21"],"会建立一个":["28.21"],"counter":["28.21"],"的一个依赖关系":["28.21"],"trigger":["28.22"],"数据变化的时候就会触发代理对象的":["28.22"],"如果函数依赖于外部的状态":["28.23"],"3的响应式原理比较":["28.24"],"响应式数据声明的核心api":["28.25"],"ref":["28.25","28.26"],"shallowref":["28.25"],"shallowreactive":["28.25"],"shallowreadonly":["28.25"],"shallow浅层作用形式":["28.25"],"虽然常常有文章说一般只用来":["28.26"],"声明基础数据的响应式":["28.26"],"但是其实所有的数据类型声明响应式时都可以使用ref":["28.26"],"只是内部为了同时实现基础数据的响应式处理":["28.26"],"封装成了一个具有":["28.26"],"activeeffect自动把effect函数收集起来放进对应的dep里":["28.27"],"track函数用来把effect函数收集起来放进dep里":["28.28"],"dep为什么用set呢":["28.28"],"因为set可以自动去重":["28.28"],"搜集起来之后":["28.28"],"以后只要变量一改变":["28.28"],"就执行trigger函数通知dep里所有依赖money变量的effect函数执行":["28.28"],"对象里每一个属性都有一个dep":["28.30"],"来存储每个对象对应的map":["28.31"],"receiver相当于proxy代理的对象":["28.32"],"替代原对象target":["28.32"],"在receiver上访问和修改":["28.32"],"vue中指令的注册和组件的注册一样":["29.2"],"提供了全局注册和局部注册两种方式":["29.2"],"全局注册就是指我们定义的指令可以在项目中任意地方都可以使用":["29.2"],"局部注册则意味着只能在注册的当前组件中使用":["29.2"],"接下来我们就来学习这两种注册指令的方式":["29.2"],"我们通过app":["29.2"],"directive的方式全局注册指令":["29.2"],"它有两个参数":["29.2"],"directive的第二个参数是钩子函数对象":["29.3"],"mydirective":["29.3"],"在绑定元素的":["29.3"],"attribute":["29.3"],"前":["29.3"],"或事件监听器应用前调用":["29.3"],"el":["29.3","30.0","42.0"],"binding":["29.3","30.0","42.0"],"vnode":["29.3"],"prevvnode":["29.3"],"下面会介绍各个参数的细节":["29.3"],"在元素被插入到":["29.3"],"前调用":["29.3"],"beforemount":["29.3","30.0","42.0"],"当在组件上使用自定义指令时":["29.4"],"main":["29.6"],"中引入指令文件":["29.6"],"copy":["30.0","42.0"],"vcopy":["30.0","42.0"],"copycontent":["30.0","42.0"],"debounce":["31.0","43.0"],"组件库":["33.0"],"你认为一个组件都需要具备什么":["33.0"],"丰富的组件集合":["33.0"],"你是怎么管理的":["33.1"],"vue3的是composition":["33.3"],"vite是es6模块":["33.5"],"利用了浏览器原生支持的":["33.5"],"axios的请求可以通过创建了一个":["33.6"],"数组转树结构":["33.7"],"arraytotree":["33.7"],"pid":["33.7"],"if":["33.7","38.4","48.16","49.11","49.12"],"isarray":["33.7"],"看实际情况":["34.1"],"其实就是一个作用域的问题":["34.2"],"拦截":["34.3"],"状态":["34.5"],"是应用程序的中央数据存储库":["34.5"],"watch适用于需要在属性变化时执行异步或开销较大的操作的场景":["34.7"],"系统学过吗":["34.10"],"组件库还需再加":["35.0"],"使用set数据结构":["36.0"],"newarr":["36.0"],"使用filter":["36.0"],"方法和indexof":["36.0"],"用途不同":["36.2"],"watch用于监听数据的变化并执行相应的操作":["36.2"],"watch可以在以下几个方面使用":["36.3"],"数据监听":["36.3"],"watch最常见的用途是监听数据的变化":["36.3"],"当数据发生变化时":["36.3"],"vue2在created中vue3在onmounted中":["36.5"],"flex布局":["36.6"],"static":["36.10"],"默认值":["36.10"],"元素按照其在文档流中的顺序进行布局":["36.10"],"不进行任何特殊的定位":["36.10"],"此时":["36.10"],"避免阻塞":["36.12"],"代码在执行这些操作期间将无法进行其他任务":["36.12"],"承诺":["36.13"],"是按照代码顺序依次执行的任务":["36.14"],"有事件触发就清空定时器":["38.1"],"开始下一个定时":["38.1"],"在一定时间内执行一次":["38.2"],"deepcopy":["38.4","38.5"],"mypromise":["39.0"],"reason":["39.0"],"rescallbacks":["39.0"],"rejcallbacks":["39.0"],"executor是一个函数参数":["39.0"],"用于执行一个异步操作":["39.0"],"并在操作完成时调用resolve或reject方法":["39.0"],"constructor方法被调用时":["39.0"],"会传入一个executor函数作为参数":["39.0"],"该函数立即执行并传入两个回调函数resolve和reject":["39.0"],"这些回调函数被绑定到this上":["39.0"],"以便在异步操作完成后调用它们":["39.0"],"executor":["39.0"],"promises":["40.0"],"race":["40.1"],"promiserace":["40.1"],"targetmap":["41.0"],"weakmap":["41.0"],"创建":["44.2"],"createperson2":["44.4"],"待定":["44.6"],"不多说闭着眼也写得出来":["45.1"],"bubblesort":["45.1"],"从":["45.2"],"i":["45.2"],"开始从后面挑一个比":["45.2"],"小的且是最小的数与":["45.2"],"默认第一个元素被排好序":["45.3"],"从第二个元素开始依次与之前的元素比较":["45.3"],"指到比较到如果大于当前的的元素则退出循环":["45.3"],"插入到当前的的元素的下一位":["45.3"],"取一个增量gap":["45.4"],"然后将所有距离为gap的元素分在同一组":["45.4"],"并对每一组的元素进行直接插入排序":["45.4"],"然后再取一个比第一增量小的整数作为第二增量":["45.4"],"重复上述操作":["45.4"],"当增量的大小减到1时":["45.4"],"就相当于整个序列被分到一组":["45.4"],"找到一个主元pivot的key和value":["45.5"],"一般是中间的":["45.5"],"让数组形成左边是小于key右边是大于key":["45.5"],"然后左边的和右边的递归继续排序":["45.5"],"quicksort":["45.5"],"hashfunc":["46.1","46.4"],"hashtable":["46.2","46.3","46.4","46.5","46.7"],"index":["46.2","46.4"],"isempty":["46.7"],"count":["46.7"],"普通构造函数封装":["47.0"],"stack":["47.0"],"十进制转二进制":["47.1"],"dec2bin":["47.1"],"二叉搜索树":["48.1"],"bst":["48.1"],"insert":["48.3"],"向树中插入一个新的键":["48.3"],"封装binaryserachtree的构造函数":["48.4"],"还需要封装一个用于保存每一个结点的类node":["48.4"],"插入叶子结点":["48.5"],"binaryserachtree":["48.5","48.7","48.8","48.9","48.10","48.11","48.16"],"从根节点开始":["48.7"],"preordertraversal":["48.7"],"从左子树开始":["48.8"],"根节点在中间":["48.8"],"根节点在最后":["48.9"],"postordertraversal":["48.9"],"min":["48.10"],"search":["48.11"],"递归法":["48.11"],"删除节点要从查找要删的节点开始":["48.12"],"找到节点后":["48.12"],"需要考虑三种情况":["48.12"],"该节点是也结点":["48.12"],"没有子节点":["48.12","48.13"],"比较简单":["48.12"],"该节点有一个子节点":["48.12"],"也相对简单":["48.12"],"这种情况相对比较简单":["48.13"],"我们需要检测current的left以及right是否都为null":["48.13"],"都为null之后还要检测一个东西":["48.13"],"一个子节点":["48.14"],"warning":["48.14"],"caution":["48.14"],"tip":["48.14"],"danger":["48.14"],"这种情况也不是很难":["48.14"],"要删除的current结点":["48.14"],"只有2个连接":["48.14"],"两个子节点":["48.15"],"又分三种情况":["48.15"],"如果我们要删除的节点有两个子节点":["48.15"],"甚至子节点还有子节点":["48.15"],"这种情况下我们需要从下面的子节点中找到一个节点":["48.15"],"来替换当前的节点":["48.15"],"但是找到的这个节点有什么特征呢":["48.15"],"应该是current节点下面所有节点中最接近current节点的":["48.15"],"要么比current节点小一点点":["48.15"],"要么比current节点大一点点":["48.15"],"总结你最接近current":["48.15"],"你就可以用来替换current的位置":["48.15"],"比current小一点点的节点":["48.15"],"一定是current左子树的最大值":["48.15"],"删除":["48.16"],"remove":["48.16"],"current":["48.16","49.11","49.12"],"root":["48.16"],"parent":["48.16"],"isleftchild":["48.16"],"查找删除的节点current":["48.16"],"while":["48.16"],"append":["49.2","49.11","49.12"],"linkedlist":["49.2","49.3","49.4","49.5","49.6","49.7","49.8","49.9","49.11","49.12"],"完整代码":["49.11"],"next":["49.11","49.12"],"head":["49.11","49.12"],"length":["49.11","49.12"],"增":["49.11","49.12"],"newnode":["49.11","49.12"],"第一个节点为空":["49.11","49.12"],"把新节点放在第一个节点":["49.11","49.12"],"最后一个节点":["49.11","49.12"],"else":["49.11","49.12"],"当current":["49.11","49.12"],"next不为空时":["49.11","49.12"],"让current指到下一个data":["49.11","49.12"],"直到current":["49.11","49.12"],"next为空":["49.11"],"最后把新节点赋值给current":["49.11"],"全部代码":["49.12"],"queue":["50.1","50.2","51.1","51.2"],"dequeue":["50.1","50.2"],"front":["50.1","50.2"],"enqueue":["50.2"],"myqueue":["51.2"],"numlist":["51.2"],"every":["52.1"],"判断是否符合条件":["52.1","52.2"],"有一个不符合就不行":["52.1"],"some":["52.2"],"有一个符合就行":["52.2"],"find":["52.3"],"找到符合条件的第一个数":["52.3"],"findlast":["52.4"],"findindex":["52.5"],"找到":["52.5"],"indexof":["52.6"],"lastindexof":["52.7"],"foreach":["52.10"],"方法对数组的每个元素执行一次给定的函数":["52.10"],"flat":["52.11"],"flatmap":["52.12"],"方法对数组中的每个元素应用给定的回调函数":["52.12"],"然后将结果展开一级":["52.12"],"返回一个新数组":["52.12"],"fill":["52.13","59.1"],"用一个固定值填充一个数组中从起始索引":["52.13"],"默认为":["52.13"],"静态方法从可迭代或类数组对象创建一个新的浅拷贝的数组实例":["52.15"],"方法通过可变数量的参数创建一个新的":["52.16"],"实例":["52.16"],"而不考虑参数的数量或类型":["52.16"],"join":["52.17"],"方法用于将数组中的元素连接成字符串":["52.17"],"pop":["52.18"],"方法用于删除数组中的最后一个元素":["52.18"],"方法用于添加一个或多个元素到数组的末尾":["52.19"],"方法从数组中删除第一个元素":["52.20"],"并返回该元素的值":["52.20"],"unshift":["52.21"],"方法将一个或多个元素添加到数组的开头":["52.21"],"方法返回一个包含数组中每个索引键的":["52.22"],"方法返回一个新的":["52.23"],"返回一个新的数组迭代器对象":["52.24"],"reduceright":["52.26"],"方法接受一个函数作为累加器":["52.26"],"reverse":["52.27"],"方法将数组中元素的位置颠倒":["52.27"],"slice":["52.28"],"方法返回一个新的数组对象":["52.28"],"sort":["52.29"],"方法用原地算法对数组的元素进行排序":["52.29"],"并返回数组":["52.29"],"splice":["52.30","62.7"],"tolocalestring":["52.31"],"返回一个字符串表示数组中的元素":["52.31"],"方法返回一个字符串":["52.32"],"flatten2":["53.5"],"eachflatten":["53.6"],"deep":["53.6"],"reduceflat":["53.7"],"arr2":["54.4"],"flowing":["55.1"],"createapp":["55.2","56.2","59.2"],"disabled":["55.4","56.7","57.2"],"给按钮添加禁用功能":["55.4"],"按钮":["56.0"],"普通按钮":["56.1"],"l":["56.1"],"button":["56.1"],"默认":["56.1"],"primary":["56.1"],"info":["56.1"],"可以选择想要的类型":["56.4"],"给按钮添加":["56.5","56.6","56.7","56.8"],"plain":["56.5"],"round":["56.6"],"icon":["56.8"],"选择自己喜欢的":["56.8"],"linput":["57.1","57.3","57.4","57.5","57.6","57.7"],"medium":["57.3","57.5","57.6"],"small":["57.3"],"mini":["57.3"],"不传则默认":["57.3"],"当输入框有值时可一键清空":["57.4"],"upfile":["57.7","61.2"],"设置":["57.8"],"autosize":["57.8"],"minrows":["57.8"],"npm":["58.0"],"licon":["59.1","59.7","59.8","59.9","59.10","59.11","59.12","59.13","59.14","59.15","59.16"],"apple":["59.1"],"line":["59.1"],"apps":["59.1","59.9"],"我们可以设置dot属性后":["59.4"],"我们可以设置color属性更改你想要的颜色":["59.5"],"dianzan":["59.10"],"xiala2":["59.12"],"bianji":["59.15"],"shezhi":["59.16"],"underline属性添加下划线":["60.1"],"disabled属性禁用":["60.2"],"multiple可以上传多个文件":["61.1"],"accept设置只允许上传文件类型":["61.1"],"lupload":["61.1"],"multiple":["61.1"],"添加drag属性":["61.2"],"宏任务的定时器谁先到时间谁先执行":["62.1"],"table":["62.2"],"row":["62.2"],"table标签":["62.2"],"类似于":["62.2"],"别再错了指向的是obj的上下文":["62.4"],"指不到里面的":["62.4"],"输入类型":["62.5"],"promise的catch只会执行第一个":["62.9"],"和then不同不会传递到最后":["62.9"],"b":["62.10"],"c":["62.10"],"情况一转为字符串后相当于重复赋值":["62.11"],"object对象转换为字符串和判断数据类型都是直接调用":["62.12"],"let块级作用域输出0":["62.13"],"若过渡起始值或过渡开始值为auto":["62.14"],"top属性规定内部元素的顶部边缘":["62.16"],"flex方法时":["62.18"],"箭头函数后面有":["63.1"],"就需要return来返回里面的数据":["63.1"],"不写return会undefined":["63.1"],"箭头函数后面没有":["63.1"],"不需要return":["63.1"],"构造函数里的箭头函数方法挂载在对象自身里":["63.2"],"普通函数放在原型上":["63.2"],"你可上点心吧":["64.0"],"通过vitepress和github":["66.0"],"从这里开始你的":["67.0"]},{"0":["0.6","1.13","12.22","12.26","45.1","46.7","49.4","49.8","50.2","51.2","62.13"],"1":["0.4","1.20","1.31","2.1","3.6","3.9","6.9","6.10","8.1","9.26","10.1","11.3","11.26","11.49","11.72","14.5","14.6","19.16","26.2","27.8","27.35","27.39","28.9","28.17","28.18","33.1","33.2","39.0","47.0","52.12","53.4","53.6","53.7","63.1"],"2":["0.8","3.5","5.8","5.9","6.14","6.19","9.9","9.17","10.2","11.3","11.12","11.14","11.42","11.68","11.72","11.75","13.0","13.2","13.5","14.6","15.3","16.3","17.1","19.2","21.4","21.8","23.3","23.4","26.6","26.11","27.1","27.10","27.22","27.31","27.32","27.42","28.9","28.11","28.14","28.26","28.27","34.5","36.2","36.3","36.10","36.14","48.15","53.4","54.4","59.8","62.2","62.17","63.1"],"3":["2.10","4.0","5.18","6.13","11.72","14.6","16.3","21.4","25.32","28.14","34.6","53.4","54.4"],"4":["2.10","4.0","8.2","25.10","25.32","26.8"],"5":["14.1","26.8","57.8"],"6":["9.15","53.4"],"7":["9.15"],"10":["5.14"],"16":["52.29"],"22":["13.3"],"42":["12.26"],"123":["11.33"],"127":["0.6"],"200":["0.2"],"205":["9.15"],"206":["9.15"],"300":["9.15"],"301":["9.15"],"1000":["13.8"],"2000":["13.8"],"3000":["13.8"],"8888":["0.6"],"a":["0.1","6.5","11.72","12.18","12.26","25.4","25.7","25.32","28.9"],"send":["0.2"],"设置响应体类型":["0.2"],"responsetype":["0.2"],"json":["0.2","38.5"],"因为是异步请求":["0.2"],"所以要在加载完成后读数据":["0.2"],"onload":["0.2"],"if":["0.2","9.11","25.3","28.4","28.21","30.0","39.0","41.0","42.0","46.2","46.4","48.5","49.4","49.5","49.7","49.8","53.7"],"status":["0.2"],"json转文本":["0.2"],"goodslist":["0.2"],"js":["0.3","0.6","5.7","5.15","11.21","11.25","11.44","11.61","11.71","12.3","12.4","12.7","12.10","12.13","12.14","12.16","12.18","12.20","12.25","13.10","14.2","14.4","14.9","18.0","20.4","20.5","22.3","23.1","23.4","23.6","25.8","27.24","27.30","27.33","28.7","28.28","44.2","45.2","45.4","48.12","48.15","52.1","52.2","52.3","52.7","52.10","52.11","52.15","52.18","52.19","52.21","52.22","52.23","52.24","52.26","52.29","52.30","52.32","53.1","54.0","56.4","56.5","56.6","56.7","59.5","62.4","62.9","62.13","63.1","63.2"],"字符串转对象":["0.3"],"不常用copy":["0.4"],"head":["0.4","1.16","5.20","49.9"],"link等等":["0.4"],"原因":["0.5"],"http":["0.5","0.6","9.5"],"通过定义函数名去接收后台返回数据":["0.6"],"var":["0.6","11.61","11.71","12.7","12.18","18.0","21.4","45.1","49.2"],"script":["0.6","8.2"],"document":["0.6"],"createelement":["0.6"],"并带一个callback回调函数名称":["0.6"],"src":["0.6","27.33"],"index":["0.6","36.0","36.10","46.3"],"canceltoken":["0.7","33.6"],"可以提供更好的用户体验":["0.8"],"token刷新":["0.8"],"如果你的应用使用了token进行身份验证":["0.8"],"你可以在响应拦截器中":["0.8"],"检查响应的状态码":["0.8"],"并根据特定的状态码来刷新token":["0.8"],"这样可以确保token始终处于有效状态":["0.8"],"并且在过期时自动刷新":["0.8"],"请求拦截":["0.8"],"添加":["0.8","2.6"],"请求头":["0.8","9.31"],"你可以在请求拦截器中设置请求头":["0.8"],"例如添加身份验证的":["0.8"],"token添加到请求头":["0.8"],"设置请求的内容类型等":["0.8"],"这样可以确保每个请求都携带所需的头部信息":["0.8"],"请求参数处理":["0.8"],"你可以在请求拦截器中对":["0.8"],"请求的参数进行处理":["0.8"],"例如添加通用的参数":["0.8"],"flex":["1.1","1.18"],"justify":["1.1"],"content":["1.1","1.27","2.3","5.2"],"center":["1.1","1.26","1.27"],"align":["1.1"],"items":["1.1","14.4"],"style":["1.2","8.2"],"clear":["1.2","14.3"],"both":["1.2"],"bfc":["1.3"],"块级格式化上下文":["1.3"],"属于普通流":["1.3"],"felx是哪些属性的缩写":["1.5"],"对应的属性代表什么含义":["1.5"],"隐藏元素的属性有哪些":["1.10"],"会触发回流重绘性能消耗较大":["1.11"],"非继承属性":["1.11"],"子孙节点消失由于元素从渲染树消失造成":["1.11"],"通过修改子孙节点属性无法显示":["1.11"],"visibility":["1.11"],"hidden":["1.11"],"left":["1.12","36.10","48.16"],"top":["1.12","1.20"],"利用绝对定位":["1.12"],"scale":["1.13"],"skew":["1.13"],"px":["1.14"],"和":["1.14","1.22","4.0","25.11","36.10","52.16","52.28"],"vh":["1.15"],"是什么":["1.15"],"实现不同屏幕尺寸下的自适应布局":["1.16"],"在html的":["1.16"],"标签中设置基准字体大小":["1.16"],"flexible":["1.17"],"box":["1.17","2.8"],"的缩写":["1.17"],"意为":["1.17"],"弹性布局":["1.17"],"指定容器display":["1.17"],"那就是":["1.18"],"css":["1.19","1.23","2.7","5.6","5.19"],"或":["1.19","5.13","27.49"],"属于合成属性":["1.20"],"composite":["1.20"],"中的":["1.21"],"值是":["1.21"],"css3":["1.21","2.1"],"新增的":["1.21"],"space":["1.22","1.27"],"between":["1.22"],"过渡动画":["1.23"],"property":["1.23","28.17"],"指定过渡的":["1.23"],"属性":["1.23","11.3","12.3"],"属性使用裁剪方式创建元素的可显示区域":["1.24"],"其宽度默认为父元素的100":["1.25"],"块级元素可以设置宽度":["1.25"],"高度":["1.25"],"居中":["1.26"],"p":["1.26","25.32","28.17"],"date":["1.26","11.3"],"name":["1.28","5.21","11.27","13.3","25.20","25.23","44.3","44.4","44.5","59.11"],"duration":["1.28"],"即html元素":["1.29"],"id选择器的权重为100":["1.30","36.16"],"type":["1.31","5.2","8.2","25.26","25.32","56.4"],"checkbox":["1.31"],"checked":["1.31"],"background":["1.31"],"color":["1.31","59.7"],"yellow":["1.31"],"常见伪类选择器":["1.31"],"链接伪类选择器":["1.31"],"而无需修改html结构":["1.32"],"这些内容可以用于添加装饰":["1.32"],"如何用":["2.0"],"利用":["2.1","5.17"],"添加空div法":["2.2"],"在浮动元素下方添加空div":["2.2"],"并给该元素写css样式":["2.2"],"填充":["2.3"],"padding":["2.3"],"边框":["2.3"],"border":["2.3","2.8","62.2"],"w3c盒模型":["2.4"],"标准盒模型":["2.4"],"sizing属性来指定盒模型的类型":["2.5"],"重绘":["2.6"],"删除":["2.6"],"尽量不用图片":["2.7"],"因为这类修饰图片完全可以用":["2.7"],"去代替":["2.7"],"radius":["2.8"],"shadow":["2.8"],"image":["2.8","61.1","61.2"],"分辨率":["2.9"],"方向等条件来为不同的设备或浏览器设置不同的css样式":["2.9"],"通过媒体查询":["2.9"],"圣杯布局":["2.10"],"核心思想":["2.10"],"利用浮动":["2.10"],"外边距负值和相对定位来实现":["2.10"],"父级元素设置左右的padding":["2.10"],"三列均设置向左浮动":["2.10"],"中间一列放在最前面":["2.10"],"宽度设置为父级元素的宽度":["2.10"],"因此后面两列都被挤到了下一行":["2.10"],"再通过设置margin负值将其移动到上一行":["2.10"],"什么是es6模块化":["3.1"],"每个":["3.2","26.7"],"默认导出与默认导入":["3.3"],"每个模块中":["3.4"],"每个模块中可以使用多次按需导出":["3.5"],"var允许重复声明":["3.6"],"let":["3.6","4.0","14.5","14.6","25.7","25.21","28.15","28.28","28.29","33.7","38.1","38.4","40.0","44.1","44.2","44.4","45.3","45.4","45.5","46.1","46.3","48.5","48.10","48.12","49.6","49.9","51.2","52.1","52.2","52.3","52.10","52.15","52.17","52.19","52.21","52.22","52.24","52.32","53.0","53.5","54.0"],"const不允许":["3.6"],"函数作用域":["3.7"],"块状作用域":["3.7"],"动态作用域":["3.7"],"对象":["3.7","5.25","15.2","52.22","52.23"],"新增的解构赋值":["3.8"],"解构赋值针对数组或者对象进行模式匹配":["3.8"],"箭头函数和普通函数的区别":["3.9"],"js新增简单数据类型symbol":["3.10"],"新增了class关键字":["3.11"],"与node":["3.12"],"js的commonjs不同":["3.12"],"es6新增esmoudule":["3.12"],"新增promise":["3.13"],"es6":["3.14","20.3","24.0"],"中引入的一种特殊函数":["3.14"],"它可以被暂停和恢复":["3.14"],"场景":["3.14"],"里面的参数a又是怎么回事呢":["4.0"],"字符串a表示一种修饰":["4.0"],"对你当前创建的symbol类型的一种修饰":["4.0"],"作为区分使用":["4.0"],"与其他数据类型之间的转换":["4.0"],"symbol不能用四则运算进行操作":["4.0"],"否则报错":["4.0"],"它只能用显示的方式转为字符串和布尔值":["4.0"],"string":["4.0","11.33","25.6","25.8","25.17","25.19","25.20","25.23"],"boolean":["4.0","12.14"],"作为对象的属性":["4.0"],"msmymbol":["4.0"],"第一种写法":["4.0"],"html":["5.1","5.20"],"文件字节流是无法直接被渲染引擎理解的":["5.1"],"所以要将其转化":["5.1"],"会根据请求头中的":["5.2"],"type字段来判断文件的类型":["5.2"],"比如":["5.2"],"的值是":["5.2"],"text":["5.2","29.0","62.15"],"那么浏览器就会判断这是一个":["5.2"],"类型的文件":["5.2"],"然后为该请求选择或者创建一个渲染进程":["5.2"],"渲染进程准备好之后":["5.2"],"网络进程和渲染进程之间会建立一个共享数据的管道":["5.2"],"网络进程接收到数据后就往这个管道里面放":["5.2"],"而渲染进程则从管道的另外一端不断地读取数据":["5.2"],"css不会阻塞dom树的解析":["5.3"],"但是会影响":["5.3"],"标签时":["5.4"],"暂停整个":["5.4"],"dom":["5.4","5.10","5.11","27.41"],"脚本设置为异步加载":["5.5"],"因为":["5.6"],"有可能会修改当前状态下的":["5.6"],"不过在执行":["5.6"],"脚本之前":["5.6"],"如果页面中包含了外部":["5.6"],"当页面引用的所有":["5.7"],"同步代码执行完毕":["5.7"],"解析html结构":["5.8"],"设置defer和acync时js和html异步加载":["5.9","6.9"],"html转换为dom":["5.9"],"原生":["5.13"],"jq":["5.13"],"如前":["5.14"],"若一次操作中有":["5.14"],"次更新":["5.14"],"的动作":["5.14"],"用":["5.15"],"树":["5.17"],"element":["5.18","51.1"],"表示一个元素节点":["5.18"],"提供了操作和访问元素的方法和属性":["5.18"],"node":["5.18","48.5","48.10","48.11","49.2","49.4"],"queryselector":["5.19"],"selector":["5.19"],"根据":["5.19"],"选择器选择匹配的第一个元素节点":["5.19"],"通常是":["5.20"],"获取指定属性名对应的属性值":["5.21"],"可以用于添加":["5.22"],"删除和切换类名":["5.22"],"id":["5.22"],"获取或设置元素的唯一标识符":["5.22"],"tagname":["5.22"],"获取元素的标签名":["5.22"],"以大写形式表示":["5.22"],"innerhtml":["5.22"],"获取或设置元素的html内容":["5.22"],"对象是浏览器中的顶级对象":["5.23"],"显示一个带有消息":["5.24"],"确定和取消按钮的对话框":["5.24"],"并返回用户的选择结果":["5.24"],"prompt":["5.24"],"用于访问和操作文档的内容":["5.25"],"location":["5.25"],"获取或设置当前窗口的":["5.25"],"是":["5.26","9.12"],"javascript":["5.26","12.1","20.1"],"keydown":["5.27"],"等":["5.27","27.20"],"target":["5.27","12.3","28.17","28.19","28.21","28.29","28.32","41.0"],"触发事件的元素":["5.27"],"stoppropagation":["5.28"],"停止事件的传播":["5.28"],"doctype":["6.1"],"有何作用":["6.1"],"的区别":["6.2"],"b":["6.2","11.28","11.72","25.1","25.4","25.32","28.9"],"strong":["6.2"],"form":["6.3"],"ul":["6.3"],"li":["6.3"],"ol":["6.3"],"table":["6.3"],"h1":["6.3"],"h2":["6.3"],"它为鼠标用户改进了可用性":["6.4"],"当我们在label元素内点击文本时就会触发此控件":["6.4"],"也就是说":["6.4","15.1","20.3"],"当用户选择该标签时":["6.4"],"浏览器就会自动将焦点转到和标签相关的表单控件上":["6.4"],"href属性中的url可以是浏览器支持的任何协议":["6.5"],"所以a标签可以用来手机拨号":["6.5"],"你知道seo中的tdk吗":["6.6"],"主要有两种方式":["6.7"],"实现标签被识别":["6.7"],"通过document":["6.7"],"存储":["6.8","21.0"],"多任务等功能的增加":["6.8"],"语义化标签":["6.8"],"如":["6.8","9.11"],"article":["6.8"],"加载js然后html和css":["6.9"],"从根元素开始检查哪些元素可见":["6.10"],"以及样式":["6.10"],"重排":["6.11"],"回流":["6.11"],"不可避免":["6.12"],"documentfragment":["6.13"],"提升为合成层":["6.13"],"合成层的位图":["6.13"],"会交由":["6.13"],"合成就是将页面的各个部分分成多个层":["6.14"],"最后把它们合成为一个页面的技术":["6.14"],"合成层拥有单独的图层":["6.14"],"filter":["6.15","36.0"],"will":["6.15"],"change等":["6.15"],"浏览器会自动将这些元素创建为单独的合成层":["6.15"],"设置":["6.15"],"可能简单的重叠就会产生大量的合成层":["6.16"],"这样会占用很多无辜的":["6.16"],"cpu":["6.16"],"虽然有浏览器的层压缩机制":["6.17"],"但是也有很多无法进行压缩的情况":["6.17"],"语义元素可以清楚地向浏览器和开发者描述其意义":["6.18"],"即元素本身传达了关于标签所包含内容类型的一些信息":["6.18"],"例如":["6.18","12.22","12.30","26.13","56.5","56.6","56.7","59.5"],"也能够":["6.19"],"呈现出很好的内容结构":["6.19"],"可以在页面中嵌入另一个html文档或者网页":["6.20"],"iframe元素可以用来在当前页面中显示来自其他网站或者服务器的内容":["6.20"],"也可以用来实现一些特殊的功能":["6.20"],"如打印预览":["6.20"],"search":["7.1","48.1","48.3"],"engine":["7.1"],"标题":["7.2"],"如果主体比较多":["7.3"],"简单理解就是关键词在所有文字内容中出现的比例":["7.4"],"给用户看的":["7.5"],"这个属性表明了这张图的内容":["7.5"],"其实搜索引擎在分析页面的时候":["7.5"],"也会根据这个词去判断图片的内容":["7.5"],"所以要给页面上有意义的图片都加上alt属性":["7.5"],"表现和行为":["8.1"],"javascript定义":["8.2"],"css定义":["8.2"],"搜索引擎优化":["8.3"],"很有帮助":["8.3"],"http是一个客户端终端":["9.1"],"用户":["9.1"],"和服务器端":["9.1"],"网站":["9.1"],"请求和应答的标准":["9.1"],"客户向服务器请求服务时":["9.2"],"只需要传送请求方法和路径":["9.2"],"由于http协议简单":["9.2"],"使得通信速度比较快":["9.2"],"transmission":["9.3"],"control":["9.3","19.12"],"protocol":["9.3","9.28","9.30"],"sockets":["9.4"],"layer":["9.4"],"协议对http协议传输的数据进行加密":["9.4"],"ssl":["9.4"],"依靠证书来验证服务器的身份":["9.4"],"并为浏览器和服务器之间的通信加密":["9.4"],"0的区别":["9.5"],"主机名":["9.6"],"显示":["9.8"],"请求":["9.8","9.15"],"使用":["9.8","10.7"],"方法应该只用在读取数据上":["9.8"],"而不应该用于产生":["9.8"],"副作用":["9.8"],"的操作中":["9.8"],"传递参数数量有限":["9.9"],"post":["9.9","9.12"],"一般用于提交数据":["9.9"],"参数不可见":["9.9"],"更新服务器上的文件或数据库":["9.10"],"get能请求缓存":["9.10"],"agent":["9.11","9.15"],"用户标识":["9.11"],"os":["9.11"],"和浏览器的类型和版本":["9.11"],"modified":["9.11"],"since":["9.11"],"值为上一次服务器返回的last":["9.11"],"modified值":["9.11"],"用于确定某个资源是否被更改过":["9.11"],"没有更改过就从缓存中读取":["9.11"],"none":["9.11"],"响应状态行":["9.13"],"1xx":["9.14"],"提示信息":["9.14"],"表示请求已接收":["9.14"],"但没有返回任何内容":["9.15"],"重置内容":["9.15"],"部分内容":["9.15"],"服务器成功处理了部分":["9.15"],"get":["9.15","27.14","28.17","28.19","28.32","41.0"],"3xx":["9.15"],"重定向":["9.15"],"多种选择":["9.15"],"针对请求":["9.15"],"服务器可执行多种操作":["9.15"],"服务器可根据请求者":["9.15"],"user":["9.15"],"选择一项操作":["9.15"],"或提供操作列表供请求者选择":["9.15"],"永久移动":["9.15"],"解析":["9.17"],"dns":["9.17"],"地址解析":["9.18"],"首先判断你输入的是一个合法的":["9.18"],"浏览器缓存":["9.19"],"浏览器会先检查是否在缓存中":["9.19"],"没有则调用系统库函数进行查询":["9.19"],"分为四层":["9.20"],"在发送数据时":["9.20"],"每层都要对数据进行封装":["9.20"],"将数据返回至浏览器":["9.21"],"如果响应可以缓存":["9.22"],"而断开连接是四次挥手":["9.24"],"其实就是指建立一个tcp连接时":["9.25"],"需要客户端和服务器总共发送3个包":["9.25"],"进行三次握手的主要作用就是为了确认双方的接收能力和发送能力是否正常":["9.25"],"指定自己的初始化序列号为后面的可靠性传送做准备":["9.25"],"刚开始客户端处于":["9.25"],"客户端或服务器均可主动发起挥手动作":["9.26"],"第一次挥手":["9.26"],"客户端发送一个":["9.26"],"fin":["9.26"],"报文":["9.26"],"internet":["9.28"],"它们在数据传输方式":["9.29"],"可靠性":["9.29"],"连接性等方面存在一些区别":["9.29"],"连接性":["9.29"],"是面向":["9.29"],"连接":["9.29"],"的协议":["9.29"],"通过三次握手建立可靠的连接":["9.29"],"确保数据的可靠传输":["9.29"],"transfer":["9.30"],"是一种无状态的协议":["9.30"],"设置并发送给客户端":["9.31"],"浏览器会在后续的请求中将":["9.31"],"自动包含在":["9.31"],"中发送给服务器":["9.31"],"主要用于在客户端存储有":["9.31"],"关用户的一些状态信息或标识符":["9.31"],"以便服务器在后续请求中进行识别和处理":["9.31"],"进程":["9.32"],"应用程序中的安全漏洞":["10.1"],"允许攻击者在受害者的浏览器中注入恶意脚本":["10.1"],"从而实现对用户信息的窃取":["10.1"],"篡改或欺骗等攻击":["10.1"],"攻击通常可以分为三种类型":["10.1"],"反射型":["10.1"],"攻击":["10.1"],"攻击通常发生在搜索引擎等":["10.1"],"应用程序中":["10.1"],"web应用程序必须对用户进行身份认证和授权":["10.2"],"以确保只有授权的用户才能访问敏感信息和功能":["10.2"],"输入验证和过滤":["10.2"],"web应用程序必须对用户输入进行验证和过滤":["10.2"],"以确保输入数据符合预期格式和范围":["10.2"],"并且不包含恶意代码或攻击负载":["10.2"],"输入验证和过滤可以有效地防止sql注入":["10.2"],"request":["10.3"],"forgery":["10.3"],"和xss":["10.3"],"验证来源":["10.4"],"启用":["10.4"],"samesite":["10.4"],"进行输入验证和过滤":["10.5"],"确保只接受符合预期格式的数据":["10.5"],"输出转义":["10.5"],"在将用户输入的数据输出到网页时":["10.5"],"secure":["10.6"],"使用一对密钥":["10.8"],"js的基础类型":["11.1"],"基础类型有":["11.1"],"typeof和instanceof的区别":["11.2"],"arr":["11.3","11.58","11.71","11.72","45.2","45.3","45.4","45.5","52.1","52.2","52.3","52.17","53.2","54.1","54.2","54.3"],"obj":["11.3","11.72","12.7","12.13","12.18","12.24","14.10","28.4","28.9","28.15","38.5"],"nul":["11.3"],"不能准确判断":["11.3"],"reg":["11.3"],"error":["11.3","13.5"],"constructor":["11.3"],"返回实例对象的构造函数":["11.3"],"构造函数的原型对象上会有一个":["11.3"],"指向了构造函数自身":["11.3"],"所以实例对象通过原型链访问":["11.3"],"就能找到自己的构造函数":["11.3"],"也就是自己的类型了":["11.3"],"instanceof":["11.3"],"沿着原型链去找":["11.3"],"它的作用是检测实例对象是不是属于某个构造函数":["11.3"],"可以用来做数据类型的检测":["11.3"],"缺点":["11.3"],"不能检测基本数据类型":["11.3"],"原型链可能被修改":["11.3"],"导致检测结果不准确":["11.3"],"只要能在原型链上找到构造函数":["11.3"],"就返回":["11.3"],"所以类型可能不准确":["11.3"],"没有":["11.4","62.5"],"defer":["11.4"],"即使放在head里面":["11.6"],"defer是html4的async是html5新增的":["11.7"],"因为立即执行":["11.8"],"类中的方法的this不是固定的":["11.9"],"即一个宏任务":["11.11"],"所有微任务":["11.11"],"渲染":["11.11"],"一个宏任务":["11.11"],"异步任务":["11.12"],"不进入主线程":["11.12"],"而进入任务队列的任务":["11.12"],"执行宏任务期间产生的所有微任务":["11.13"],"组成":["11.13"],"而是在指定时间后":["11.14"],"将回调函数放入事件循环的队列中":["11.14"],"promise":["11.15","13.7","13.9","40.0","62.9"],"tick队列":["11.16"],"从堆内存中开辟一个新的区域存放新对象":["11.18"],"拷贝的就是基本类型的值":["11.19"],"如果属性是引用类型":["11.19"],"会影响":["11.20"],"原对象":["11.20"],"闭包使得函数可以保留对其定义时作用域内的变量和参数的引用":["11.21"],"即使外部函数已经执行完毕":["11.21"],"这些变量和参数仍然可以被内部函数访问":["11.21"],"function":["11.21","11.50","11.51","12.4","12.13","12.14","13.10","14.9","14.10","25.4","25.8","25.29","28.21","34.3","44.6","45.2","45.3","45.4","46.5","48.7","48.8","48.10","48.12","49.2","49.3","49.5","49.6","49.7","49.10","53.2","53.6","62.1"],"square":["11.21"],"num":["11.21","46.5"],"意外的全局变量":["11.22"],"分配内存":["11.23"],"开始":["11.24"],"顺着引用表能找到的都不是内存垃圾":["11.24"],"引擎会创建执行上下文":["11.25"],"除了判断nan为true":["11.26"],"this":["11.27","12.31","15.1","25.13","25.17","46.2","46.3","46.4","48.5","48.7","48.8","48.9","48.10","48.11","49.4","49.8","49.9"],"方法用于返回":["11.29"],"指定对象的原始值":["11.29"],"若对象没有原始值":["11.29"],"则将返回对象本身":["11.29"],"基本数据类型":["11.30"],"number":["11.33","12.30","25.2","25.4","25.6","25.19","25.20","47.1"],"objstr":["11.33"],"转布尔值都是false":["11.34"],"null":["11.34","12.12","16.2","25.11","25.14","49.9"],"undefined":["11.34","11.38","25.11"],"是object":["11.35"],"在比较过程中会存在隐式转换":["11.36"],"转成string类型":["11.37"],"字符串连接符":["11.37"],"为":["11.38","28.20"],"true":["11.38","12.19"],"为什么是":["11.39","11.40"],"false":["11.39","12.4","16.2","48.16","49.11","49.12"],"优先级高于":["11.41"],"不是假值":["11.41"],"所以先转换成":["11.41"],"就是没有函数名的函数":["11.43"],"xxx":["11.44","28.26"],"需不需要阻止冒泡":["11.45"],"归类于变量声明":["11.46"],"享受变量提升":["11.46"],"函数提升优先级":["11.46"],"由最具体的元素接收":["11.47"],"fetch有啥区别":["11.48"],"domcontentloaded的区别":["11.49"],"dom文档加载的步骤为":["11.49"],"stopbubble":["11.50"],"stopdefault":["11.51"],"可以把事件绑定在父元素上":["11.52"],"const":["11.53","11.72","12.3","12.4","12.10","12.16","12.20","14.4","15.3","27.28","27.32","27.33","27.49","28.8","28.9","28.21","28.32","47.1","62.4"],"newarr":["11.53","33.7"],"创建一个空数组存储去重后的元素":["11.53"],"reduce":["11.53","52.25","54.3"],"pre":["11.53"],"next":["11.53","11.73"],"nan不等于自身":["11.54"],"也就是":["11.54"],"关键字用于在子类中访问和调用父类的构造函数":["11.56"],"返回数组长度":["11.57"],"pop":["11.57","47.0","52.20"],"删除数组最后一项":["11.57"],"返回被删除项":["11.57"],"shift":["11.57"],"删除数组第一项":["11.57"],"并返回被删除项":["11.57"],"unshift":["11.57"],"取arr中的最大值":["11.58"],"min":["11.58"],"分别是":["11.59"],"方法用于将js日期转换为iso标准":["11.60"],"它使用iso标准将js":["11.60"],"date对象转换为字符串":["11.60"],"不会编码类似这样字符":["11.61"],"如果需要编码这些字符":["11.61"],"请使用encodeuricomponent":["11.61"],"用法":["11.61"],"作用":["11.62"],"代表方法或属性":["11.62"],"window":["11.62","15.2"],"history":["11.62","26.5"],"操纵浏览器的记录":["11.62"],"back":["11.62"],"model":["11.63","57.5","57.7"],"即浏览器对象模型":["11.63"],"主要处理浏览器窗口和框架":["11.63"],"没有统一遵循的标准":["11.63"],"dom全称document":["11.63"],"函数有什么区别":["11.64"],"startindex":["11.65","11.66"],"length":["11.65","33.7","45.5","47.0","49.8","50.1","50.2","52.13"],"endindex":["11.66"],"strict":["11.67"],"标签规定了用户可以在其中输入数据的输入字段":["11.68"],"它是一个类数组对象":["11.70"],"可以通过数字索引获取其中的参数":["11.70"],"对象可以在函数内部访问":["11.70"],"c":["11.72","25.32"],"对象必须实现":["11.73"],"symbol":["11.73","12.6"],"iterator":["11.73","52.22","52.23"],"方法":["11.73","27.20","28.22","62.12"],"该方法返回一个迭代器对象":["11.73"],"迭代器对象必须包含一个":["11.73"],"作为即将创建的对象实例":["11.74"],"将空对象绑定到构造函数的原型链上":["11.74"],"currenttarget":["11.75"],"表示事件的当前目标元素":["11.75"],"即当前":["11.75"],"正在处理事件的元素":["11.75"],"方法将所有可枚举":["12.3"],"从一个或多个源对象复制到目标对象":["12.3"],"返回修改后的对象":["12.3"],"传入的对象":["12.4"],"person":["12.4","25.20","44.5"],"ishuman":["12.4"],"printintroduction":["12.4"],"console":["12.4","12.26","13.3","13.5","13.8","13.9","25.21","27.32","28.17","62.1","62.10"],"要定义属性的对象":["12.6"],"要定义或修改的属性的名称或":["12.6"],"其排列与使用":["12.8"],"for":["12.8","38.4","45.1","45.2","45.3","51.2","53.5","62.13"],"in":["12.8","25.32"],"循环遍历该对象时返回的顺序一致":["12.8"],"区别在于":["12.8"],"方法可以冻结一个对象":["12.9"],"方法把键值对列表转换为一个对象":["12.10"],"entries":["12.10"],"返回值":["12.12","12.14"],"给定对象的原型":["12.12"],"如果没有继承属性":["12.12"],"则返回":["12.12"],"要设置其原型的对象":["12.13"],"该对象的新原型":["12.13"],"一个对象或":["12.13"],"human":["12.13"],"在该对象的原型链上搜寻":["12.14"],"表示调用对象是否在另一个对象的原型链上":["12.14"],"foo":["12.14"],"bar":["12.14","12.26"],"afunction":["12.15"],"中":["12.15"],"的原型链是针对":["12.15"],"自有属性指的是直接赋予该对象的属性":["12.16"],"不需要从原型链上进行查找的属性":["12.16"],"返回":["12.19","52.6"],"如果属性是继承的或者不存在":["12.19"],"该方法返回":["12.19"],"属性值为null或undefind时也会返回true":["12.20"],"有值就会返回true":["12.20"],"object1":["12.20"],"property1":["12.20"],"返回一个布尔值":["12.21"],"value1":["12.21"],"value2":["12.21"],"不会强制转换两边的值":["12.22"],"也不相同":["12.22"],"差别是它们对待有符号的零和":["12.22"],"nan":["12.22"],"运算符":["12.22"],"也包括":["12.22"],"将数字":["12.22"],"视为相等":["12.22"],"而将":["12.22"],"方法会返回一个由一个给定对象的自身可枚举属性组成的数组":["12.25"],"数组中属性名的排列顺序和正常循环遍历该对象时返回的顺序一致":["12.25"],"baz":["12.26"],"log":["12.26","13.3","13.5","13.8","25.21","27.32","28.17","62.1","62.10"],"array":["12.26","25.1","38.4"],"like":["12.26"],"propertyisenumerable":["12.28"],"不接受任何参数":["12.30"],"然而":["12.30"],"继承自":["12.30"],"的对象可能用它们自己的实现重写它":["12.30"],"这些实现可以接受参数":["12.30"],"方法将":["12.31"],"值转换为一个对象":["12.31"],"此方法旨在用于自定义类型转换的逻辑时":["12.31"],"当我们new一个promise":["13.0"],"此时我们需要传递一个回调函数":["13.0"],"方法可以捕获到":["13.1"],"之前整条":["13.1"],"链路上所有抛出的异常":["13.1"],"二":["13.1"],"pending":["13.2"],"待定":["13.2"],"执行了executor":["13.2"],"状态还在等待中":["13.2"],"没有被兑现":["13.2"],"也没有被拒绝":["13.2"],"reject":["13.3","13.6","39.0","40.0"],"ice":["13.3"],"age":["13.3","19.12","25.19","25.20","25.23","44.3","44.4","44.5"],"then":["13.3","13.5","13.8"],"res":["13.3","13.5","13.8","13.9"],"存放在promise":["13.4"],"prototype上的方法":["13.4"],"也就是promise的原型对象上":["13.4"],"rej":["13.5"],"new":["13.6","13.7","13.9","14.4","14.5","14.6","15.3","18.0","28.9","28.17","28.19","28.21","28.28","40.0","40.1","47.1","48.5","49.2","49.4","51.2"],"resolve":["13.6","26.7","40.0"],"hi":["13.8"],"promise2":["13.8"],"panda":["13.8"],"promise3":["13.8"],"grizzly":["13.8"],"all方法的参数传入为一个可迭代对象":["13.8"],"返回一个promise":["13.8"],"只有":["13.8"],"三个都为resolve状态的时候才会调用":["13.8"],"then方法":["13.8"],"return":["13.9","25.3","28.4","28.17","28.19","30.0","33.7","36.0","38.5","39.0","40.1","41.0","42.0","47.0","48.7","48.8","48.9","48.11","48.16","49.11","49.12","53.2"],"会被放进微任务队列":["13.10"],"async":["13.10"],"fn2":["13.10"],"所以5和":["14.1"],"是两个不同的值":["14.1"],"内部判断两个值是否不同":["14.1"],"使用的算法叫做":["14.1"],"same":["14.1"],"size":["14.2","46.1","46.7","50.1","50.2","57.3","57.4"],"元素数量":["14.2"],"判断集合中是否存在":["14.3"],"清空集合":["14.3"],"keys":["14.3","25.32","28.4"],"set":["14.5","14.8","41.0"],"set1":["14.6"],"set2":["14.6"],"共同点":["14.7"],"可以储存不重复的值":["14.7"],"不同点":["14.7"],"返回字典中所包含的元素个数":["14.8"],"key":["14.8","28.4","28.8","28.9","28.15","28.21","28.29","41.0","46.3","48.12"],"value":["14.8","28.8","30.0","42.0"],"map2obj":["14.9"],"obj2map":["14.10"],"指向的是一个空对象":["15.1"],"如果在":["15.1"],"在全局作用域中调用":["15.2"],"时":["15.2"],"它的值指向全局对象":["15.2"],"即在浏览器中指向":["15.2"],"this指向当前person实例对象":["15.3"],"ljt":["15.3"],"指向window":["15.3"],"fn":["15.3","38.1","38.2"],"检查其两个操作数是否相等":["16.1"],"转换为布尔值":["16.2"],"括号":["16.3"],"成员访问":["16.3"],"参数是数组的长度":["17.1"],"值为0":["17.1"],"遍历":["17.1"],"map":["17.1","23.9","52.12"],"将数组中的元素映射到另一个数组返回一个新数组":["17.1"],"foreach":["17.1","28.4","28.9","33.7","39.0"],"将元素依次执行操作":["17.1"],"不产生新数组":["17.1"],"不影响原数组":["17.1"],"flatmap":["17.1"],"words":["17.4"],"apple":["17.4","59.7"],"banana":["17.4"],"您可以使用regexp构造函数来创建正则表达式对象":["18.0"],"regex":["18.0"],"regexp":["18.0"],"pattern":["18.0"],"flags":["18.0"],"其中pattern是正则表达式模式字符串":["18.0"],"flags是一个可选的标志字符串":["18.0"],"先把组件样式写好":["19.1"],"然后为每个组件配置一个公共代码":["19.1"],"结合的语法糖":["19.2"],"而在":["19.2"],"vue3":["19.2","27.51"],"组件中使用v":["19.2"],"model则表示的是":["19.2"],"modelvalue":["19.2"],"update":["19.2"],"的语法糖":["19.2"],"子组件通过父组件定义的":["19.2"],"接收值传给原生input的":["19.2"],"通过原生input的":["19.2"],"每次都要全部引入所有的样式文件":["19.3"],"不仅仅是打包css文件":["19.4"],"执行命令的函数":["19.5"],"把请求的地址放在一个文件":["19.6"],"用来存放从服务器拿到的数据":["19.7"],"用的express写的一些get":["19.8"],"提高团队的效率":["19.9"],"更好的扩展性":["19.9"],"由于前后端分离的松耦合性":["19.9"],"您可以更容易地扩展和升级应用程序的不同部分":["19.9"],"于2015年发布":["19.10"],"它引入了一些重要的改进":["19.10"],"其中最显著的是多路复用":["19.10"],"multiplexing":["19.10"],"功能":["19.10","23.7"],"多路复用允许在单个tcp连接上同时发送多个请求和响应":["19.10"],"中间人攻击":["19.11"],"man":["19.11"],"control字段":["19.12"],"cache":["19.12"],"max":["19.12"],"seconds":["19.12"],"指定资源文件在被认为是新鲜":["19.12"],"是指在网页加载过程中":["19.13"],"元素的位置发生了突然而意外的变化":["19.13"],"可能会导致用户体验的不良影响":["19.13"],"这种突然的变化可能会使用户点击错位或产生其他交互问题":["19.13"],"减少页面重绘和回流":["19.14"],"提高性能":["19.14"],"优化网络请求":["19.14"],"减少网络请求次数":["19.14"],"使用压缩和缓存等技术来优化网络传输":["19.14"],"懒加载和按需加载":["19.14"],"只在需要时加载资源":["19.14"],"旨在为web开发者提供直接访问图形硬件的低级别图形编程接口":["19.15"],"跳过了解压的过程":["19.16"],"速度":["19.16"],"单一代码仓库":["19.17"],"模块":["20.1","20.4","33.5"],"学习":["20.1"],"模块使用require":["20.2"],"加载一个模块对象和module":["20.2"],"exports输出一个模块对象":["20.2"],"模块采用":["20.3"],"mjs后缀文件名":["20.3"],"但是只能整体加载":["20.4"],"不能只加载单一的输出项":["20.4"],"但是可以这样写":["20.4"],"import":["20.4","29.6","55.3","59.3"],"exports":["20.5"],"require":["20.5"],"exit":["20.7"],"cookie的有效期是可以设置的":["21.1"],"cookie的存储是4kb左右":["21.2"],"cookie会参与到与服务端的通信中":["21.3"],"doe":["21.4"],"cookie的读取":["21.4"],"x":["21.4","25.2","25.25"],"cookie的删除":["21.4"],"cookie出现的时间较早":["21.5"],"什么是token":["21.6"],"令牌":["21.7"],"服务端":["21.8"],"服务端收到请求":["21.8"],"验证用户名和密码":["21.8"],"服务端验证":["21.8"],"存localstorage里":["21.9"],"常见的使用场景包括用户认证":["21.10"],"购物车":["21.10"],"网站偏好设置等":["21.10"],"cookie是由服务器发送给浏览器的一个小的文本文件":["21.10"],"浏览器会将它保存在本地":["21.10"],"以备将来使用":["21.10"],"vite采用不同方式":["22.0"],"scripts":["22.1"],"dev":["22.1"],"create":["22.2"],"初始化项目":["23.0"],"pnpm":["23.0"],"init":["23.0"],"production生产模式":["23.2"],"数组":["23.3"],"形式里写多个入口":["23.3"],"boundle":["23.4"],"文件名不一样之前打包的不会删除":["23.4"],"开箱可用的自带能力":["23.5"],"让":["23.5"],"能够去处理其他类型的文件":["23.5"],"并将它们转换为有效":["23.5"],"配置":["23.6"],"rules":["23.6"],"test":["23.6"],"的":["23.7","52.12"],"支柱":["23.7"],"server":["23.8"],"inline":["23.9"],"source":["23.9","33.6"],"jvavscript":["24.0"],"arr2":["25.1"],"y":["25.2"],"lastname":["25.3"],"add":["25.4"],"元组最重要的特性是可以限制数组元素的个数和类型":["25.5"],"它特别适合用来实现多值返回":["25.5"],"ts":["25.5","25.26","25.27","25.28","25.29","27.33"],"employee":["25.6"],"使得程序永远无法运行到函数返回值那一步":["25.8"],"永不存在返回":["25.8"],"异常":["25.8"],"err":["25.8"],"msg":["25.8"],"ok":["25.8","25.10"],"typescript":["25.9","25.12","25.15","25.19"],"uncertain":["25.10"],"any":["25.10","25.13","25.32"],"symbol等":["25.11"],"原始类型赋值给":["25.11"],"在严格模式下":["25.11"],"类型也不能赋给":["25.11"],"这种基于赋值表达式推断类型的能力称之为类型推断":["25.12"],"somevalue":["25.13"],"is":["25.13","25.17"],"可以用于断言操作对象是非":["25.14"],"该属性会被明确地赋值":["25.15"],"为了更好地理解它的作用":["25.15"],"我们来看个具体的例子":["25.15"],"种字面量类型":["25.16"],"字符串字面量类型":["25.16"],"数字字面量类型":["25.16"],"布尔字面量类型":["25.16"],"str":["25.17","46.1","49.11","49.12","54.5"],"interfaces":["25.18"],"是一个很重要的概念":["25.18"],"只读属性用于限制只能在对象刚刚创建的时候修改其值":["25.19"],"此外":["25.19"],"interface":["25.20","25.25"],"printlabel":["25.21"],"labeledobj":["25.21"],"myobj":["25.21"],"鸭式辨型法":["25.22"],"的核心原则之一是对值所具有的结构进行类型检查":["25.24"],"而接口的作用就是为":["25.24"],"这些类型命名":["25.24"],"point":["25.25"],"联合类型":["25.26"],"元组":["25.26"],"primitive":["25.26"],"会被自动合并为单个接口":["25.27"],"extends":["25.28"],"来实现":["25.28"],"类型别名的扩展就是交叉类型":["25.28"],"接口扩展接口":["25.28"],"是一个抽象类型":["25.29"],"只有在调用的时候才确定它的值":["25.29"],"这就不用我们复制粘贴无数份代码了":["25.29"],"简单来说就是你定义一个类型":["25.30"],"然后让":["25.30"],"t":["25.30"],"类型的子类型":["25.32"],"然后使用":["25.32"],"操作符获取":["25.32"],"类型的所有键":["25.32"],"最后利用":["25.32"],"关键字约束":["25.32"],"类型必须为":["25.32"],"联合类型的子类型":["25.32"],"用来遍历枚举类型":["25.32"],"infer":["25.32"],"在条件类型语句中":["25.32"],"官方文档":["26.0"],"router是vue官方的路由管理器":["26.2"],"有hash和history两种模式":["26.2"],"hash模式是通过监听hashchange事件来实现更新页面部分内容的操作":["26.2"],"router中有个监听器":["26.3"],"用来监听history的变化":["26.3"],"相当于一个锚点":["26.4"],"后面的内容就是锚点值":["26.4"],"当监听锚点值的变化就会改变局部的页面数据":["26.4"],"模式":["26.5"],"模式改变":["26.5"],"url":["26.5"],"router":["26.6"],"from":["26.7","56.3"],"next三个参数":["26.7"],"路由跳转前都会触发":["26.7"],"登录验证时用的比较多":["26.7"],"当一个导航触发时":["26.7"],"全局前置守卫按照创建顺序调用":["26.7"],"守卫是异步解析执行":["26.7"],"此时导航在所有守卫":["26.7"],"完之前一直处于等待中":["26.7"],"调用全局的":["26.8"],"beforeeach":["26.8"],"在渲染该组件的路由被确认前访问组件实例":["26.8"],"beforerouteenter":["26.8"],"在路由配置里调用":["26.8"],"首屏组件加载速度更快一些":["26.9"],"懒加载实现的前提":["26.10"],"es6的动态加载模块":["26.10"],"使用vue的异步组件技术":["26.11"],"可以实现懒加载":["26.11"],"此时一个组件会生成一个js文件":["26.11"],"component":["26.11","27.55"],"如过渡名称":["26.12"],"需要从服务器获取数据":["26.13"],"在渲染用户信息时":["26.13"],"可以在路由定义中使用冒号":["26.14"],"来定义动态的路由参数":["26.14"],"参数直接嵌入在路由路径中":["26.15"],"在路由组件中可以通过":["26.15"],"route":["26.15"],"来获取传递的参数":["26.15"],"提供组件化开发":["27.1"],"spa":["27.2"],"描述":["27.3","34.0"],"beforecreate":["27.3","34.0"],"实例创建前":["27.3"],"用于在组件实例创建之前进行一些初始化操作":["27.4"],"事件监听":["27.5"],"定时器":["27.5"],"开启等":["27.5"],"beforemount":["27.5"],"onbeforemount":["27.5"],"阶段准备数据或执行一些初始化操作":["27.5"],"父created":["27.6"],"父beforemount":["27.6"],"子beforecreate":["27.6"],"会先执行完父组件的生命周期然后再执行子组件的生命周期":["27.7"],"show":["27.8"],"开发过程中一般不建议同时将v":["27.9"],"if放在一个标签中使用":["27.9"],"可以使用watch来对这个属性进行监听":["27.10"],"computed具有缓存的特点":["27.10"],"即当它所依赖的属性发生改变的时候它才会重新执行内部逻辑":["27.10"],"如下代码":["27.10"],"如果依赖项不变时不会重新计算":["27.11"],"简化在template模板中的复杂表达式":["27.12"],"模板中出现太多逻辑判断会造成模板不易维护":["27.12"],"的实现是基于":["27.13"],"另一种是":["27.14"],"computed":["27.15","27.20"],"属性时候":["27.15","27.16"],"遍历computed属性":["27.15"],"会循环所有计算属性":["27.16"],"每一个计算属性会创建一个":["27.16"],"watcher":["27.16","28.13"],"收集时机和":["27.17"],"data":["27.17","49.2","49.6","49.7"],"那样接收一个明确的数据源":["27.18"],"watcheffect":["27.18"],"api":["27.19"],"vue3的是composition":["27.19"],"当然vue3也兼容composition":["27.19","33.3"],"methods":["27.20"],"初始化数据响应式":["27.20"],"vue会对数据对象进行响应式处理":["27.20"],"将其转换为响应式数据":["27.20"],"观察者模式":["27.21"],"来实现的":["27.21"],"vue":["27.21","27.38","28.24","31.0","43.0","55.2","56.2","59.2"],"vue3数组可以直接使用":["27.22"],"reactive和readonly":["27.22"],"vue实例会有一个use函数":["27.23"],"它接受的是一个带有install函数的对象和一个可选的选项对象":["27.23"],"父组件使用它时直接在子组件的标签内写入内容即可":["27.24"],"子组件":["27.24","27.50"],"template":["27.24","57.7"],"slot":["27.24"],"父组件":["27.24"],"child":["27.24","27.55"],"div":["27.24"],"attrs":["27.25"],"父传子孙":["27.25"],"provide":["27.25"],"父组件通过v":["27.26"],"func":["27.27"],"func是写在父组件中的函数":["27.27"],"子组件通过某种方式比如":["27.27"],"click":["27.27","30.0","42.0"],"子组件的ref":["27.29"],"当在父组件中使用ref引用子组件时":["27.29"],"ref会被赋值为子组件实例":["27.29"],"父组件在自己的模板中使用该数据":["27.30"],"父接收一个参数slotprops":["27.30"],"它是一个包含了插槽数据的对象":["27.30"],"当我们的项目有很多个页面":["27.31"],"并且这些页面共享着多个数据状态":["27.31"],"此时我们可以引入vuex":["27.31"],"获取":["27.32"],"地址":["27.32"],"pinia解构方法":["27.32"],"storetorefs":["27.32"],"响应式解构":["27.32"],"后即可访问其内部的方法了":["27.33"],"app":["27.33","55.2","56.2","59.2"],"export":["27.33"],"useappstore":["27.33"],"通常我们切换组件的时候":["27.35"],"上一个组件就会被销毁":["27.35"],"而当我们使用":["27.35"],"created":["27.36"],"mounted":["27.36","29.3"],"使用了keep":["27.37"],"提供了一种非常灵活的方式":["27.38"],"来分发":["27.38"],"组件中的可复用功能":["27.38"],"区别":["27.39"],"中的另一个位置":["27.41"],"接收两个参数to":["27.41"],"组件用于协调对组件树中嵌套的异步依赖的处理":["27.42"],"它一般用于包裹多个异步组件处理多个异步组件加载前与完成后的统一状态":["27.42"],"更新循环结束之后执行延迟回调":["27.44"],"在修改数据之后立即使用这个方法":["27.44"],"浏览器会从头开始进行dom树的构建":["27.46"],"频繁的操作dom开销是很大的":["27.46"],"在vue中是当状态发生改变":["27.47"],"用来计算改变后的虚拟dom与改变前的虚拟dom之间的差异的算法":["27.47"],"diff算法的本质是找出两个对象之间的差异":["27.47"],"目的是尽可能复用节点":["27.47"],"比较新旧虚拟dom树的根节点":["27.48"],"js会比较新旧虚拟dom树的根节点":["27.48"],"判断它们是否相同类型的节点":["27.48"],"如果根节点相同":["27.48"],"进入下一步":["27.48"],"比较其子节点":["27.48"],"传给子组件":["27.49"],"子组件用":["27.49"],"defineprops":["27.49"],"isshow":["27.49"],"hide监听并接收参数":["27.50"],"可透传":["27.50"],"children":["27.50"],"组件的更新是异步执行的":["27.51"],"这意味着当您修改组件的数据或状态时":["27.51"],"vue并不会立即对dom进行更新":["27.51"],"相反":["27.51"],"vue会将更新操作推入一个更新队列":["27.51"],"为了配合diff算法更加高效":["27.52"],"有两个插槽":["27.53"],"储存在value中":["27.54"],"v":["27.55","57.4","57.5"],"header":["27.55"],"所有依赖它的对象都会收到通知":["28.2"],"这就是观察者模式":["28.2"],"subscriber":["28.3"],"通过自定义事件订阅主题":["28.3"],"被激活事件的对象":["28.3"],"publisher":["28.3"],"definereactive":["28.4","28.9","28.15"],"typeof":["28.4"],"object":["28.4","28.15"],"为对象的每个属性重新设置":["28.4"],"getter":["28.4"],"setter":["28.4"],"val":["28.4","28.15"],"每个属性都有单独的":["28.4"],"dep":["28.4","28.5","28.8","28.15"],"依赖管理":["28.4","28.5"],"依赖":["28.5"],"在":["28.5"],"响应式":["28.6","28.7"],"会变成":["28.7"],"化":["28.7"],"也就是改变这个对象的时候会触发get和set事件":["28.7"],"进而触发一些视图更新":["28.7"],"prototype叫arraymothods":["28.10"],"observe中在数据被读的时候":["28.11"],"触发getter方法":["28.11"],"执行dep来收集watcher":["28.11"],"数据称为wacther的依赖":["28.12"],"数据变化时":["28.12"],"开发者主动注册的watch回调函数执行":["28.13"],"常见三个场景":["28.13"],"对应三种watcher":["28.13"],"负责敦促视图更新的render":["28.13"],"执行敦促计算属性更新的computed":["28.13"],"用户注册的普通watcher":["28.13"],"watch":["28.13"],"api或watch属性":["28.13"],"watcher就是类似中介的角色":["28.13"],"数组里存放所有订阅了该属性的观察者对象watcher":["28.14"],"我们通过definereactive方法将data中的数据进行响应式后":["28.14"],"dep就是帮我们收集watcher究竟要通知到哪里":["28.14"],"依赖收集":["28.14"],"data的属性变化":["28.14"],"依赖集合":["28.15"],"defineporperty":["28.16"],"只能对":["28.16"],"对象的已知属性":["28.16"],"进行操作":["28.16"],"receiver":["28.17","28.33"],"调用":["28.18"],"reactive":["28.18"],"返回一个":["28.18"],"proxy":["28.18","28.24"],"代理对象":["28.18"],"并劫持对象的":["28.18"],"副作用函数":["28.20"],"targetmap":["28.21","28.28"],"weakmap":["28.21","28.28"],"activeeffect":["28.21"],"操作":["28.22"],"从而调用":["28.22"],"无法保证输出相同":["28.23"],"就会带来副作用":["28.23"],"中体现最为明显的一点就是":["28.24"],"代理对象之后不仅可以拦截对象属性的读取":["28.24"],"整个定义":["28.25"],"类似深拷贝与浅拷贝的区别":["28.25"],"即只处理首层数据":["28.25"],"代表假设使用":["28.25"],"shadowref":["28.25"],"声明的对象":["28.25"],"如果对象的某个属性也是对象":["28.25"],"则":["28.25"],"只有当这个属性的引用地址发生改变时才会触发更新":["28.25"],"属性的对象":["28.26"],"所以我们访问时必须通过":["28.26"],"的形式访问":["28.26"],"函数内部执行时会创建一个":["28.26"],"effect副作用函数":["28.27"],"实现依赖变量的更新":["28.28"],"用map用来存储dep":["28.30"],"handler":["28.32","48.7","48.8","48.9"],"个人理解就是":["28.33"],"访问target的key属性":["28.33"],"但是this是指向receiver":["28.33"],"proxy和reflect的方法都是一一对应的":["28.34"],"官方提供了v":["29.0"],"允许开发者自定义指令":["29.1"],"一个是指令名称":["29.2"],"一个是钩子函数对象":["29.2"],"指令名称":["29.2"],"短横线":["29.2"],"my":["29.2"],"focus":["29.2"],"驼峰式":["29.2"],"myfocus":["29.2"],"在绑定元素的父组件及他自己的所有子节点都挂载完成后调用":["29.3"],"绑定元素的父组件更新前调用":["29.3"],"beforeupdate":["29.3"],"在绑定元素的父组件及他自己的所有子节点都更新后调用":["29.3"],"updated":["29.3"],"绑定元素的父组件卸载前调用":["29.3"],"beforeunmount":["29.3"],"它会始终应用于组件的根节点":["29.4"],"和透传":["29.4"],"全局挂载":["29.6"],"createapp":["29.6"],"addeventlistener":["30.0","42.0"],"这包括但不限于按钮":["33.0"],"表单输入":["33.0"],"模态框":["33.0"],"导航栏":["33.0"],"表格":["33.0"],"回滚":["33.2"],"options":["33.3"],"api中methods":["33.3"],"compute":["33.3"],"data等api都是分散的":["33.3"],"wabpack区别":["33.4"],"es":["33.5"],"webpack":["33.5"],"需要使用自己的模块系统和构建过程":["33.5"],"item":["33.7","36.0"],"setup":["34.0"],"一般在created":["34.1"],"在自己的组件中可以访问":["34.2"],"interceptors":["34.3"],"response":["34.3"],"use":["34.3"],"子传父":["34.4"],"emit":["34.4"],"emits":["34.4"],"代表了应用程序的整体状态":["34.5"],"mutation":["34.5"],"变更":["34.5"],"是修改":["34.5"],"state":["34.6"],"状态":["34.6"],"你可以监视一个或多个属性":["34.7"],"self":["36.0"],"indexof":["36.0"],"而computed用于根据数据的变化动态计算衍生出的属性值":["36.2"],"触发时机不同":["36.2"],"watch是在数据变化时立即执行相应的操作":["36.2"],"可以执行相应的操作":["36.3"],"如发送网络请求":["36.3"],"更新其他数据":["36.3"],"触发其他函数等":["36.3"],"这对于需要在数据变化时执行一些异步或复杂的操作非常有用":["36.3"],"flex弹性布局":["36.6"],"通过在父设置display":["36.6"],"right":["36.10","48.16"],"bottom":["36.10"],"z":["36.10"],"属性无效":["36.10"],"的单向数据流是指数据在":["36.11"],"导致程序停滞":["36.12"],"通过使用异步操作":["36.12"],"可以在等待这些操作完成的同时":["36.12"],"是一种用于处理异步操作的对象":["36.13"],"它被广泛用于处理网络请求":["36.13"],"文件读写":["36.13"],"数据库操作等需要等待一段时间才能获取结果的任务":["36.13"],"会阻塞主线程的执行":["36.14"],"直到任务完成":["36.14"],"负责协调同步任务和异步任务和任务队列之间的关系的机制":["36.15"],"debounce":["38.1"],"delay":["38.1","38.2"],"throottle":["38.2"],"copy":["38.4"],"isarray":["38.4"],"i":["38.4","45.1","51.2","53.5","62.13"],"queuemicrotask":["39.0"],"callback":["39.0"],"promises":["40.1"],"track":["41.0"],"depsmap":["41.0"],"createperson":["44.3"],"person2":["44.6"],"交换位置":["45.2"],"selectsort":["45.2"],"insertsort":["45.3"],"进行一次直接插入排序":["45.4"],"排序完成":["45.4"],"shellsort":["45.4"],"gap":["45.4"],"pivotindex":["45.5"],"math":["45.5"],"floor":["45.5"],"hash":["46.1"],"hashfunc":["46.2","46.3"],"limit":["46.2","46.4"],"bucket":["46.2","46.4"],"storage":["46.2","46.4"],"prototype":["46.5","46.6","48.12","49.3","49.10"],"isprime":["46.5"],"hashtable":["46.6"],"peek":["47.0"],"stack":["47.1"],"binary":["48.1"],"二叉搜索树的特点就是相对较小的值总是保存在左结点上":["48.2"],"在树中查找一个键":["48.3"],"该类包含三个属性":["48.4"],"结点对应的key":["48.4"],"指向的左子树":["48.4"],"newnode":["48.5","49.2","49.4"],"root":["48.5","48.9","48.10","48.11"],"preordertraversalnode":["48.7"],"inordertraversal":["48.8"],"inordertraversalnode":["48.8"],"postordertraversalnode":["48.9"],"searchnode":["48.11"],"该节点有两个子节点":["48.12"],"情况比较复杂":["48.12"],"查找删除的节点current":["48.12"],"binaryserachtree":["48.12","48.15"],"remove":["48.12"],"current":["48.12","48.14","49.9"],"就是是否current就是根":["48.13"],"都为null":["48.13"],"并且为跟根":["48.13"],"那么相当于要清空二叉树":["48.13"],"当然":["48.13"],"如果有两个子结点":["48.14"],"就是三个连接了":["48.14"],"一个连接父节点":["48.14"],"一个连接唯一的子节点":["48.14"],"需要从这三者之间":["48.14"],"爷爷":["48.14"],"自己":["48.14"],"儿子":["48.14"],"将自己":["48.14"],"称为current节点的前驱":["48.15"],"比current大一点点的节点":["48.15"],"一定是current右子树的最小值":["48.15"],"称为current节点的后继":["48.15"],"也就是为了能够删除有两个子节点的current":["48.15"],"要么找到它的前驱":["48.15"],"要么找到它的后继":["48.15"],"删除的树":["48.15"],"寻找后继的代码实现":["48.15"],"寻找后继":["48.15"],"delnode要删除的节点":["48.15"],"successor后继节点":["48.15"],"successorparent后继节点的父节点":["48.15"],"else":["48.16"],"操作删除的节点的父节点parent":["48.16"],"情况1":["48.16"],"叶子结点":["48.16"],"linkedlist":["49.1","49.10"],"position":["49.5","49.7","49.11","49.12","56.8"],"previous":["49.9"],"新节点就加入到了最后":["49.11","49.12"],"while":["49.11","49.12"],"tostring":["49.11","49.12","50.1","50.2","62.3"],"insert":["49.11","49.12"],"情况一":["49.11"],"把插入的data放在首位":["49.11"],"next为空":["49.12"],"最后把新节点赋值给current":["49.12"],"isempty":["50.1","50.2"],"class类js构造函数继承":["50.2"],"enqueue":["51.1"],"push":["51.1","62.7"],"返回true或false":["52.1","52.2"],"不改变原数组":["52.3","52.4","52.9","52.14"],"反方向查找":["52.4"],"找到符合条件的第一个数":["52.4"],"符合条件":["52.5"],"的第一个数的索引":["52.5"],"里面为回调函数":["52.5"],"某个元素":["52.6"],"的第一个索引":["52.6"],"方法返回指定元素在数组中的最后一个的索引":["52.7"],"includes":["52.8"],"判断是否包含某个元素":["52.8"],"将数组中的每个元素映射到另一个数组中":["52.9"],"产生一个新的数组":["52.9"],"不产生数组":["52.10"],"对原数组也没影响":["52.10"],"方法创建一个新的数组":["52.11"],"并根据指定深度递归地将所有子数组元素拼接到新的数组中":["52.11"],"它等价于在调用":["52.12"],"方法后再调用深度为":["52.12"],"flat":["52.12","53.1","53.6"],"到终止索引":["52.13"],"内的全部元素":["52.13"],"返回一个过滤后的新数组":["52.14"],"arrfrom":["52.15"],"构造函数之间的区别在于对单个参数的处理":["52.16"],"result18":["52.17"],"返回删除后的元素":["52.18"],"改变原数组":["52.18","52.19","52.20","52.21"],"并返回该数组的新长度":["52.19","52.21"],"该对象包含数组每个索引的值":["52.23"],"类似generater函数":["52.24"],"accumulator":["52.26"],"和数组的每个值":["52.26"],"从右到左":["52.26"],"将其减少为单个值":["52.26"],"并返回该数组":["52.27"],"数组的第一个元素会变成最后一个":["52.27"],"数组的最后一个元素变成第一个":["52.27"],"该方法会改变原数组":["52.27"],"这一对象是一个由":["52.28"],"begin":["52.28"],"end":["52.28"],"决定的原数组的浅拷贝":["52.28"],"默认排序顺序是在将元素转换为字符串":["52.29"],"然后比较它们的":["52.29"],"utf":["52.29"],"代码单元值序列时构建的":["52.29"],"方法通过删除或替换现有元素或者原地添加新的元素来修改数组":["52.30"],"并以数组形式返回被修改的内容":["52.30"],"此方法会改变原数组":["52.30"],"数组中的元素将使用各自的":["52.31"],"方法转成字符串":["52.31"],"这些字符串将使用一个特定语言环境的字符串":["52.31"],"表示指定的数组及其元素":["52.32"],"arr3":["53.0"],"flatten":["53.2"],"递归":["53.3"],"result":["53.5","53.6","54.5"],"deep":["53.7"],"result1":["54.1"],"result2":["54.2"],"result3":["54.3"],"wolder":["54.5"],"button":["55.1","55.3","55.4"],"flowing":["55.4"],"朴素按钮":["56.1"],"plain":["56.1"],"lbutton":["56.3"],"primary":["56.4"],"变为朴素按钮":["56.5"],"变为圆角按钮":["56.6"],"变为不可选中状态":["56.7"],"就可以在按钮上添加":["56.8"],"如果":["56.8"],"想放在右侧只需要添加":["56.8"],"placeholder":["57.1","57.3","57.6","57.7"],"linput":["57.2"],"请输入内容":["57.3","57.6","57.7"],"br":["57.3"],"medium":["57.4"],"tel":["57.5","57.6","57.7"],"clearable":["57.6"],"prefixicon":["57.6"],"bianji":["57.6"],"prepend":["57.7"],"maxrows":["57.8"],"最小行数为2":["57.8"],"最大行数为5":["57.8"],"install":["58.0"],"arrow":["59.1"],"up":["59.1"],"down":["59.1"],"artboard":["59.1"],"attachment":["59.1","59.8"],"licon":["59.3"],"让我们图标右上角展示一个小红点":["59.4"],"设置badge属性后":["59.4"],"line":["59.7"],"fill":["59.9"],"shaixuan":["59.9"],"shandian":["59.10"],"shengyinguanbi":["59.11"],"jinru":["59.12"],"dianhua":["59.13"],"shanchu":["59.14"],"bofangjilu":["59.15"],"pinglun":["59.15"],"saoyisao":["59.16"],"llink":["60.1","60.2"],"href":["60.1","60.2"],"accept":["61.1","61.2"],"getfileslist":["61.1","61.2"],"lupload":["61.2"],"multiple":["61.2"],"table可设置宽高":["62.2"],"margin":["62.2"],"padding等属性":["62.2"],"属性值的单位可以使用px":["62.2"],"百分比值":["62.2"],"table的宽度默认由内容的宽高撑开":["62.2"],"如果table设置了宽度":["62.2"],"宽度默认被它里面的td平均分":["62.2"],"如果给某一个td设置宽度":["62.2"],"请求中的方法不允许使用":["62.6"],"情况二symbol是唯一的b和c不一样":["62.11"],"情况三":["62.11"],"tostirng":["62.12"],"得到的结果都是":["62.12"],"则浏览器不会自己计算成具体数字值":["62.14"],"而是不发生过渡效果":["62.14"],"定义了一个定位元素的上外边距与其包含块的上内边距":["62.16"],"display":["62.18"],"直接返回":["63.1"],"sum":["63.1"],"class":["63.2"],"pages在这里记录我的学习blog":["66.0"],"这里有什么":["66.0"],"面试题":["67.0"],"之旅":["67.0"]},{"0":["1.9","2.2","2.10","6.15","9.5","38.4","40.0","46.1","46.4","47.0","47.1","49.5","49.7","49.9","49.10","53.5","53.7","62.9"],"1":["6.11","6.18","9.20","11.11","11.29","11.62","12.22","12.26","13.9","13.10","14.4","25.6","25.17","26.13","28.7","29.2","33.4","36.13","45.3","45.5","52.1","52.2","52.3","52.10","52.11","52.18","52.19","52.21","52.26","52.27","52.29","52.30","52.32","53.0","54.0","62.1"],"2":["0.4","1.31","2.7","3.3","3.9","5.3","6.9","6.10","7.2","7.5","9.5","9.10","9.19","9.26","10.1","11.7","11.23","11.26","11.37","11.38","11.41","11.49","11.71","12.26","13.3","14.4","14.5","15.2","18.0","19.16","23.0","25.22","26.2","26.7","26.14","27.9","27.12","27.15","27.29","27.35","27.36","27.39","28.18","28.25","29.3","33.0","33.1","33.3","33.5","36.12","39.0","45.4","45.5","48.2","52.1","52.2","52.3","52.10","52.18","52.19","52.21","52.26","52.29","52.30","52.32","53.0","59.1"],"3":["2.7","3.5","5.8","5.9","6.19","7.5","10.2","11.42","11.75","13.2","14.4","14.5","15.3","17.1","19.2","21.8","26.7","27.1","27.12","27.22","27.32","27.42","27.48","28.11","34.5","36.10","48.4","52.1","52.2","52.3","52.29","52.32","62.2","62.13"],"4":["11.75","14.6","16.3","19.2","27.22","34.6","52.1","52.2","52.3","53.4"],"5":["4.0","8.2","16.3","19.2","25.32","53.4","54.4"],"6":["8.2","26.8","54.4"],"7":["26.8","52.16","63.1"],"10":["25.21"],"23":["11.27"],"25":["12.22"],"42":["12.16","12.20"],"110":["6.5"],"123":["62.11"],"302":["9.15","62.6"],"303":["9.15"],"304":["9.15"],"1970":["21.4"],"2000":["62.1"],"异步的":["0.1"],"j":["0.1","45.1"],"parse":["0.2","0.3","38.5"],"responsetext":["0.2"],"console":["0.2","11.33","11.46","11.72","13.6","13.10","16.2","25.32","27.33","30.0","42.0","52.17","52.22","52.23"],"log":["0.2","11.33","11.46","11.72","12.4","13.9","13.10","16.2","25.32","27.33","30.0","42.0","52.17"],"response":["0.2"],"data":["0.2","28.5","28.9","28.13","28.16","49.1"],"fetch":["0.2"],"fetch采用promise实现":["0.2"],"json":["0.3"],"post":["0.4","9.8"],"区别":["0.4"],"协议不同":["0.5"],"http和https":["0.5"],"www":["0.5"],"php":["0.6","11.61"],"callback":["0.6"],"jsonpcallback":["0.6"],"插入到页面":["0.6"],"head":["0.6","9.15","49.2","49.6","49.8"],"appendchild":["0.6"],"在以上代码中":["0.6"],"我们定义了一个名为":["0.6"],"的函数作为回调函数":["0.6"],"在请求的url中添加":["0.6"],"参数":["0.6","12.30"],"使得服务端返回的数据可以作为该函数的参数传递到客户端":["0.6"],"并在控制台中输出数据":["0.6"],"function":["0.6","1.23","1.28","3.7","11.44","12.15","12.31","28.9","28.22","28.28","36.0","39.0","46.6","48.15","62.13"],"source":["0.7","12.3"],"修改参数的格式或加密参数等":["0.8"],"这样可以在发送请求之前对参数进行统一处理":["0.8"],"全局loading状态管理":["0.8"],"你可以在请求拦截器中显示全局loading状态":["0.8"],"以提供用户反馈":["0.8"],"然后在请求完成之后隐藏loading状态":["0.8"],"可以使用户了解请求的状态":["0.8"],"请求错误处理":["0.8"],"你可以在请求拦截器中检查请求的错误":["0.8"],"并根据需要执行相应的错误处理操作":["0.8"],"如果请求需要登录权限但用户未登录":["0.8"],"你可以在请求拦截器中重定向到登录页面或执行其他操作":["0.8"],"js":["0.8","1.19","3.2","3.8","6.20","11.46","11.70","12.6","12.8","12.12","12.15","12.19","12.22","12.30","12.31","14.1","15.2","23.3","23.5","26.11","27.10","27.50","28.13","28.22","28.27","29.2","48.13","48.14","52.4","52.5","52.8","52.9","52.13","52.14","52.20","52.27","52.28","52.31","56.8","57.7","57.8"],"import":["0.8","20.5","26.10","27.33","29.2"],"axios":["0.8"],"from":["0.8","20.4","29.6","55.3","59.3"],"设置请求拦截器":["0.8"],"在请求发送之前设置请求头的token":["0.8"],"son":["1.1"],"绝对定位配合margin":["1.1"],"auto":["1.1"],"的实现方案":["1.1"],"position":["1.1"],"使用伪元素清除浮动":["1.2"],"css":["1.2","1.16","2.0","5.11","8.2","23.5"],"clearfix":["1.2"],"after":["1.2"],"是一块独立的渲染区域":["1.3"],"内部元素不会影响外部的元素":["1.3"],"如何触发":["1.3"],"根元素":["1.3"],"flex在浏览器中查看分别是":["1.5"],"flex":["1.5","62.18"],"对应的是1":["1.6","1.7"],"对应的是0":["1.8","1.9"],"结构保留":["1.11"],"占据空间":["1.11","1.13"],"仅触发重绘":["1.11"],"不会触发事件":["1.11"],"无法选中":["1.11"],"性能消耗较少":["1.11"],"设置":["1.12","10.4"],"absolute":["1.12","36.10"],"或":["1.12","9.15","11.4","27.51"],"90deg":["1.13"],"通过2d变换来达到隐藏":["1.13"],"em":["1.14","6.2"],"的区别":["1.14","1.22"],"和":["1.15","6.16","11.73","12.30","28.5","28.26"],"是":["1.15","11.63","27.47"],"一般为16px":["1.16"],"然后在css中使用rem作为单位来定义元素的尺寸":["1.16"],"例如":["1.16","6.20","10.1","11.70","18.0","19.9","19.12","59.4"],"flex即可":["1.17"],"容器有以下属性":["1.17"],"direction":["1.17"],"wrap":["1.17"],"布局是一维布局":["1.18"],"grid":["1.18"],"布局是二维布局":["1.18"],"实现多行文本溢出省略效果":["1.19"],"property":["1.20"],"对合成属性进行":["1.20"],"transition":["1.20"],"animation":["1.20"],"动画将会创建一个合成层":["1.20"],"设置了":["1.21"],"值后":["1.21"],"在屏幕范围":["1.21"],"viewport":["1.21"],"around":["1.22","1.27"],"duration":["1.23"],"指定过渡所需的完成时间":["1.23"],"timing":["1.23","1.28"],"指定过渡函数":["1.23"],"区域内的部分显示":["1.24"],"区域外的隐藏":["1.24"],"外边距和内边距等盒模型属性":["1.25"],"可以容纳其他块级元素或行内元素":["1.25"],"right":["1.26","48.15","56.8"],"main":["1.26"],"justify":["1.26"],"between":["1.27"],"对齐弹性盒的":["1.27"],"em相对于父元素":["1.29"],"类选择器":["1.30","36.16"],"link":["1.31"],"pseudo":["1.31"],"classes":["1.31"],"选择尚未访问过的链接":["1.31"],"visited":["1.31"],"选择已访问过的链接":["1.31"],"用户行为伪类选择器":["1.31"],"user":["1.31"],"修饰文本或创建特殊效果":["1.32"],"before":["1.32"],"的":["2.1"],"vw":["2.1"],"单位":["2.1"],"both":["2.2"],"height":["2.2"],"overflow":["2.2","2.10"],"hidden":["2.2","2.10"],"外边距":["2.3"],"margin":["2.3"],"css盒模型中":["2.3"],"元素的大小由这四个部分的大小和相互之间的关系决定":["2.3"],"和ie盒模型":["2.4"],"主要区别是二者的盒子宽高是否包括元素的边框和内边距":["2.4"],"其取值为content":["2.5"],"box和border":["2.5"],"更新dom节点":["2.6"],"通过display":["2.6"],"none隐藏一个dom节点":["2.6"],"将多个图标文件整合到一张图片中":["2.7"],"雪碧图":["2.7"],"背景":["2.8"],"background":["2.8"],"size":["2.8","25.21","47.0"],"origin":["2.8"],"我们可以根据屏幕宽度":["2.9"],"高度等条件来动态地调整网页的布局和样式":["2.9"],"以便适应不同尺寸的设备和不同的显示环境":["2.9"],"再利用相对定位":["2.10"],"定位到两边":["2.10"],"注意":["2.10","9.9","11.3"],"圣杯布局中间列的宽度不能小于两边任意列的宽度":["2.10"],"而双飞翼布局则不存在这个问题":["2.10"],"html":["2.10","6.4","10.5","11.63"],"class":["2.10","28.13"],"container":["2.10"],"中间":["2.10"],"左边":["2.10"],"右边":["2.10"],"padding":["2.10"],"es6":["3.1","20.2"],"文件都是一个独立的模块":["3.2"],"只允许使用唯一的一次export":["3.4"],"按需导入的成员名称必须和按需导出的名称保持一致":["3.5"],"var会提升变量的声明到作用域的顶部":["3.6"],"但let和const不会":["3.6"],"类型":["3.7","25.19"],"global":["3.7","15.2"],"window":["3.7"],"然后对其中的变量进行赋值":["3.8"],"普通函数存在着变量的提升":["3.9"],"箭头函数没有":["3.9"],"symbol":["3.10","62.10"],"class关键字是es5构造函数":["3.11"],"原型模式创建对象的语法糖":["3.11"],"根据功能封装模块":["3.12"],"通过import导入":["3.12"],"然后通过export导出":["3.12"],"promise":["3.13"],"惰性计算":["3.14"],"lazy":["3.14"],"evaluation":["3.14","12.22"],"mysymbol":["4.0"],"hello":["4.0","11.72","18.0"],"第二种写法":["4.0"],"第三种写法":["4.0"],"object":["4.0","11.33","25.21","25.26","27.21","28.8","44.4","62.12"],"defineproperty":["4.0","27.16","27.21","28.4"],"value":["4.0","5.22","11.73","14.1","14.7","28.17","29.3"],"以上的都可以得到":["4.0"],"symbol属性的遍历":["4.0"],"它可以被专门的object":["4.0"],"为渲染引擎能够理解的内部结构":["5.1"],"这个结构就是":["5.1"],"并同时将读取的数据":["5.2"],"喂":["5.2"],"给":["5.2","11.22"],"你可以把这个管道想象成一个":["5.2"],"水管":["5.2"],"网络进程接收到的字节流像水一样倒进这个":["5.2"],"而":["5.2","52.16"],"的另外一端是渲染进程的":["5.2"],"它会动态接收字节流":["5.2"],"并将其解析为":["5.2"],"javascript的运行":["5.3"],"的解析":["5.4"],"执行":["5.4"],"代码":["5.4"],"通过":["5.5","28.4"],"文件的引用":["5.6"],"或者通过style":["5.6"],"标签内置了":["5.6"],"内容":["5.6"],"那么渲染引擎还需要将这些内容转换为":["5.6"],"cssom":["5.6"],"因为javascript":["5.6"],"有修改":["5.6"],"dom树构建完成":["5.7"],"触发":["5.7"],"加载外部脚本和样式表文件":["5.8","11.49"],"css转换为cssom":["5.9","6.9"],"树是一个渐进过程":["5.10"],"为达到更好的用户体验":["5.10"],"树和":["5.11"],"的解析是从右往左逆向解析的":["5.12"],"操作":["5.13","28.18"],"时":["5.13","9.15"],"不会立即操作":["5.14"],"而是将这":["5.14"],"次更新的":["5.14"],"diff":["5.14","27.47"],"对象模拟":["5.15"],"dom":["5.15"],"树":["5.15"],"createelement":["5.17","6.7","30.0","42.0"],"方法创建":["5.17"],"表示文档中的一个节点":["5.18"],"可以是元素节点":["5.18"],"文本节点":["5.18"],"注释节点等":["5.18"],"提供了节点的基本方法和属性":["5.18"],"queryselectorall":["5.19"],"选择器选择匹配的所有元素节点":["5.19"],"返回文档的头部元素节点":["5.20"],"setattribute":["5.21"],"textcontent":["5.22"],"获取或设置元素的纯文本内容":["5.22"],"用于表单元素":["5.22"],"获取或设置输入框":["5.22"],"文本区域等的值":["5.22"],"style":["5.22"],"返回一个cssstyledeclaration对象":["5.22"],"用于访问和修改元素的样式属性":["5.22"],"dataset":["5.22"],"提供了许多常用的方法和属性":["5.23"],"defaultvalue":["5.24"],"文本输入框":["5.24"],"并返回用户输入的值":["5.24"],"settimeout":["5.24","13.9","62.13"],"url":["5.25"],"地址信息":["5.25"],"navigator":["5.25"],"中处理事件的基本对象":["5.26"],"currenttarget":["5.27"],"当前正在处理事件的元素":["5.27"],"eventphase":["5.27"],"事件的当前阶段":["5.27"],"阻止事件进一步冒泡或捕获":["5.28"],"stopimmediatepropagation":["5.28"],"doctype是html5的文档声明":["6.1"],"通过它可以告诉浏览器":["6.1"],"使用哪一个html版本标准解析文档":["6.1"],"i":["6.2","12.4","45.3","46.1","46.4"],"h3":["6.3"],"h4":["6.3"],"h5":["6.3"],"h6":["6.3"],"dl":["6.3"],"dt":["6.3"],"dd":["6.3"],"常见的行级元素":["6.3"],"最常用label的地方就是表单中的性别单选框了":["6.4"],"当点击文字时也能够自动聚焦绑定的表单控件":["6.4"],"form":["6.4"],"label":["6.4"],"href":["6.5"],"tel":["6.5","57.4"],"在seo中":["6.6"],"tdk其实就是title":["6.6"],"tagname":["6.7"],"footer":["6.8"],"header":["6.8","19.10"],"nav等":["6.8"],"视频video":["6.8"],"音频audio":["6.8"],"画布canvas":["6.8"],"html转换为dom":["6.9"],"忽略不可见的元素":["6.10"],"重绘":["6.11"],"重排一定重绘":["6.12"],"gpu":["6.13"],"合成":["6.13"],"cpu":["6.13"],"处理要快":["6.13"],"当需要":["6.13"],"不影响其他图层":["6.14"],"而其他不是合成层的渲染层":["6.14"],"则和其第一个拥有图层":["6.14"],"graphicslayer":["6.14"],"transform":["6.15"],"translatez":["6.15"],"如果使用":["6.15"],"translatex":["6.15"],"内存资源":["6.16"],"严重影响了页面的性能":["6.16"],"也就是说除了我们显式的声明的合成层":["6.17"],"还可能由于重叠原因不经意间产生一些不在预期的合成层":["6.17"],"极端一点可能会产生大量的额外合成层":["6.17"],"当浏览器解析到标签时":["6.18"],"它将该标签解释为包含这一块内容的最重要的标题":["6.18"],"有利于seo":["6.19"],"爬虫依赖标签来确定关键字的权重":["6.19"],"因此可以帮助爬虫抓取更多的有效信息":["6.19"],"广告展示等":["6.20"],"iframe元素的基本用法是通过src属性指定要嵌入的html文档或网页的url":["6.20"],"optimization":["7.1"],"汉译为搜索引擎优化":["7.1"],"言简意赅的体现出页面的主要内容":["7.2"],"可以用一些符号把不同的主题词隔开":["7.3"],"但是关键词不要太多":["7.3"],"提升关键词的密度":["7.4"],"写清楚图片索要反映的内容":["7.5"],"外链":["7.5"],"友情链接":["7.5"],"结构":["8.1","8.3"],"主要是有html标签组成":["8.1"],"text":["8.2"],"和数量单位":["8.2"],"不要在注释内容中使用":["8.2"],"所有标签的元素和属性的名字都必须使用小写":["8.2"],"尽量使用外链css样式表和js脚本":["8.3"],"表现和行为分为三块":["8.3"],"通常":["9.1"],"由http客户端发起一个请求":["9.1"],"创建一个到服务器指定端口":["9.1"],"默认是80端口":["9.1"],"的tcp连接":["9.1"],"灵活":["9.2"],"http允许传输任意类型的数据对象":["9.2"],"正在传输的类型由content":["9.2"],"type加以标记":["9.2"],"internet":["9.3"],"传输控制协议":["9.3"],"抓包工具抓下来的是密文":["9.4"],"大幅增加了中间人攻击的成本":["9.4"],"简单来说":["9.4"],"https协议是由ssl":["9.4"],"http协议构建的可进行加密传输":["9.4"],"身份认证的网络协议":["9.4"],"路径":["9.6"],"指定资源提交数据":["9.8"],"请求服务器进行处理":["9.8"],"例如提交表单或者上传文件":["9.8"],"数据被包含在请求文本中":["9.8"],"这个请求可能会创建新的资源或者修改现有资源":["9.8"],"或两者皆有":["9.8"],"put":["9.8"],"传递参数数量无限制":["9.9"],"安全性讲":["9.9"],"get和post都一样":["9.9"],"没啥所谓的哪个更安全":["9.9"],"post不能":["9.10"],"match":["9.11"],"值为上一次服务器返回的":["9.11"],"etag":["9.11"],"一般会和if":["9.11"],"cookie":["9.11","21.0"],"已有的cookie":["9.11"],"referer":["9.11"],"标识请求引用自哪个地址":["9.11"],"比如你从页面":["9.11"],"a":["9.11","12.3","12.25","25.13","52.24","59.13","62.4"],"跳转到页面":["9.11"],"请求方式中的请求参数":["9.12"],"以":["9.12"],"响应头":["9.13"],"继续处理":["9.14"],"2xx":["9.14"],"用于表示请求已被成功接收":["9.14"],"请求的网页已永久移动到新位置":["9.15"],"服务器返回此响应":["9.15"],"对":["9.15"],"请求的响应":["9.15"],"会自动将请求者转到新位置":["9.15"],"临时移动":["9.15"],"服务器目前从不同位置的网页响应请求":["9.15"],"但请求者应继续使用原有位置来进行以后的请求":["9.15"],"查看其他位置":["9.15"],"请求者应当对不同的位置使用单独的":["9.15"],"请求来检索响应时":["9.15"],"服务器返回此代码":["9.15"],"未修改":["9.15"],"自从上次请求后":["9.15"],"请求的网页未修改过":["9.15"],"服务器返回此响应时":["9.15"],"不会返回网页内容":["9.15"],"查询":["9.17"],"获取网站的ip地址":["9.17"],"向":["9.17"],"还是一个待搜索的关键词":["9.18"],"并且根据你输入的内容进行自动完成":["9.18"],"字符编码等操作":["9.18"],"操作系统缓存":["9.19"],"操作系统也有自己的":["9.19"],"应用层":["9.20"],"发送":["9.20"],"http":["9.20","57.7"],"则存入缓存":["9.22"],"closed":["9.25"],"的状态":["9.25"],"服务端处于":["9.25"],"listen":["9.25"],"状态":["9.25"],"等待服务端的确认":["9.26"],"此时客户端处于fin":["9.26"],"wait1状态":["9.26"],"服务端收到":["9.26"],"之后":["9.26"],"是用于在网络中标识和定位设备的地址":["9.28"],"在":["9.28","25.12"],"是无连接的协议":["9.29"],"数据包在发送之前不需要建立连接":["9.29"],"数据传输方式":["9.29"],"提供面向":["9.29"],"字节流的数据传输方式":["9.29"],"将数据切分为大小不等的数据段进行传输":["9.29"],"并确保数据的顺序和完整性":["9.29"],"则以":["9.29"],"数据报的形式传输数据":["9.29"],"无状态指的是在每个独立的":["9.30"],"请求之间":["9.30"],"可以设置过期时间":["9.31"],"可以是会话级别的":["9.31"],"在浏览器关闭后失效":["9.31"],"或持久性的":["9.31"],"在一定时间后失效":["9.31"],"是一种服务器端的状态管理机制":["9.31"],"当用户":["9.31"],"进行身份认证":["9.31"],"后":["9.31"],"服务器会为该用户":["9.31"],"process":["9.32","11.15"],"攻击者会利用搜索表单等功能":["10.1"],"向服务器提交恶意代码":["10.1"],"服务器将恶意代码作为响应返回给用户的浏览器":["10.1"],"浏览器解释执行该代码":["10.1"],"导致攻击成功":["10.1"],"攻击者可以构造包含恶意代码的链接":["10.1"],"引诱用户点击该链接":["10.1"],"从而触发攻击":["10.1"],"存储型":["10.1"],"跨站点脚本":["10.2"],"xss":["10.2"],"等攻击":["10.2"],"数据保护和加密":["10.2"],"web应用程序必须保护用户的敏感信息":["10.2"],"如用户名":["10.2"],"密码":["10.2"],"scripting":["10.3"],"属性":["10.4","27.14"],"进行合适的转义":["10.5"],"将特殊字符转换为其对应的":["10.5"],"实体":["10.5"],"sockets":["10.6"],"相同的密钥":["10.7"],"公钥和私钥":["10.8"],"boolean":["11.1","16.2"],"string":["11.1","25.5","25.13","25.26"],"typeof能识别所有的值类型":["11.2"],"bool":["11.3","25.17"],"array":["11.3","25.19","50.1","50.2","54.5"],"und":["11.3"],"regexp":["11.3"],"async":["11.4"],"加载和渲染后续文档元素的过程将和":["11.5"],"script":["11.5"],"它也会在html页面解析完毕之后再去执行":["11.6"],"所以定义在return上":["11.8"],"以方法形式调用this是当前实例":["11.9"],"不是所有微任务之后都会执行渲染":["11.11"],"如此形成循环":["11.11"],"又分为宏任务和微任务":["11.12"],"宏任务":["11.12"],"完成当下的宏任务后":["11.13"],"会立刻执行所有在此期间入队的微任务":["11.13"],"如果时间到了":["11.14"],"js引擎还在执行同步任务":["11.14"],"这个回调函数需要等待":["11.14"],"then":["11.15","39.0","63.1"],"微任务队列":["11.16"],"新旧对象不共享同一块内存":["11.18"],"拷贝的就是内存地址":["11.19"],"新旧对象共享同一块内存":["11.19"],"赋值后原对象改变":["11.20"],"也会影响":["11.20"],"var":["11.21","11.60","45.2","49.3"],"result":["11.21","12.22","40.0","53.4"],"return":["11.21","25.2","28.9","28.21","34.3","38.1","38.2","46.4","49.4","49.8","49.10","51.1","53.7","63.1"],"不会被回收掉":["11.24"],"只有那些找不到的对象才是内存垃圾":["11.24"],"才会在适当的时机被":["11.24"],"该执行上下文会包含函数的":["11.25"],"作用域链":["11.25"],"还会把不能转成数字的判断为true":["11.26"],"例如字符串":["11.26"],"xxx":["11.26"],"prototype":["11.27","44.6","48.15"],"age":["11.27","12.20"],"const":["11.27","12.6","12.8","12.12","12.19","12.25","20.4","27.50","28.4","28.7","33.7"],"new":["11.27","12.10","14.2","14.10","25.8","28.4","28.8","44.3","44.4"],"a为真时执行b":["11.28"],"返回一个代表该对象的字符串":["11.29"],"valueof偏向于运算":["11.29"],"存在栈内存里":["11.30"],"typeof":["11.33","28.9","39.0"],"为":["11.34"],"true":["11.34","11.40","25.8","28.4","28.15","48.12","49.11","49.12","55.4"],"不同的数据类型在底层都是通过二进制表示的":["11.35"],"需要类型相同":["11.36"],"如果有一个操作数是布尔值":["11.38"],"则在比较相等性之前先将其转换为数值":["11.38"],"按照隐式转换规则":["11.39","11.40"],"false":["11.41","12.19","46.4","48.11","49.4","49.8"],"右边为布尔值":["11.41"],"对吗":["11.42"],"不对":["11.42"],"onclick":["11.44"],"默认是false":["11.45"],"不阻止冒泡":["11.45"],"变量提升优先级":["11.46"],"并往上传播":["11.47"],"事件捕获":["11.47"],"是对xmlhttprequest对象":["11.48"],"xhr":["11.48"],"解析html结构":["11.49"],"e":["11.50","11.51"],"if":["11.50","11.51","11.53","28.9","28.28","48.11","48.13","48.14","49.2","50.2","54.3"],"这就是事件委托":["11.52"],"优点有":["11.52"],"方法遍历数组":["11.53"],"get":["11.53","14.8","28.4","28.18","28.21","28.26","28.29","49.11","49.12"],"检查当前元素是否在":["11.53"],"中存在":["11.53"],"nan":["11.54"],"静态方法和原型方法":["11.56"],"数组开头添加元素":["11.57"],"返回新数组长度":["11.57"],"reserve":["11.57"],"反转一个数组":["11.57"],"返回修改后的数组":["11.57"],"sort":["11.57"],"排序一个数组":["11.57"],"取arr中的最小值":["11.58"],"ceil":["11.58"],"小数":["11.58"],"小数向上取整":["11.58"],"alert":["11.59"],"如":["11.60"],"date":["11.60"],"uri":["11.61"],"my":["11.61","12.4"],"profile":["11.61"],"name":["11.61","12.4","12.13","12.20","25.26","27.33","44.1","44.6"],"sammer":["11.61"],"go":["11.62"],"innerheight":["11.62"],"获取浏览器窗口的高":["11.62"],"即文档对象模型":["11.63"],"和xml":["11.63"],"它从startindex返回子字符串并返回":["11.65"],"个字符数":["11.65"],"它返回从startindex到endindex":["11.66"],"1的子字符串":["11.66"],"是es5中引入的js指令":["11.67"],"元素在":["11.68"],"无需像其他参数一样在函数定义时声明":["11.70"],"我们可以这样定义一个函数":["11.70"],"arguments":["11.71"],"str":["11.72","49.3"],"in":["11.72","19.11"],"遍历对象的可枚举属性":["11.72"],"let":["11.72","14.2","14.9","14.10","25.2","25.5","25.15","25.20","28.7","28.21","38.2","40.1","44.3","45.2","46.5","46.7","48.15","49.8","49.11","49.12","50.1","50.2","52.4","52.5","52.7","52.9","52.11","52.13","52.14","52.18","52.23","52.26","52.27","52.29","52.30","52.31","53.1","54.4"],"key":["11.72","14.7","28.19","28.28","28.32","62.11"],"输出":["11.72"],"用于提供下一个值":["11.73"],"并返回一个具有":["11.73"],"done":["11.73"],"属性的对象":["11.73"],"关键字会将空对象的原型链指向构造函数的原型对象":["11.74"],"这样":["11.74"],"新创建的对象就可以访问构造函数原型对象中定义的方法和属性":["11.74"],"执行构造函数代码块":["11.74"],"冒泡时当前目标元素会变":["11.75"],"preventdefault":["11.75"],"阻止事件的默认行为":["11.75"],"中":["12.1","25.9"],"几乎所有的对象都是":["12.1"],"对象":["12.2","28.3"],"b":["12.3","12.18","12.26","16.2","25.7","52.24"],"is":["12.4"],"this":["12.4","12.13","27.32","44.5","48.12","49.1","49.2","49.5","49.6","49.7","49.10"],"am":["12.4"],"要定义或修改的属性描述符":["12.6"],"object1":["12.6","12.12","12.16","12.19","12.25"],"循环还会枚举原型链中的属性":["12.8"],"一个被冻结的对象再也不能被修改":["12.9"],"冻结了一个对象则不能向这个对象添加新的属性":["12.9"],"map":["12.10","41.0"],"foo":["12.10"],"bar":["12.10"],"prototype1":["12.12"],"level":["12.13"],"superhero":["12.13"],"baz":["12.14"],"create":["12.14"],"进行检查的":["12.15"],"car":["12.15"],"make":["12.15"],"model":["12.15","57.4"],"year":["12.15"],"property1":["12.16"],"方法返回一个由指定对象的所有自身属性的属性名":["12.17"],"for":["12.18","17.4","29.0","40.0","40.1","46.1","46.2","46.4"],"prop":["12.19"],"exists":["12.19"],"null":["12.20","38.1","38.2","46.2","46.4","48.11","48.12"],"undefined":["12.20","25.14"],"如果满足以下任意条件则两个值相等":["12.21"],"都是":["12.21"],"number":["12.22","16.2","25.7","25.10","25.15","25.23","25.25","25.28","25.32"],"视为不相等":["12.22"],"case":["12.22"],"the":["12.22","19.11"],"same":["12.22"],"as":["12.22"],"using":["12.22"],"somestring":["12.25"],"c":["12.26"],"with":["12.26"],"random":["12.26"],"bigint":["12.30"],"方法接受一个可选的":["12.30"],"radix":["12.30"],"重写派生类对象":["12.31"],"mynumbertype":["12.31"],"n":["12.31"],"这个函数为立即执行的":["13.0"],"称之为":["13.0"],"executor":["13.0","63.2"],"fulfilled":["13.2"],"已兑现":["13.2"],"执行了resolve函数则代表了已兑现状态":["13.2"],"rejected":["13.2"],"已拒绝":["13.2"],"执行了reject函数则代表了已拒绝状态":["13.2"],"如果resolve中传入的是另外一个promise":["13.3"],"那么这个新promise会决定原promise的状态":["13.3"],"当我new":["13.4"],"promise的时候":["13.4"],"会把返回的该对象的":["13.4"],"如果只捕获错误":["13.5"],"还可以这样写":["13.5"],"因为第二个参数是捕获异常的":["13.5"],"第一个可以写个null或":["13.5"],"占位":["13.5"],"ice":["13.6"],"error":["13.6","25.7","25.8"],"catch":["13.6"],"err":["13.6"],"resolve":["13.7","20.8","26.11","40.1"],"reject":["13.7","40.1"],"只要有一个promise的状态为rejected":["13.8"],"则会回调":["13.8"],"catch方法":["13.8"],"rejected状态":["13.8"],"同步的":["13.9"],"zero":["14.1"],"equality":["14.1"],"它类似于精确相等运算符":["14.1"],"主要的区别是nan等于自身":["14.1"],"而精确相等运算符认为nan不等于自身":["14.1"],"返回一个包含集合中所有键的迭代器":["14.3"],"values":["14.3"],"返回一个包含集合中所有值得迭代器":["14.3"],"entries":["14.3"],"返回一个包含set对象中所有元素得键值对迭代器":["14.3"],"是以":["14.7"],"的形式储存元素":["14.7"],"向字典中添加新元素":["14.8"],"通过键查找特定的数值并返回":["14.8"],"obj":["14.9","28.7","44.2","62.4"],"直接访问":["15.1"],"得到的是一个空对象":["15.1"],"node":["15.2","24.0","48.7","48.9","49.1"],"中指向":["15.2"],"函数中的":["15.2"],"在函数中调用":["15.2"],"浏览器window":["15.3"],"node里global":["15.3"],"对象调用方法":["15.3"],"target":["15.3","28.4","28.22","28.28"],"返回一个布尔值结果":["16.1"],"要注意":["16.2"],"函数调用":["16.3"],"后缀运算符":["16.3"],"前缀运算符":["16.3"],"先遍历再展平一级":["17.1"],"增删改查":["17.1"],"filter":["17.1"],"返回一个过滤后的新数组":["17.1"],"pop":["17.1","62.7"],"push":["17.1","26.6","33.7"],"shift":["17.1"],"unshift":["17.1"],"concat":["17.1"],"slice":["17.1"],"orange":["17.4"],"用于控制正则表达式匹配的方式":["18.0"],"和new":["18.0"],"都会创建一个匹配hello的正则表达式对象":["18.0"],"匹配字符集":["18.0"],"用方括号":["18.0"],"表示一个字符集":["18.0"],"定义一个方法组建作为参数传入":["19.1"],"给子组件":["19.2"],"传值传给父组件":["19.2"],"这样就实现了数据双向绑定":["19.2"],"尺寸通过计算属性来更改类名":["19.2"],"使用":["19.2","27.21"],"useattrs":["19.2"],"来继承原生input的属性":["19.2"],"一键清空通过":["19.2"],"做不到按需加载":["19.3"],"经常用的一个series和parallel定义执行任务顺序执行并行执行":["19.4"],"删除之前的打包文件函数":["19.5"],"写了一个配置文件":["19.6"],"在pinia的配置文件里写项目要用到的actions":["19.7"],"post等请求":["19.8"],"您可以独立扩展前端服务器或后端":["19.9"],"api":["19.9"],"而无需重新编写整个应用程序":["19.9"],"从而提高性能并减少延迟":["19.10"],"这对于加载复杂网页或处理大量资源请求时特别有用":["19.10"],"2还引入了头部压缩":["19.10"],"compression":["19.10"],"和服务器推送":["19.10"],"middle":["19.11"],"未过期":["19.12"],"之前的最长时间":["19.12"],"以秒为单位":["19.12"],"影响网页的可用性和可读性":["19.13"],"明确指定资源尺寸":["19.13"],"在网页中为图像":["19.13"],"视频和其他资源指定明确的尺寸":["19.13"],"如图片":["19.14"],"脚本和样式":["19.14"],"以减少初始加载时间":["19.14"],"图像和媒体优化":["19.14"],"图像压缩":["19.14"],"使用适当的图像压缩算法和工具":["19.14"],"减少图像文件的大小":["19.14"],"它是webgl的继任者":["19.15"],"空间占用":["19.16"],"是一种软件开发模式":["19.17"],"语言":["20.1"],"你会发现它有两种格式的模块":["20.1"],"br":["20.1","57.6"],"模块使用import引入具体数据和export导出指定数据":["20.2"],"只要脚本文件里面使用import或者export命令":["20.3"],"那么就必须采用":["20.3"],"mjs后缀名":["20.3"],"packagemain":["20.4"],"package":["20.4"],"index":["20.5","49.9","49.11","49.12"],"结束进程":["20.7"],"readfile":["20.9"],"默认的情况下是关闭浏览器后失效":["21.1"],"存储量较小":["21.2"],"一般会携带在http请求的头部中":["21.3"],"expires":["21.4"],"thu":["21.4"],"01":["21.4"],"jan":["21.4"],"00":["21.4"],"目前见到的浏览器都支持":["21.5"],"token是用来干嘛的":["21.6"],"的意思":["21.7"],"token是服务端生成的一串字符串":["21.7"],"生成token":["21.8"],"验证成功后":["21.8"],"服务端会生成一个token":["21.8"],"然后把这个token发送给客户端":["21.8"],"后期每次请求接口都需要把他当做一个字段传给后台":["21.9"],"会有xss攻击":["21.9"],"每次浏览器向服务器发送请求时":["21.10"],"它都会将相应的cookie信息发送给服务器":["21.10"],"服务器可以读取cookie中的数据":["21.10"],"从而知道用户的身份":["21.10"],"偏好设置等信息":["21.10"],"cookie通常包含以下属性":["21.10"],"开发时":["22.0"],"vite":["22.1","22.2","33.5"],"配置文件采用es6模块化规范":["22.3"],"安装":["23.0"],"配置文件采用commonjs模块化规范":["23.1"],"development开发模式":["23.2"],"src":["23.3"],"file":["23.3"],"clean":["23.4"],"模块":["23.5"],"以供应用程序使用":["23.5"],"以及被添加到依赖图中":["23.5"],"module":["23.5"],"rules":["23.5"],"test":["23.5"],"m":["23.6"],"exclude":["23.6"],"自身也是构建于你在":["23.7"],"配置中用到的":["23.7"],"开发服务器":["23.8"],"此选项控制是否生成":["23.9"],"以及如何生成":["23.9"],"vue":["24.0","27.23","27.49","27.50","28.23","29.6"],"typescript":["24.0"],"定义联合类型":["25.1"],"函数表达式":["25.2"],"else":["25.3","38.4","48.5","48.14"],"默认参数":["25.3"],"x":["25.5","25.15","25.26","25.27","25.28"],"semlinker":["25.6"],"throw":["25.8"],"loopforever":["25.8"],"while":["25.8","45.4","47.1","48.10","48.12","48.15","49.9","51.2"],"任何类型都可以被归为":["25.9"],"大object":["25.11"],"代表所有拥有":["25.11"],"tostring":["25.11"],"hasownproperty":["25.11"],"方法的类型":["25.11"],"所以所有原始类型":["25.11"],"strlength":["25.13"],"和非":["25.14"],"ts":["25.15","25.30"],"对应的字符串字面量":["25.16"],"数字字面量":["25.16"],"布尔字面量分别拥有与其值一样的字面量类型":["25.16"],"num":["25.17"],"它是对行为的抽象":["25.18"],"而具体如何行动需要由类":["25.18"],"还提供了":["25.19"],"readonlyarray":["25.19"],"t":["25.19"],"它与":["25.19"],"propname":["25.20"],"any":["25.20"],"tom":["25.20"],"ok":["25.21"],"money":["25.23"],"和为你的":["25.24"],"代码或第三方代码":["25.24"],"定义数据模型":["25.24"],"y":["25.25"],"partialpointx":["25.26"],"interface":["25.27","25.28","25.30","25.32"],"point":["25.27","25.28"],"pointx":["25.28"],"identity":["25.29"],"arg":["25.29","25.32"],"实现这个接口即可":["25.30"],"sizeable":["25.30"],"可以用":["25.32"],"声明一个类型变量并且对它进行使用":["25.32"],"returntype":["25.32"],"args":["25.32","52.12"],"r":["25.32"],"有时候我们定义的泛型不想过于灵活或者说想继承某些类等":["25.32"],"可以通过":["25.32"],"关键字添加泛型约束":["25.32"],"lengthwise":["25.32"],"length":["25.32","38.4","45.1","45.2","45.3","45.4","49.4","49.7","49.9","49.10","51.2","53.5"],"loggingidentity":["25.32"],"url后面会带有":["26.2"],"号":["26.2"],"history模式则是通过监听popstate事件来实现更新页面部分内容的操作原理和hash模式差不多":["26.2"],"浏览器地址改变":["26.3"],"当浏览器向服务器发送请求时":["26.4"],"只会把":["26.4"],"的方式会导致浏览器向服务器发送请求":["26.5"],"但是history":["26.5"],"模式可以传输复杂一些的数据":["26.5"],"而且比hash模式美观":["26.5"],"path":["26.6"],"home":["26.6"],"to目标路由对象":["26.7"],"from当前导航正要离开的路由对象":["26.7"],"next函数":["26.7"],"全局解析守卫beforeresolve":["26.7"],"和beforeeach类似":["26.7"],"区别是在导航被确认之前":["26.7"],"同时在所有组件内守卫和异步路由":["26.7"],"组件被解析之后调用":["26.7"],"守卫会在导航被确认之前被调用":["26.7"],"beforeenter":["26.8"],"解析异步路由组件":["26.8"],"在重用的组件里调用":["26.8"],"beforerouteupdate":["26.8"],"解决白屏问题":["26.9"],"调用import":["26.10"],"require":["26.11"],"放入需要加载的路由地址":["26.11"],"谁可以访问路由等":["26.12"],"你需要从服务器获取用户的数据":["26.13"],"我们可以通过两种方式来实现":["26.13"],"查询参数":["26.14","26.15"],"query":["26.15"],"是通过":["26.15"],"响应式数据绑定":["27.1"],"single":["27.2"],"page":["27.2"],"created":["27.3","34.0"],"实例创建后":["27.3","34.0"],"beforemount":["27.3","34.0"],"你可以使用onbeforemount和onmounted这两个函数来模拟beforecreate和created的行为":["27.4"],"以确保在组件挂载到dom之前":["27.5"],"数据和组件状态已经准备就绪":["27.5"],"mounted":["27.5"],"onmounted":["27.5"],"dom挂载完成":["27.5"],"可以":["27.5"],"子created":["27.6"],"子beforemount":["27.6"],"子mounted":["27.6"],"父mounted":["27.6"],"if表示一个dom元素是否被创建":["27.8"],"vue2中v":["27.9"],"for的优先级会更高":["27.9"],"template":["27.10"],"div":["27.10","27.30"],"addsum":["27.10"],"computed不支持异步":["27.12"],"watcher":["27.13"],"set":["27.14","28.4","28.17","28.18","28.21"],"为每个computed属性都创建一个watcher":["27.15"],"对每个computed属性进行get劫持":["27.15"],"get劫持是最关键的步骤":["27.15"],"并且在通过":["27.16"],"vue2":["27.16"],"proxy":["27.16"],"一样":["27.17"],"也是一个监听器":["27.18"],"它只接收一个回调函数":["27.18"],"options":["27.19"],"api中methods":["27.19"],"compute":["27.19"],"data等api都是分散的":["27.19"],"而composition":["27.19","33.3"],"这包括使用object":["27.20"],"defineproperty或es6的proxy来劫持数据的访问和修改":["27.20"],"以便能够追踪数据的变化并进行更新":["27.20"],"初始化事件系统":["27.20"],"vue会初始化事件系统":["27.20"],"包括创建事件中心":["27.20"],"eventemitter":["27.20"],"方法来劫持对象的属性":["27.21"],"watcheffect的数组侦听":["27.22"],"当我们使用":["27.23"],"具名插槽顾名思义就是具有名字的插槽":["27.24"],"子组件中可以用name熟悉对slot命名":["27.24"],"父组件在使用的时候":["27.24"],"一定要通过template":["27.24"],"中的v":["27.24"],"name或者":["27.24"],"name来定义这个插槽中的内容":["27.24"],"inject":["27.25"],"子传父":["27.25"],"emit":["27.25"],"bind给子组件传值":["27.26"],"就可以使父组件的func执行":["27.27"],"这意味着通过ref可以直接访问子组件的":["27.29"],"属性和方法":["27.29"],"并在父组件中与子组件进行交互":["27.29"],"子":["27.30"],"vuex有三个核心的概念":["27.31"],"state":["27.31"],"mutations":["27.31"],"actions":["27.31","27.32","27.33","34.6"],"修改state":["27.32"],"建议通过":["27.32"],"去修改":["27.32"],"action":["27.32","34.5"],"里可以直接通过":["27.32"],"访问":["27.32"],"definestore":["27.33"],"id":["27.33","33.7"],"setdata":["27.33"],"将其包裹的话这个组件就会被缓存":["27.35"],"当这个组件再一次被显示时就会保留之前的状态":["27.35"],"alive就不会调用beforedestroy":["27.37"],"一个混入对象可以包含任意组件选项":["27.38"],"当组件使用混入对象时":["27.38"],"所有混入对象的选项将被":["27.38"],"只能代理属性":["27.39"],"代理的是对象":["27.39"],"要去的位置":["27.41"],"和disabled":["27.41"],"是否留在原位置":["27.41"],"获取更新后的":["27.44"],"而虚拟dom就是为了减少这些操作的":["27.46"],"虚拟dom首先会通过状态生成一个虚拟节点树":["27.46"],"也就是通过移动代替新增":["27.47"],"两棵树的":["27.47"],"如果根节点不同":["27.48"],"js会销毁旧的虚拟dom树及其对应的真实dom":["27.48"],"并将新的虚拟dom树转换为真实dom":["27.48"],"插入到dom树中":["27.48"],"接收":["27.49"],"可透传":["27.49"],"在上级组件中的属性可以直接传给最底层的根组件":["27.49"],"最底层的根组件可以直接接收到父组件的属性":["27.49"],"父组件":["27.49"],"father":["27.49"],"并等待下一次dom更新循环":["27.51"],"也称为":["27.51"],"事件循环":["27.51"],"帧":["27.51"],"key是为了让diff算法更精准的识别到新旧dom的差异的节点":["27.52"],"default和":["27.53"],"fallback":["27.53"],"reactive适合复杂数据类型的对象将其包装成响应式对象":["27.54"],"h1":["27.55"],"content":["27.55"],"在观察者模式中":["28.2"],"只有两种主体":["28.2"],"目标对象":["28.2"],"通过发布主题事件的方式通知各个订阅该主题的":["28.3"],"发布订阅模式中有三个角色":["28.3"],"进行操作代理定义":["28.4"],"enumerable":["28.4","28.15"],"configurable":["28.4","28.15"],"值的读取操作":["28.4"],"进行依赖收集":["28.4"],"depend":["28.4"],"值的更新操作":["28.4"],"触发依赖更新":["28.4"],"newval":["28.4"],"初始化数据":["28.5"],"computed":["28.5"],"数据过程中":["28.5"],"val":["28.7"],"修改":["28.8"],"observe":["28.8"],"如果obj内有嵌套的属性呢":["28.9"],"我们可以使用递归来完成嵌套属性的数据劫持":["28.9"],"入口函数":["28.9"],"调用observer":["28.9"],"以array":["28.10"],"依赖":["28.11"],"此时watcher在dep集合里":["28.11"],"dep使用发布订阅模式":["28.11"],"setter方法":["28.12"],"通知watcher":["28.12"],"watcher能够控制自己属于哪个":["28.13"],"是data中的属性的还是watch":["28.13"],"或者是computed":["28.13"],"watcher自己有统一的更新入口":["28.13"],"只要你通知它":["28.13"],"就会执行对应的更新方法":["28.13"],"watcher必须要有的2个方法":["28.13"],"一个就是通知变化":["28.13"],"另一个就是被收集起来到dep中去":["28.13"],"constructor":["28.13","63.2"],"dep收集到了一个依赖watcher":["28.14"],"这个依赖就是用来管理data中数据变化的":["28.14"],"使用watch时":["28.14"],"自定义的监听某个data中属性的变化":["28.14"],"属性变化时通知watch执行回调函数":["28.14"],"dep收集到了第二个个依赖":["28.14"],"第二个依赖就是用来管理watch中message变化的":["28.14"],"所有才会导致":["28.16"],"没有在":["28.16"],"中进行声明的对象属性直接赋值时无法触发视图更新":["28.16"],"reflect":["28.17","28.19"],"与":["28.18"],"effect":["28.18"],"receiver":["28.19","28.32"],"res":["28.19","63.1"],"fn":["28.20"],"创建一个内部的副作用函数":["28.20"],"然后立即执行":["28.20"],"此时会触发对象的":["28.20"],"depsmap":["28.21","28.29"],"通过一个副作用":["28.23"],"更新":["28.24"],"方法调用之外":["28.24"],"对整个对象的新增":["28.24"],"删除":["28.24"],"至于":["28.25"],"shallowreadobly":["28.25"],"的话":["28.25"],"其实就是读取什么返回什么":["28.25"],"基本没有别的处理了":["28.25"],"接受一个内部值":["28.25"],"返回一个响应式的":["28.25"],"可更改的":["28.25"],"refimpl":["28.26"],"类型的实例":["28.26"],"其中的":["28.26"],"就保存响应式数据":["28.26"],"并定义了对象的":["28.26"],"函数收集起来放进dep里":["28.27"],"track":["28.28","28.32"],"activeeffect":["28.28"],"targetmap":["28.29"],"访问时收集依赖":["28.32"],"所以实际是访问的值是receiver的key的值":["28.33"],"但是这可不是直接访问":["28.33"],"在proxy里使用reflect会提高语义化":["28.34"],"v":["29.0"],"钩子函数对象":["29.2"],"我们会在下面介绍":["29.2"],"全局注册app":["29.2"],"createapp":["29.2"],"绑定元素的父组件卸载后调用":["29.3"],"unmounted":["29.3"],"钩子参数el":["29.3"],"指令绑定到的元素":["29.3"],"这可以用于直接操作":["29.3"],"一个对象":["29.3"],"包含以下属性":["29.3"],"attributes":["29.4"],"app":["29.6"],"没有要复制的内容":["30.0","42.0"],"textarea":["30.0","42.0","57.8"],"document":["30.0","42.0"],"readonly":["30.0","42.0"],"图表":["33.0"],"轮播图等等":["33.0"],"一致的设计语言":["33.0"],"版本控制":["33.1"],"rest":["33.2"],"api中的代码是根据逻辑功能来组织的":["33.3"],"我们可以将一个功能所定义的methods":["33.3"],"data等api会放在一起":["33.3"],"让我们可以更灵活地组合组件逻辑":["33.3"],"对模块进行打包和转换":["33.5"],"导致构建速度较慢":["33.5"],"实例并将其":["33.6"],"token":["33.6"],"children":["33.7"],"输入":["33.7"],"实例创建前":["34.0"],"或者beforerouter":["34.1"],"里面就可以":["34.1"],"别的组件访问不到":["34.2"],"拦截操作":["34.3"],"attrs":["34.4"],"listeners":["34.4"],"无":["34.4"],"合并到":["34.4"],"的唯一途径":["34.5"],"动作":["34.5","34.6"],"并在属性变化时执行特定的操作":["34.7"],"computed属性是基于它们的依赖进行缓存的":["34.7"],"setarr":["36.0"],"而computed是在依赖的数据发生变化时才进行计算":["36.2"],"并将计算结果缓存起来":["36.2"],"只有在依赖的数据发生变化时":["36.2"],"表单输入验证":["36.3"],"在表单中":["36.3"],"可以使用watch来监听输入字段的变化":["36.3"],"并根据输入的值进行验证或格式化":["36.3"],"当用户输入发生变化时":["36.3"],"可以立即进行验证并给出实时反馈":["36.3"],"flex或inline":["36.6"],"flex设置":["36.6"],"relative":["36.10"],"元素的定位相对于其正常位置进行偏移":["36.10"],"但仍然保留其原有的空间占位":["36.10"],"元素的定位相对于其最近的已定位":["36.10"],"非":["36.10"],"组件中的传递是单向的":["36.11"],"从父组件向子组件传递":["36.11"],"继续执行其他任务":["36.12"],"从而避免阻塞":["36.12"],"提升性能和响应性":["36.12"],"使用promise可以更好地组织和控制异步操作的流程":["36.13"],"使代码更具可读性和可维护性":["36.13"],"链式调用":["36.13"],"异步任务":["36.14"],"是在特定条件下触发并在后台执行的任务":["36.14"],"触发和执行是非阻塞的":["36.14"],"通常是一些比较耗时的任务":["36.14"],"不断地从任务队列中取出任务":["36.15"],"timmer":["38.1"],"temmer":["38.2"],"stringify":["38.5"],"onfulfilled":["39.0"],"onrejected":["39.0"],"count":["40.0"],"dep":["41.0"],"current":["44.1","48.15","49.6","49.8"],"o":["44.3","44.4"],"math":["45.4","46.5"],"floor":["45.4"],"pivotvalue":["45.5"],"splice":["45.5"],"判断是否是修改":["46.2"],"limit":["46.3"],"bucket":["46.3"],"storage":["46.3"],"temp":["46.5"],"parseint":["46.5"],"getprime":["46.6"],"resize":["46.7"],"newlimit":["46.7"],"oldstorage":["46.7"],"isempty":["47.0"],"tree":["48.1"],"也称二叉排序树或二叉查找树":["48.1"],"二叉搜索树是一颗二叉树":["48.1"],"相对较大的值总是保存在右结点上":["48.2"],"如果结点存在":["48.3"],"则返回true":["48.3"],"如果不存在":["48.3"],"则返回false":["48.3"],"指向的右子树":["48.4"],"对于binaryserachtree来说":["48.4"],"只需要保存根结点即可":["48.4"],"insertnode":["48.5"],"root":["48.7","48.8","48.12"],"left":["48.10"],"parent":["48.12"],"isleftchild":["48.12"],"只是清空了根":["48.13"],"因为只有它":["48.13"],"否则就把父节点的left或者right字段设置为null即可":["48.13"],"剪短":["48.14"],"让爷爷直接连接儿子即可":["48.14"],"这个过程要求改变父节点的left或者right":["48.14"],"指向要删除节点的子节点":["48.14"],"当然":["48.14"],"在这个过程中还要考虑是否current就是根":["48.14"],"getsuccessor":["48.15"],"delnode":["48.15"],"successor":["48.15"],"successorparent":["48.15"],"情况2":["48.16"],"非叶子结点":["48.16"],"只有一个节点":["48.16"],"右为空":["48.16"],"第一个节点为空":["49.2"],"把新节点放在第一个节点":["49.2"],"情况一":["49.4","49.12"],"把插入的data放在首位":["49.4","49.12"],"新插入的newnode":["49.4","49.11","49.12"],"next指向原来的第一个":["49.11","49.12"],"head指向新插入的":["49.11","49.12"],"情况二":["49.11","49.12"],"后一个":["49.11","49.12"],"prev":["49.11","49.12"],"前一个":["49.11","49.12"],"从头开始找位置":["49.11","49.12"],"priorityqueue":["50.1","50.2"],"创建一个内部类":["50.1"],"queueelement":["50.1","50.2"],"element":["50.1","50.2"],"priority":["50.1","50.2"],"enqueue":["50.1","51.2"],"extends":["50.2"],"super":["50.2"],"dequeue":["51.1"],"不改变原数组":["52.5","52.6"],"里面是一个值":["52.6"],"result12":["52.7"],"返回true或false":["52.8"],"arr8":["52.10"],"arr":["52.11","52.12","54.0"],"方法":["52.12"],"但比分别调用这两个方法稍微更高效一些":["52.12"],"它返回修改后的数组":["52.13"],"改变原数组":["52.13"],"填充一个数到最后":["52.13"],"result15":["52.13"],"result13":["52.14"],"foobar":["52.15"],"result16":["52.15","53.1"],"创建一个具有单个元素":["52.16"],"的数组":["52.16"],"arr4":["52.18"],"arr5":["52.19","52.22","52.23"],"有着和":["52.20"],"shift相似的行为":["52.20"],"但是是作用在数组的最后一个元素上的":["52.20"],"arr15":["52.21"],"result21":["52.22"],"result23":["52.23"],"arr6":["52.24"],"累加":["52.25"],"arr9":["52.26"],"arr10":["52.27"],"包括":["52.28"],"不包括end":["52.28"],"原始数组不会被改变":["52.28"],"arr13":["52.29"],"arr14":["52.30"],"例如一个逗号":["52.31"],"隔开":["52.31"],"arr17":["52.32"],"split":["53.2"],"foreach":["53.6"],"item":["53.6"],"reduce":["54.1","54.2"],"pre":["54.1","54.2","54.3"],"cur":["54.3"],"result5":["54.5"],"流光按钮":["55.1","55.4"],"ljt":["55.2","55.3","56.2","56.3","58.0","59.2","59.3"],"添加圆角":["56.1"],"round":["56.1"],"btn":["56.3"],"在组件内挂载之后只需要引用下面这行代码":["56.3"],"success":["56.4","61.1"],"事例":["56.4"],"l":["56.4","56.5","56.6","56.7","56.8","61.1","61.2"],"button":["56.5","56.6","56.7","56.8","61.1","61.2"],"type":["56.5","56.6","56.7","56.8","57.5","57.8","61.1","61.2"],"例如上面展示的效果":["56.8"],"primary":["56.8"],"请输入内容":["57.1","57.2"],"placeholder":["57.2","57.5"],"clearable":["57.4"],"password":["57.5"],"showpassword":["57.5"],"linput":["57.8"],"award":["59.1"],"auction":["59.1"],"aixin":["59.1","59.10"],"会在图标右上角展示相应的徽标":["59.4"],"licon":["59.5"],"red":["59.7"],"artboard":["59.9"],"fanhui":["59.12"],"arrow":["59.12"],"guanbi":["59.14"],"shuaxin":["59.15"],"sousuo":["59.15"],"shangchuan":["59.16"],"bangzhu":["59.16"],"underline":["60.1"],"这是超链接":["60.1"],"disabled":["60.2"],"禁用超链接":["60.2"],"plain":["61.1"],"drag":["61.2"],"那么table剩余的宽度会被其他的td平均分":["62.2"],"有点类似flex布局":["62.2"],"给table设置的高度起到的作用只是min":["62.2"],"height的作用":["62.2"],"当内容的高度高于设置的高度时":["62.2"],"table的高度会被撑高":["62.2"],"tr标签":["62.2"],"call":["62.3"],"telphone":["62.5"],"rehect":["62.9"],"所以要过渡某些属性":["62.14"],"首先需要将其重置成具体数字值":["62.14"],"change事件和inpute事件":["62.15"],"mypromise":["63.2"],"面试题":["66.0"],"代码手撕":["66.0","67.0"],"等不及了从这里开始你的":["67.0"]},{"0":["1.1","1.6","11.41","13.9","45.5","46.2","49.6"],"1":["3.12","5.2","9.4","9.25","14.2","27.38","28.5","48.7","48.8","48.9","49.11","49.12","51.2","52.17","52.20","52.28","52.31","62.4"],"2":["3.2","5.7","5.15","6.11","6.15","6.17","8.1","9.11","9.18","9.20","11.11","11.13","11.29","11.30","13.9","13.10","14.2","21.1","21.5","21.9","28.5","28.34","33.7","36.13","47.1","52.11","52.12","52.17","52.20","52.27","52.28","52.31","54.0","62.12"],"3":["3.6","6.9","6.14","9.17","10.1","11.49","13.0","13.5","14.2","19.10","19.16","23.0","23.4","26.6","27.31","27.47","29.3","33.0","33.3","36.0","36.2","36.3","36.14","52.10","52.11","52.12","52.17","52.18","52.19","52.21","52.26","52.27","52.30","52.31","53.0","54.0","62.17"],"4":["5.8","5.9","5.18","6.9","10.2","12.3","13.8","17.1","19.16","21.8","27.1","28.11","28.14","52.10","52.11","52.18","52.19","52.21","52.26","52.27","52.29","52.30","52.32"],"5":["5.18","11.21","11.75","12.3","27.22","52.1","52.2","52.3","52.10","52.13","52.18","52.19","52.21","52.26","52.29","52.30","52.32"],"6":["16.3","19.2","25.32","52.1","52.2","52.3","52.10","52.19","52.21","52.26","52.29","52.30","52.32"],"7":["8.2","52.1","52.2","52.3","52.26","52.29"],"8":["8.2","26.8","52.1","52.2","52.3","52.29","63.1"],"9":["26.8","52.29"],"24":["4.0"],"35":["25.32"],"42":["12.8","12.10","12.25"],"93":["33.3"],"123":["25.10"],"305":["9.15"],"307":["9.15"],"400":["9.15"],"401":["9.15"],"403":["9.15"],"javascript":["0.1","5.2","5.3"],"method":["0.2","20.4"],"post":["0.2","9.10"],"headers":["0.2","0.8"],"content":["0.2","1.2","1.17","9.11","27.24"],"type":["0.2","9.11","25.28"],"application":["0.2","27.2"],"body":["0.2","5.20"],"stringify":["0.2","47.0"],"title":["0.2"],"双层厚牛堡":["0.2"],"desc":["0.2"],"百分百和牛与香软芝士融为一体配合美味番茄醬丰富口感一咬即刻涌现":["0.2"],"post比get安全":["0.4"],"因为post参数在请求体中":["0.4"],"get参数在url上面":["0.4"],"get传输速度比post快":["0.4"],"子域名不同":["0.5"],"baidu":["0.5"],"data":["0.6","5.22"],"注意":["0.6","1.13","38.5"],"jsonp返回的数据是json对象可以直接使用":["0.6"],"ajax":["0.6","24.0"],"取得数据是json字符串需要转换成json对象才可以使用":["0.6"],"console":["0.6","11.70","12.12","12.14","12.19","12.20","25.15","28.15","62.13"],"log":["0.6","11.70","12.14","12.19","12.20","13.6","25.15","28.15","52.22","52.23","62.13"],"cors":["0.6"],"跨域资源共享":["0.6"],"服务器设置access":["0.6"],"control":["0.6"],"allow":["0.6"],"origin响应头之后":["0.6"],"浏览器将会允许跨域请求":["0.6"],"interceptors":["0.8"],"request":["0.8","9.8"],"use":["0.8","12.26","23.5","27.23"],"config":["0.8"],"const":["0.8","3.6","12.30","13.2","14.7","25.10","25.32","28.22","29.2","55.2","56.2","59.2"],"token":["0.8","5.2","21.8"],"localstorage":["0.8"],"getitem":["0.8"],"从本地存储中获取token":["0.8"],"if":["0.8","28.29","38.1","46.3","48.7","48.8","48.9","48.12","48.15","49.9","50.1","53.5","53.6"],"authorization":["0.8"],"bearer":["0.8"],"return":["0.8","25.10","25.29","28.28","28.32","44.3","46.3","48.10","49.5","49.7","54.1","54.2"],"error":["0.8","25.10"],"relative":["1.1","2.10"],"absolute":["1.1"],"top":["1.1","30.0","42.0"],"display":["1.2","6.10"],"table":["1.2"],"float属性不是none":["1.3"],"position为absolute或者fixed":["1.3"],"display为inline":["1.3"],"grow":["1.5"],"设置了对应元素的增长系数":["1.5"],"相当于可扩大":["1.6","1.7"],"可缩小":["1.7"],"相当于不可扩大":["1.8","1.9"],"auto":["1.9"],"是继承属性":["1.11"],"子孙节点消失由于继承了hidden":["1.11"],"通过设置visibility":["1.11"],"visible":["1.11"],"可以让子孙节点显式":["1.11"],"opacity":["1.11"],"fixed":["1.12","30.0","42.0"],"同时":["1.12"],"不可交互":["1.13"],"此方法对行内元素无效":["1.13"],"px全称pixel像素":["1.14"],"是相对于屏幕分辨率而言的":["1.14"],"css3":["1.15"],"新单位":["1.15"],"即":["1.15"],"html":["1.16","36.10"],"font":["1.16","19.13"],"size":["1.16","25.30","51.2"],"16px":["1.16"],"flow":["1.17"],"justify":["1.17"],"align":["1.17"],"items":["1.17","1.27"],"布局一次只能处理一个维度上的元素布局":["1.18"],"考虑兼容性":["1.19"],"layer":["1.20","10.6"],"这使得被动画元素在一个独立的层中进行动画":["1.20"],"通常情况下":["1.20"],"浏览器会将一个层的内容先绘制进一个位图中":["1.20"],"时该元素的位置并不受到定位影响":["1.21"],"设置是top":["1.21"],"left等属性无效":["1.21"],"当该元素的位置将要移出偏移范围时":["1.21"],"定位又会变成fixed":["1.21"],"这个是":["1.22"],"flex":["1.22"],"布局的内容":["1.22"],"delay":["1.23","1.28","5.24"],"指定过渡的延迟时间":["1.23"],"关键帧动画":["1.23"],"name":["1.23","4.0","12.30","21.10","25.32","27.24","33.7","59.5"],"指定要绑定到选择器的关键帧的名称":["1.23"],"可以指定一些特定形状":["1.24"],"裁剪一张图像":["1.24"],"行内元素则不会产生换行":["1.25"],"宽度由其内容决定":["1.25"],"不可以设置宽度":["1.25"],"两端对齐":["1.26"],"a":["1.26","3.8","6.3","12.8","14.1","18.0","25.19","28.7","33.7","53.7"],"decoration":["1.26"],"none":["1.26","6.10"],"删除链接的下划线":["1.26"],"div":["1.27","6.18","27.50"],"元素的各项":["1.27"],"iteration":["1.28"],"属性选择器和伪类选择器的权重为10":["1.30","36.16"],"action":["1.31"],"hover":["1.31"],"选择鼠标悬停在元素上的状态":["1.31"],"active":["1.31"],"选择鼠标点击按下时的状态":["1.31"],"focus":["1.31"],"选择当前获得焦点的元素":["1.31"],"在元素内容之前插入生成的内容":["1.32"],"after":["1.32"],"实现一个三角形":["2.0"],"会把视口的宽度平均分为":["2.1"],"给浮动元素父级设置高度":["2.2"],"父级同时浮动":["2.2"],"需要给父级同级元素添加浮动":["2.2"],"父级设置成":["2.2"],"在css中":["2.3"],"有两种盒模型":["2.3"],"标准盒模型和ie盒模型":["2.3"],"标准盒模型的大小计算方式是":["2.3"],"元素的内容区域的大小加上元素的填充":["2.3"],"ie盒模型中内容的宽或高将会包含内边距":["2.4"],"外边距和边框":["2.4"],"box":["2.5"],"触发重排和重绘":["2.6"],"通过visibility":["2.6"],"webp":["2.7"],"格式的浏览器尽量使用":["2.7"],"格式":["2.7"],"clip":["2.8"],"文本效果":["2.8"],"text":["2.8","5.19"],"word":["2.8","17.4"],"wrap":["2.8"],"css":["2.9","62.14"],"media":["2.9"],"screen":["2.9"],"position":["2.10","30.0","42.0"],"双飞翼布局":["2.10"],"浮动":["2.10"],"外边距负值":["2.10"],"双飞翼布局相对于圣杯布局来说":["2.10"],"左右位置的保留是通过中间列的margin值来实现的":["2.10"],"而不是通过父元素的padding来实现的":["2.10"],"模块化规范是":["3.1"],"按需导出与按需导入":["3.3"],"default":["3.4","27.42"],"按需导入时":["3.5"],"只要作用域内存在let":["3.6"],"它们所声明的变量或常量就会自动":["3.6"],"局部作用域":["3.7"],"块级作用域":["3.7"],"this":["3.7","12.15","12.30","25.16","28.13","48.14","49.3","63.2"],"let":["3.8","14.1","14.3","25.16","25.19","28.27","47.0","49.5","49.7","52.6","52.8","52.12","52.20","52.28"],"普通函数的this指向":["3.9"],"谁调用指向谁":["3.9"],"创建类的方式":["3.11"],"也可以使用export":["3.12"],"default导出":["3.12"],"函数可以实现惰性计算":["3.14"],"只有当需要获取值时":["3.14"],"异步编程":["3.14"],"getownpropertysymbols":["4.0"],"方法遍历出来":["4.0"],"该方法返回一个数组":["4.0"],"包含了当前对象的所有用作属性名的symbol值":["4.0"],"var":["4.0","11.65","11.66","12.14"],"s1":["4.0"],"s2":["4.0"],"b":["4.0","9.11","12.8","12.25","33.7","53.7"],"江左梅郎":["4.0"],"function":["4.0","5.24","11.70","12.30","25.10","25.30","28.25","48.4"],"s":["4.0"],"dom":["5.1","5.26","27.5","27.20"],"提供了对":["5.1"],"需要三个阶段":["5.2"],"通过分词器将字节流转换为":["5.2"],"v8":["5.2"],"编译":["5.2"],"过程中的第一步是做词法分析":["5.2"],"将":["5.2"],"先分解为一个个":["5.2"],"解析":["5.2","5.4"],"如果要下载javascript代码":["5.4"],"下载过程会阻塞dom":["5.4"],"async":["5.5"],"的能力":["5.6"],"所以在执行":["5.6"],"之前":["5.6"],"还需要依赖":["5.6"],"也就是说":["5.6"],"在部分情况下也会阻塞":["5.6"],"事件":["5.7"],"解析并执行脚本代码":["5.8","11.49"],"将dom和cssom合并成一棵渲染render树":["5.9","6.9"],"对渲染树进行reflow":["5.9"],"渲染引擎会尽快将内容显示在屏幕上":["5.10"],"样式表构建完毕后才开始构建的":["5.11"],"嵌套标签越多":["5.12"],"浏览器会从构建":["5.13"],"树开始从头到尾执行一遍流程":["5.13"],"需要更新":["5.13"],"内容保存到本地一个":["5.14"],"js":["5.14","11.5","11.65","11.66","13.2","14.3","14.7","24.0","26.5","27.41","27.49","48.4","52.6","52.12","55.4","57.1","57.5","59.4","59.8","59.9","59.10","59.11","59.12","59.13","59.14","59.15","59.16"],"对象中":["5.14"],"最终将这个":["5.14"],"对象一次性":["5.14"],"attch":["5.14"],"diff算法比较两棵虚拟":["5.15"],"它定义在":["5.17"],"event":["5.18","5.27","28.3"],"表示事件对象":["5.18"],"包含了与事件相关的信息和方法":["5.18"],"createelement":["5.19"],"tagname":["5.19"],"创建一个指定标签名的元素节点":["5.19"],"createtextnode":["5.19"],"返回文档的主体元素节点":["5.20"],"value":["5.21","9.12","12.6","12.7","12.26","14.6","21.10","28.4","28.25"],"设置指定属性名的属性值":["5.21"],"返回一个domstringmap对象":["5.22"],"包含了元素的自定义数据属性":["5.22"],"offsetparent":["5.22"],"获取元素的最近的定位":["5.22"],"positioned":["5.22"],"祖先元素":["5.22"],"offsettop":["5.22"],"获取元素相对于offsetparent元素的上边距的距离":["5.22"],"offsetleft":["5.22"],"以下是一些常见的":["5.23"],"在指定的延迟时间后执行一次指定的函数":["5.24"],"setinterval":["5.24"],"获取关于浏览器的信息":["5.25"],"如浏览器名称":["5.25"],"版本等":["5.25"],"innerwidth":["5.25","11.62"],"它代表了在":["5.26"],"可以是捕获阶段":["5.27"],"capturing":["5.27"],"phase":["5.27"],"立即停止事件的传播":["5.28"],"并阻止事件进一步冒泡或捕获":["5.28"],"在浏览器发展的过程中":["6.1"],"html出现过很多版本":["6.1"],"属性表示网页的标题":["6.2"],"元素则表示层次明确的页面内容标题":["6.2"],"对页面信息的抓取也有很大的影响":["6.2"],"span":["6.3"],"img":["6.3"],"button":["6.3","56.4"],"input":["6.3","6.4"],"select":["6.3"],"块级元素":["6.3"],"for":["6.4","11.27","14.10","45.4","45.5","46.5","46.7","50.1","50.2","53.4"],"male":["6.4","25.20"],"男":["6.4"],"也可以用来发送短信":["6.5"],"description":["6.6"],"方法可以让浏览器识别新的标签":["6.7"],"浏览器支持新标签后":["6.7"],"还可以为新标签添加css样式":["6.7"],"表单控件":["6.8"],"calemdar":["6.8"],"date":["6.8"],"time":["6.8"],"email":["6.8"],"计算渲染树中的元素大小和位置":["6.11"],"重绘不一定重排":["6.12"],"repaint":["6.13"],"时":["6.13","9.11"],"只需要":["6.13"],"本身":["6.13"],"不会影响到其他的层":["6.13"],"的父层共用一个":["6.14"],"它使用":["6.14"],"gpu":["6.14"],"或":["6.15"],"translatey":["6.15"],"元素将会被绘制在普通文档流中":["6.15"],"demo":["6.15"],"这一点浏览器也考虑到了":["6.16"],"因此就有了层压缩":["6.16"],"出现层爆炸的现象":["6.17"],"非语义元素":["6.18"],"提升用户体验":["6.19"],"例如title":["6.19"],"alt可以用于解释名称或者解释图片信息":["6.19"],"src":["6.20"],"https":["6.20"],"www":["6.20"],"example":["6.20"],"搜索引擎优化是一种":["7.1"],"利用搜索引擎的搜索规则来提高目前网站在有关搜索引擎内的自然排名的方式":["7.1"],"关键词":["7.2"],"最多不要超过五个":["7.3"],"有利于提升搜索引擎针对对应关键词的搜索排名":["7.4"],"内容质量":["7.5"],"内容质量不能乱写":["7.5"],"原创":["7.5"],"躲避搜索引擎的文章对比机制":["7.5"],"关键词密度":["7.5"],"所有的属性必须用引号":["8.2"],"括起来":["8.2"],"把所有":["8.2"],"和":["8.2","27.20","27.35","27.42","28.2","29.3","62.11"],"符合规范":["8.3"],"同时提高页面渲染速度":["8.3"],"http服务器则在那个端口监听客户端的请求":["9.1"],"一旦收到请求":["9.1"],"服务器会向客户端返回一个状态":["9.1"],"比如":["9.1","25.17"],"无连接":["9.2"],"每次连接只处理一个请求":["9.2"],"服务器处理完客户请求":["9.2"],"网际协议":["9.3"],"是指能够在多个不同网络间实现信息传输的协议簇":["9.3"],"要比http协议安全":["9.4"],"主要区别":["9.4"],"http的url由":["9.4"],"http":["9.4","24.0"],"的出现":["9.5"],"相比于":["9.5"],"参数":["9.6"],"向指定资源位置上传其最新内容":["9.8"],"delete":["9.8","14.8"],"请求服务器删除":["9.8"],"uri":["9.8"],"所标识的资源":["9.8"],"options":["9.8"],"使服务器传回该资源所支持的所有http请求方法":["9.8"],"get请求参数在url地址上":["9.9"],"直接暴露":["9.9"],"post请求的参数放request":["9.9"],"body部分":["9.9"],"按f12也直接暴露了":["9.9"],"向服务器发送大量数据":["9.10"],"值为页面":["9.11"],"的地址":["9.11"],"host":["9.11","11.62"],"请求的主机和端口号":["9.11"],"请求和响应常见通用的":["9.11"],"key":["9.12","11.27","11.75","12.26","25.23","28.22","38.4","48.10"],"响应体":["9.13"],"理解":["9.14"],"接收":["9.14"],"3xx":["9.14"],"使用代理":["9.15"],"请求者只能使用代理访问请求的网页":["9.15"],"如果服务器返回此响应":["9.15"],"还表示请求者应使用代理":["9.15"],"临时重定向":["9.15"],"4xx":["9.15"],"客户端错误":["9.15"],"错误请求":["9.15"],"服务器不理解请求的语法":["9.15"],"未授权":["9.15"],"请求要求身份验证":["9.15"],"对于需要登录的网页":["9.15"],"服务器可能返回此响应":["9.15"],"禁止":["9.15"],"服务器拒绝请求":["9.15"],"服务器发送查询请求":["9.17"],"通过网址获取ip地址":["9.17"],"会使用":["9.18"],"dns缓存":["9.19"],"但在这之前":["9.19"],"会向检查域名是否存在本地的":["9.19"],"请求":["9.20","11.12"],"软件层面":["9.20"],"进行三次握手判断服务端的接收":["9.25"],"发送能力":["9.25"],"客户端的接收":["9.25"],"发送能力是否是正常的":["9.25"],"会发送":["9.26"],"ack":["9.26"],"表明已经收到客户端的报文了":["9.26"],"此时服务端处于":["9.26"],"close":["9.26"],"地址中":["9.28"],"每个数据报都是独立的单元":["9.29"],"可能会以":["9.29"],"不同的顺序":["9.29"],"到达目的地":["9.29"],"提供":["9.29"],"可靠":["9.29"],"的数据传输":["9.29"],"通过确认":["9.29"],"重传和拥塞控制等机制":["9.29"],"服务器不会保留任何关于客户端的状态信息":["9.30"],"每个请求都是独立的":["9.30"],"创建一个唯一的":["9.31"],"对象":["9.31","28.25"],"并为该对象":["9.31"],"分配一个唯一的标识符":["9.31"],"id":["9.31","25.6"],"通常":["9.31"],"通过":["9.31"],"是指正在执行的程序的实例":["9.32"],"攻击通常发生在社交网站":["10.1"],"留言板":["10.1"],"博客等":["10.1"],"攻击者会将恶意代码存储在服务器上":["10.1"],"当其他用户访问包含恶意代码的页面时":["10.1"],"恶意代码会从服务器返回并在其浏览器中执行":["10.1"],"攻击者可以在博客评论区中提交恶意代码":["10.1"],"当其他用户浏览该博客时":["10.1"],"从而实现攻击":["10.1"],"信用卡号等":["10.2"],"数据保护和加密可以使用加密协议":["10.2"],"如ssl":["10.2"],"tls":["10.2"],"来加密数据传输":["10.2"],"也可以使用加密算法对数据进行加密和解密":["10.2"],"都是常见的安全漏洞":["10.3"],"存在于":["10.3"],"web":["10.3"],"cookie":["10.4"],"的":["10.4","27.47","28.18"],"避免被解释为可执行的脚本":["10.5"],"内容安全策略":["10.5"],"csp":["10.5"],"使用内容安全策略来限制网页中可以执行的脚本和资源":["10.5"],"对数据进行加密和解密":["10.7"],"公钥用于加密数据":["10.8"],"number":["11.1","12.31","25.1","25.5","25.13","25.26","25.27","25.30"],"undefined":["11.1","12.21","62.3"],"识别函数":["11.2"],"prototype":["11.3","11.71","13.4"],"tostring":["11.3","47.0"],"它是一个专门检测数据类型的方法":["11.3"],"它返回的值是一个形如":["11.3"],"的字符串":["11.3"],"通常会编写一个函数":["11.3"],"对返回的字符串从第8位做一个截取":["11.3"],"截取到倒数第一位":["11.3"],"再去做类型比较":["11.3"],"call":["11.3","11.71","12.13"],"浏览器会立即加载并执行指定的脚本":["11.4"],"立即":["11.4"],"也就是类似于把这个script放在了页面底部":["11.6"],"执行时间不同":["11.7"],"所以是闭包":["11.8"],"以普通函数形式调时严格模式下this指向undefined":["11.9"],"浏览器的事件循环由一个宏任务队列":["11.11"],"多个微任务队列组成":["11.11"],"首先":["11.11"],"渲染事件":["11.12"],"script":["11.12"],"settimeout":["11.12","13.3"],"这种设计是为了给高优先级任务一个插队的机会":["11.13"],"如果当前事件循环的队列里还有其他回调":["11.14"],"需要等其他回调执行完":["11.14"],"宏任务队列":["11.16"],"且修改新对象不会影响原对象":["11.18"],"所以如果其中一个对象改变了这个地址":["11.19"],"就会影响到另一个对象":["11.19"],"新对象":["11.20"],"就像是一个整体":["11.20"],"getsquare":["11.21"],"调用square函数":["11.21"],"全局变量赋值":["11.22"],"在内存中进行操作":["11.23"],"gc":["11.24"],"回收":["11.24"],"其次包含函数":["11.25"],"内部定义的变量":["11.25"],"只有判断nan时为true":["11.26"],"ljt":["11.27"],"a为假时执行a":["11.28"],"tostring偏向于显示":["11.29"],"对象转换时":["11.29"],"优先调用tostring":["11.29"],"不同点":["11.34"],"typeof判断null为object":["11.34"],"判断undefined为undefined":["11.34"],"二进制前三位为000则会被判断为object类型":["11.35"],"值相同":["11.36"],"转成number类型":["11.37"],"自增自减运算符":["11.37"],"false转换为0":["11.38"],"而true转换为1":["11.38"],"可转换成nan":["11.39"],"nan":["11.39","14.1"],"可转换成0":["11.40"],"false先转数字0":["11.41"],"所以可转换为":["11.41"],"javascript的计算存在精度丢失问题":["11.42"],"原因":["11.42"],"javascript中小数是浮点数":["11.42"],"决定事件是在捕获":["11.45"],"fun":["11.46"],"由最不具体的元素接收":["11.47"],"的封装":["11.48"],"stoppropagation":["11.50","11.75"],"preventdefault":["11.51"],"绑定在父元素上只需要绑定一次":["11.52"],"set":["11.53","12.13","28.26","28.32","28.33"],"如果不存在":["11.53"],"将当前元素作为键存入":["11.53"],"map的键不能重复":["11.53"],"为":["11.54","52.16"],"false":["11.54","49.7","50.1","50.2"],"splice":["11.57","17.1"],"index":["11.57","11.72","17.4","49.6","53.2"],"删除":["11.57"],"添加":["11.57"],"join":["11.57","47.0"],"将一个数组所有元素连接成字符串并返回这个字符串":["11.57"],"concat":["11.57"],"floor":["11.58"],"小数向下取整":["11.58"],"confirm":["11.59"],"new":["11.60","12.14","12.30","14.1","14.3","14.7","39.0","50.1"],"occupation":["11.61"],"pānting":["11.61"],"encoded":["11.61"],"获取浏览器窗口的宽":["11.62"],"location":["11.62"],"操作刷新按钮和地址":["11.62"],"的应用程序接口":["11.63"],"api":["11.63"],"遵循w3c":["11.63"],"的标准":["11.63"],"所有浏览器公共遵守的标准":["11.63"],"js是通过访问bom":["11.63"],"使用":["11.67"],"form":["11.68"],"元素中使用":["11.68"],"foo":["11.70","12.22","62.4"],"slice":["11.71"],"遍历数组的索引":["11.72"],"数组":["11.73"],"array":["11.73","53.5","53.6"],"包含一组有序的元素":["11.73"],"字符串":["11.73"],"string":["11.73","25.32","47.0"],"表示一串字符序列":["11.73"],"关键字会调用构造函数":["11.74"],"并将新创建的对象作为构造函数的上下文":["11.74"],"停止事件的传播":["11.75"],"阻止其在dom树中进一步传播":["11.75"],"该对象将会包裹":["12.2"],"c":["12.3","12.25","28.13","52.24"],"returnedtarget":["12.3"],"human":["12.4"],"me":["12.4"],"方法会直接在一个对象上定义一个新属性":["12.5"],"property1":["12.6","12.7"],"object1":["12.8"],"somestring":["12.8"],"不能删除已有属性":["12.9"],"不能修改该对象已有属性的可枚举性":["12.9"],"baz":["12.10"],"方法返回":["12.11"],"create":["12.12"],"创建一个新的实例对象":["12.12"],"descriptor1":["12.16"],"包括不可枚举属性但不包括":["12.17"],"symbol":["12.17"],"localsymbol":["12.18"],"globalsymbol":["12.18"],"null":["12.21","12.22","13.5","14.9","46.3","48.7","48.8","48.9","48.13","48.14","48.15","49.2","49.5"],"bar":["12.22"],"方法判断一个对象是否是可扩展的":["12.23"],"ordering":["12.26"],"when":["12.26"],"we":["12.26"],"numeric":["12.26"],"keys":["12.26"],"the":["12.26"],"returned":["12.26"],"numerical":["12.26"],"order":["12.26"],"according":["12.26"],"to":["12.26"],"方法让一个对象变的不可扩展":["12.27"],"方法返回一个布尔值":["12.28"],"方法封闭一个对象":["12.29"],"dog":["12.30","25.10"],"dog1":["12.30"],"回调有两个参数":["13.0"],"resolve":["13.0"],"方法的第二个参数reject捕获的异常依赖于上一个":["13.1"],"对象的执行结果":["13.1"],"success":["13.1","61.2"],"faild":["13.1"],"接收两个函数作为参数":["13.1"],"来处理上一个promise":["13.1"],"对象的结果":["13.1"],"状态只要从待定状态":["13.2"],"变为其他状态":["13.2"],"则状态不能再改变":["13.2"],"promise":["13.2","13.4"],"then的多次调用":["13.5"],"then返回一个promise对象":["13.5"],"第二个then读取的是上一个then返回的新的promise数据":["13.5"],"hi":["13.7"],"ice":["13.7"],"catch":["13.8","62.9"],"err":["13.8","34.3"],"当遇到rejectd的时候":["13.8"],"后续的promise结果我们是获取不到":["13.8"],"并且会把reject的实参":["13.8"],"传递给catch的err形参中":["13.8"],"allsettled":["13.8"],"上面的promise":["13.8"],"all有一个缺陷":["13.8"],"就是当遇到一个rejected的状态":["13.8"],"那么对于后面是resolve或者reject的结果我们是拿不到的":["13.8"],"es11":["13.8"],"新增语法promise":["13.8"],"无论状态是fulfilled":["13.8"],"rejected都会把参数返回给我们":["13.8"],"宏任务":["13.9"],"当前函数后的所有代码会被放进微任务队列":["13.10"],"from":["14.4","26.11","27.33","27.49","29.2","54.5"],"item":["14.5","53.2"],"filter":["14.6"],"has":["14.6","14.8","28.17"],"的形式储存":["14.7"],"m":["14.7"],"判断字典中是否存在键key":["14.8"],"creat":["14.9"],"模块中":["15.1"],"每个模块都有自己的作用域":["15.1"],"所以在模块中访问":["15.1"],"它的值取决于函数的调用方式":["15.2"],"如果函数是作为普通函数调用":["15.2"],"的值是全局对象":["15.2"],"如果函数是作为对象的方法调用":["15.2"],"这种就是改变了this了":["15.3"],"与严格相等运算符":["16.1"],"转数字为0":["16.2"],"false转数字为0":["16.2"],"转布尔值为true":["16.2"],"取反为false":["16.2"],"typeof":["16.3"],"void":["16.3"],"await":["16.3"],"找元素方法":["17.1"],"some":["17.1"],"有一个行就返回true":["17.1"],"every":["17.1"],"有一个不行就返回false":["17.1"],"find":["17.1"],"找到符合条件的第一个数":["17.1"],"findlast":["17.1"],"反向找到符合条件的第一个数":["17.1"],"of":["17.4","40.1"],"字符集中列出的任何字符都将匹配":["18.0"],"abc":["18.0"],"表示匹配a":["18.0"],"b或c中的任何一个字符":["18.0"],"您还可以使用连字符":["18.0"],"表示字符范围":["18.0"],"z":["18.0"],"内部为组件添加install函数":["19.1"],"并且通过app":["19.1"],"给父组件传一个空值":["19.2"],"密码框":["19.2"],"这里通过ref拿到了原生input的dom实例":["19.2"],"当父组件给子组件传一个showpassword时":["19.2"],"给input的type赋值为password":["19.2"],"这里通过promise":["19.2"],"then放进微任务中":["19.2"],"确保在更新":["19.2"],"showpassword":["19.2"],"的值后":["19.2"],"下一轮事件循环开始之前再次访问":["19.2"],"ipt":["19.2"],"样式文件将使用":["19.3"],"比如说打包时先删除之前的打包文件再打包":["19.4"],"获取路径的函数":["19.5"],"在里面重新定义了各种请求错误信息":["19.6"],"方法":["19.7","28.26"],"通过中间件设置了querystring模块来解析请求体":["19.8"],"更好的可维护性":["19.9"],"前后端分离使代码更模块化":["19.9"],"更易于理解和维护":["19.9"],"前端和后端团队可以专注于各自的领域":["19.9"],"server":["19.10"],"push":["19.10","39.0","47.1","50.1"],"等功能":["19.10"],"以减少数据传输量和提高效率":["19.10"],"attack":["19.11"],"缩写为mitm攻击":["19.11"],"3600表示资源文件将被缓存1小时":["19.12"],"no":["19.12"],"可以在加载前为它们保留空间":["19.13"],"避免布局偏移":["19.13"],"预加载字体":["19.13"],"使用preload标签或css中的":["19.13"],"提高加载速度":["19.14"],"响应式图片":["19.14"],"根据设备和屏幕大小":["19.14"],"使用合适的图像尺寸和分辨率":["19.14"],"避免不必要的图像加载":["19.14"],"视频流优化":["19.14"],"使用流式视频传输":["19.14"],"旨在提供更高效":["19.15"],"并发安装":["19.16"],"它将多个相关的项目或组件放置在同一个代码仓库中管理":["19.17"],"一种是":["20.1"],"br":["20.2"],"用法上面":["20.2"],"require":["20.2"],"遇到":["20.3"],"mjs文件":["20.3"],"因为":["20.4"],"模块需要支持静态代码分析":["20.4"],"而":["20.4","28.24"],"esm":["20.5"],"wrapper":["20.5"],"nexttick":["20.7"],"绝对路径":["20.8"],"appendfile":["20.9"],"localstorage和sessionstorage三者都是在开发中用到的临时存储客户端会话信息或者数据的方法":["21.0"],"一般页面最多存储20条左右信息":["21.2"],"例如一些关键密匙验证等":["21.3"],"gmt":["21.4"],"sessionstorage的相关操作":["21.4"],"存储":["21.4"],"sessionstorage":["21.4"],"setitem":["21.4"],"数据名":["21.4"],"数据值":["21.4"],"以作客户端进行请求的一个令牌":["21.7"],"名称":["21.10","23.4"],"cookie的名称":["21.10"],"值":["21.10"],"cookie中保存的数据":["21.10"],"并不对代码打包":["22.0"],"build":["22.1"],"可以使用":["22.3"],"webpackcil":["23.0"],"true":["23.4","25.17","48.11"],"加上clean后之前的就会删除":["23.4"],"style":["23.5","30.0","42.0"],"ts":["23.5","25.16","28.25"],"node":["23.6","48.8"],"modules":["23.6"],"bower":["23.6"],"components":["23.6"],"相同的插件系统":["23.7"],"之上":["23.7"],"插件目的在于解决":["23.7"],"把代码部署到服务器上":["23.8"],"代码经过打包后会被压缩":["23.9"],"arr3":["25.1","53.1"],"表示定义了一个名称叫做arr的数组":["25.1"],"这个数组中将来既可以存储数值类型的数据":["25.1"],"mysum":["25.2"],"buildname":["25.3"],"cat":["25.3"],"类型必须匹配且个数必须为2":["25.5"],"username":["25.6"],"你只能为它赋予null和undefined":["25.7"],"在strictnullchecks未指定为true时":["25.7"],"声明一个void类型的变量没有什么大用":["25.7"],"我们一般也只有在函数没有返回值时去声明":["25.7"],"never类型同null和undefined一样":["25.8"],"也是任何类型的子类型":["25.8"],"也可以赋值给任何类型":["25.8"],"但是没有类型是never的子类型或可以赋值给never类型":["25.8"],"除了never本身之外":["25.8"],"即使any也不可以赋值给never":["25.8"],"在":["25.8","27.16"],"typescript":["25.8"],"中":["25.8","25.12","29.3"],"可以利用":["25.8"],"如果不缩小类型":["25.10"],"就无法对unknown类型执行任何操作":["25.10"],"getdog":["25.10"],"非原始类型都可以赋给":["25.11"],"同样":["25.11"],"length":["25.13","46.2","46.4","49.5","52.16"],"类型":["25.14"],"具体而言":["25.14"],"initialize":["25.15"],"specifiedstr":["25.16"],"缺省显式类型注解的可变更的变量的类型转换为了赋值字面量类型的父类型":["25.17"],"的类型是":["25.17"],"classes":["25.18"],"去实现":["25.18"],"相似":["25.19"],"只是把所有可变方法去掉了":["25.19"],"因此可以确保数组创建后再也不能被修改":["25.19"],"gender":["25.20"],"需要注意的是":["25.20"],"一旦定义了任意属性":["25.20"],"那么":["25.20"],"类型断言":["25.22"],"any":["25.23"],"类型别名":["25.24"],"会给一个类型起个新名字":["25.24"],"setpoint":["25.25"],"partialpointy":["25.26"],"y":["25.26","25.28"],"类别名扩展类别名":["25.28"],"其中":["25.29"],"代表":["25.29"],"索引类型":["25.32"],"getvalues":["25.32"],"person":["25.32"],"map":["25.32","28.21","53.2"],"age":["25.32"],"musion":["25.32"],"只不过url后面不会出现":["26.2"],"会显得更加美观":["26.2"],"同时会带来一个问题":["26.2"],"因为没有":["26.2","26.5"],"点击前进后退按钮":["26.3"],"当监听到history变化之后":["26.3"],"前面部分发送给服务器":["26.4"],"一般前面部分的是不变的":["26.4"],"所以hash":["26.4"],"window":["26.5"],"addeventlistener":["26.5"],"该守卫是在异步操作执行前执行":["26.7"],"可以在异步操作执行完毕后":["26.7"],"再跳转到目标路由":["26.7"],"全局后置钩子aftereach":["26.7"],"在路由跳转完成后调用":["26.7"],"from两个参数":["26.7"],"不会接受":["26.7"],"next":["26.7","49.4","49.9"],"函数也不会改变导航本身":["26.7"],"在每次路由跳转后执行":["26.7"],"beforeresolve":["26.8"],"懒加载简单来说就是延迟加载或按需加载":["26.9"],"之处":["26.10"],"vuerouterconfig":["26.11"],"webpack写法":["26.11"],"将import":["26.11"],"userdetails":["26.11"],"这些事情可以通过接收属性对象的meta属性来实现":["26.12"],"导航完成之后获取":["26.13"],"先完成导航":["26.13"],"查询参数是通过":["26.14"],"url":["26.14","26.15"],"的查询字符串进行传递的":["26.15"],"参数以键值对的形式出现在":["26.15"],"中的查询字符串中":["26.15"],"指令和插值表达式":["27.1"],"onbeforemount":["27.3","34.0"],"dom挂载前调用":["27.3","34.0"],"mounted":["27.3","34.0"],"onmounted":["27.3"],"组合式api一般在setup中请求数据":["27.4"],"访问":["27.5"],"节点":["27.5"],"进行":["27.5"],"数据交互":["27.5"],"beforeupdate":["27.5"],"渲染":["27.6"],"更新过程":["27.6"],"而v":["27.8"],"show则是控制这个dom元素的display属性是否为none":["27.8"],"所以会先执行循环":["27.9"],"再进行v":["27.9"],"if判断":["27.9"],"都是以":["27.12"],"vue":["27.12","29.2","33.3"],"实例对象":["27.13"],"而且":["27.14"],"将computed":["27.15"],"watcher添加到data属性值的订阅者队列":["27.15"],"vue3":["27.16"],"定义监听":["27.16"],"get":["27.16","28.7","28.8","28.15","28.20","28.28"],"是在组件挂载前":["27.17"],"但是其收集对象是自己属性对应的":["27.17"],"而在这个回调函数当中":["27.18"],"它会自动监听响应数据":["27.18"],"api中的代码是根据逻辑功能来组织的":["27.19"],"我们可以将一个功能所定义的methods":["27.19"],"data等api会放在一起":["27.19"],"让我们可以更灵活地组合组件逻辑":["27.19"],"处理组件上的事件绑定":["27.20"],"初始化虚拟dom":["27.20"],"vue会创建一个虚拟dom树":["27.20"],"virtual":["27.20"],"用于描述组件的结构和状态":["27.20"],"为其添加":["27.21"],"getter":["27.21"],"setter":["27.21"],"v":["27.22","27.24","29.3"],"for的key属性":["27.22"],"plugin":["27.23"],"listeners":["27.25"],"无":["27.25"],"合并到":["27.25"],"attrs方式":["27.25","34.4"],"子组件渲染出来":["27.26"],"还可以传参":["27.27"],"参数1":["27.27"],"参数n":["27.27"],"useattrs":["27.28"],"dom元素的ref":["27.29"],"当在vue模板中使用ref引用dom元素时":["27.29"],"ref会被赋值为对应的dom元素":["27.29"],"message":["27.30"],"其中state为存放数据的地方":["27.31"],"mutations中的函数作用则是用来修改state":["27.31"],"actions中一般是用了处理一些异步操作的函数":["27.31"],"changename":["27.32"],"通过getter修改":["27.32"],"不建议":["27.32"],"方法每次页面渲染都会调用":["27.32"],"性能消化大":["27.32"],"useuserstore":["27.33"],"user":["27.33"],"alive接收两个属性include":["27.35"],"exclude":["27.35"],"分别代表哪些组件要用缓存和哪些不需要缓存":["27.35"],"第二次或以后使用组件时触发activated":["27.36"],"beforecreate":["27.36"],"组件销毁前钩子":["27.37"],"混合":["27.38"],"进入该组件本身的选项":["27.38"],"mixin的作用将组件的公共逻辑提取出来":["27.38"],"对象上新增属性":["27.39"],"proxy可以监听到":["27.39"],"defineproperty不能":["27.39"],"接收比如下面代码":["27.41"],"组件有两个插槽":["27.42"],"这是什么意思呢":["27.44"],"其实vue中修改data不会立刻触发dom更新":["27.44"],"js对象":["27.46"],"o":["27.47"],"n":["27.47"],"比较子节点":["27.48"],"对于每对相同位置的子节点":["27.48"],"递归地应用diff算法":["27.48"],"比较它们的差异":["27.48"],"js会使用一种叫做":["27.48"],"从pinia拿数据":["27.49"],"import":["27.49"],"usemealsstore":["27.49"],"defineemit":["27.50"],"hide":["27.50"],"click":["27.50"],"结束后才进行实际的dom更新":["27.51"],"是":["27.51"],"提供的方法":["27.51"],"default是显示具体内容":["27.53"],"追踪更新对象的多个属性":["27.54"],"footer":["27.55"],"p":["27.55"],"object":["28.2","28.24","44.3","52.22","52.23"],"发布者":["28.3"],"事件调度中心":["28.3"],"notify":["28.4"],"观察者的构造函数":["28.4"],"接收一个表达式和回调函数":["28.4"],"watcher":["28.4"],"vm":["28.4"],"exporfn":["28.4"],"cb":["28.4","28.13"],"parsepath":["28.4"],"实例触发值读取时":["28.4"],"会涉及到以下几个对象":["28.5"],"下文中该方法统称为getter":["28.7"],"defineproperty":["28.8","28.16","28.24"],"reactivegetter":["28.8"],"遍历obj的属性":["28.9"],"遍历该对象":["28.9"],"并进行数据劫持":["28.9"],"prototype为原型":["28.10"],"当数据发生变化时":["28.11"],"循环依赖列表":["28.11"],"把所有的watcher通知一遍":["28.11"],"watcher收到后执行回调":["28.12"],"expression":["28.13"],"数据对象":["28.13"],"如obj":["28.13"],"表达式":["28.13"],"如b":["28.13"],"根据data和expression就可以获取watcher依赖的数据":["28.13"],"依赖变化时触发的回调":["28.13"],"使用computed计算属性时":["28.14"],"a属性是依赖b属性变化的时":["28.14"],"b变化时要通知到computed":["28.14"],"让它去执行回调函数":["28.14"],"这个时候message的dep就收集到了三个依赖":["28.14"],"这个依赖就是用来管理computed中message变化的":["28.14"],"我被读了":["28.15"],"我要不要做点什么好":["28.15"],"被读取了":["28.15"],"将这个依赖收集起来":["28.15"],"碍于":["28.16"],"prop":["28.17"],"方法时":["28.18"],"会访问属性":["28.18"],"state":["28.18"],"counter":["28.18"],"此时会触发":["28.18"],"track":["28.19","28.20"],"收集依赖":["28.19"],"操作":["28.20"],"调用":["28.20"],"dep":["28.21"],"depsmap":["28.22","28.28"],"targetmap":["28.22"],"effect":["28.23"],"函数来跟踪当前正在运行的函数":["28.23"],"枚举等也能直接拦截":["28.24"],"此对象只有一个指向其内部值的属性":["28.25"],"t":["28.25"],"用来收集依赖和发布更新事件":["28.26"],"如果不是":["28.26"],"shallowref":["28.26"],"声明的浅层响应式数据的话":["28.26"],"其":["28.26"],"activeeffect":["28.27"],"reflect":["28.32"],"属性":["28.33"],"大家要区分一下":["28.33"],"model":["29.0"],"app":["29.2"],"传递给指令的值":["29.3"],"例如在":["29.3"],"my":["29.3"],"directive":["29.3"],"值是":["29.3"],"oldvalue":["29.3"],"之前的值":["29.3"],"仅在":["29.3"],"中可用":["29.3"],"无论值是否更改":["29.3"],"它都可用":["29.3"],"arg":["29.3"],"传递给指令的参数":["29.3"],"类似":["29.4"],"在vue3中如果组件有多个根结点":["29.4"],"9999px":["30.0","42.0"],"灵活的可定制性":["33.0"],"好的组件库应该提供灵活的可定制性选项":["33.0"],"允许开发者根据项目需求进行样式":["33.0"],"主题和功能上的定制":["33.0"],"发布日志":["33.1"],"完全回退":["33.2"],"vue2将响应式数据放到data函数中":["33.3"],"而vue3则是使用ref和reactive将数据声明为响应式":["33.3"],"响应式实现方式":["33.3"],"e5":["33.3"],"vite是es6模块":["33.4"],"采用了按需编译的策略":["33.5"],"只在需要时编译单个模块或文件":["33.5"],"而不是像":["33.5"],"属性传给axios":["33.6"],"arrr":["33.7"],"如果涉及到需要页面加载完成之后的话用mounted":["34.1"],"在vue中":["34.2"],"对响应错误进行处理":["34.3"],"provide":["34.4"],"inject":["34.4"],"类似于":["34.5"],"不同之处在于":["34.5"],"是用于执行异步操作或批量的":["34.5"],"getters":["34.6"],"获取器":["34.6"],"mutations没有了":["34.6"],"只有当依赖发生变化时":["34.7"],"使用reduce":["36.0"],"reduce":["36.0","53.7","54.4"],"result":["36.0"],"current":["36.0","48.13","49.3","49.7"],"computed会重新计算":["36.2"],"而当没有相关数据变化时":["36.2"],"computed会返回之前缓存的计算结果":["36.2"],"深度监听":["36.3"],"通过设置deep":["36.3"],"true选项":["36.3"],"可以在watch中进行深度监听":["36.3"],"即递归地监听对象或数组内部属性的变化":["36.3"],"常用属性flex":["36.6"],"的祖先元素进行定位":["36.10"],"如果没有已定位的祖先元素":["36.10"],"则相对于最初的包含块":["36.10"],"一般是":["36.10"],"元素":["36.10"],"元素脱离了文档流":["36.10"],"这意味着父组件可以通过":["36.11"],"props":["36.11"],"在网络请求中":["36.12"],"异步操作允许在等待响应期间继续处理其他用户交互":["36.12"],"而不会使界面冻结":["36.12"],"将异步操作封装在一个promise对象中":["36.13"],"并通过链式调用来处理操作的完成或失败":["36.13"],"处理异步操作的结果":["36.13"],"它们的执行通常由底层的操作系统或浏览器的相应组件处理":["36.14"],"任务队列":["36.14"],"按照一定顺序执行":["36.15"],"args":["38.1"],"arguments":["38.1"],"newtimmer":["38.2"],"in":["38.4"],"hasownproperty":["38.4"],"不能拷贝包含函数":["38.5"],"正则表达式":["38.5"],"throw":["39.0"],"try":["39.0"],"i":["40.0","45.4","46.2","50.1","50.2","53.4"],"add":["41.0","50.1","50.2"],"trigger":["41.0"],"john":["44.1","44.6"],"min":["45.2"],"挑一个比":["45.2"],"temp":["45.3"],"left":["45.5","48.11","48.13","48.14","48.15"],"right":["45.5","48.13","48.14"],"tuple":["46.2","46.4"],"sqrt":["46.5"],"num":["46.6"],"while":["46.6","49.6"],"storage":["46.7"],"limit":["46.7"],"json":["47.0"],"math":["47.1"],"可以为空":["48.1"],"如果不为空":["48.1"],"那么利用这个特点":["48.2"],"inordertraverse":["48.3"],"通过中序遍历方式遍历所有结点":["48.3"],"preordertraverse":["48.3"],"因为其他结点都可以通过根结点找到":["48.4"],"binaryserachtree":["48.4"],"递归方法实现插入":["48.5"],"处理经过的节点":["48.7"],"处理左子树中的节点":["48.9"],"else":["48.11","49.2","50.1","50.2"],"root":["48.14"],"左为空":["48.16"],"最后一个节点":["49.2"],"head":["49.3","49.4"],"next指向原来的第一个":["49.4"],"head指向新插入的":["49.4"],"indexof":["49.11","49.12","54.3"],"update":["49.11","49.12"],"shift":["51.1","62.7"],"front":["51.1"],"result99":["52.4"],"arr":["52.4","52.5","52.7","52.9","52.13","52.14"],"result9":["52.5"],"result11":["52.6"],"result10":["52.8"],"result14":["52.9"],"arr7":["52.12"],"创建一个":["52.16"],"arr11":["52.20"],"d":["52.24"],"e":["52.24","62.9"],"arr12":["52.28"],"arr16":["52.31"],"parsefloat":["53.2"],"isarray":["53.5","53.6"],"cur":["54.1","54.2"],"result4":["54.4"],"pre":["54.4"],"btn":["55.2","55.3","56.2","58.0","59.2","59.3"],"禁用":["56.1"],"disabled":["56.1"],"你就可以看到按钮啦":["56.3"],"primary":["56.5","56.6","56.7"],"plain":["56.8","61.2"],"shuaxin":["56.8"],"placeholder":["57.4"],"请输入内容":["57.4"],"请输入密码":["57.5"],"suffixicon":["57.6"],"bianji":["59.1"],"bangzhu":["59.1"],"bofangjilu":["59.1"],"dianhua":["59.1"],"dianzan":["59.1"],"在组件内挂载之后只需要引用下面这行代码":["59.3"],"licon":["59.4"],"apple":["59.5"],"fill":["59.7"],"line":["59.8","59.10","59.12","59.16"],"gengduo":["59.9"],"award":["59.10"],"shengyin":["59.11"],"up":["59.12"],"down":["59.12"],"fenxiang2":["59.13"],"shibai":["59.14"],"xiaoxi":["59.15"],"zhihui":["59.15"],"auction":["59.16"],"文件上传":["61.1","61.2"],"tr":["62.2"],"给tr设置高度只起到min":["62.2"],"默认会平分table的高度":["62.2"],"tr中的td默认高度会继承tr的高度":["62.2"],"若给任一td设置了高度":["62.2"],"其他td的高度也同样变高":["62.2"],"类型只有":["62.5"],"临时移动":["62.6"],"属性使用裁剪方式创建元素的可显示区域":["62.8"],"除了obeject之外的其他类型":["62.12"],"直接调用":["62.12"],"用户键入内容改变时":["62.15"],"应该设置在父元素上":["62.18"],"封装好的组件库":["66.0"],"错题集":["66.0"]},{"0":["1.11","4.0","11.40","11.72","46.3","51.1","53.4","53.6"],"1":["1.21","3.8","9.1","9.5","11.70","13.1","14.3","19.17","25.1","25.19","28.3","45.1","45.2","46.2","46.4","48.1","52.13","54.3"],"2":["2.1","3.4","5.4","9.4","9.25","11.70","13.1","14.3","21.2","21.3","25.15","25.19","27.8","27.19","27.38","28.24","33.2","33.4","46.5","48.7","48.8","48.9","48.11","62.1"],"3":["1.31","3.3","3.9","5.3","9.10","9.26","11.14","11.23","11.29","11.38","11.41","11.70","13.3","13.9","13.10","18.0","23.3","25.19","25.22","26.14","27.9","27.10","27.19","27.39","28.5","28.16","28.18","28.25","28.26","33.1","33.5","33.7","36.12","48.2","52.20","52.28"],"4":["3.6","6.14","6.19","7.5","9.17","11.29","11.49","13.9","14.5","15.3","25.19","27.48","29.3","33.0","33.7","34.5","36.0","36.3","36.10","52.12","52.17","52.20","52.28","52.31","53.0","54.0","62.17"],"5":["10.2","27.1","52.11","52.12","52.17","52.20","52.27","52.28","52.31","53.0","54.0"],"6":["3.7","5.18","11.75","52.6","52.11","52.12","52.17","52.18","52.20","52.27","52.28","52.31"],"7":["12.26","16.3","46.4","52.10","52.11","52.12","52.17","52.18","52.19","52.20","52.21","52.27","52.28","52.30","52.31","52.32"],"8":["7.5","9.15","16.3","52.10","52.12","52.17","52.18","52.19","52.21","52.26","52.27","52.30","52.32"],"9":["0.2","9.15","52.1","52.2","52.3","52.10","52.12","52.21","52.26","52.30","52.32"],"10":["5.13","25.5","26.8","52.1","52.2","52.3","52.7","52.10","52.21","52.26","52.29","52.30"],"11":["26.8"],"20":["44.1"],"25":["0.2"],"28":["44.6"],"30":["38.4"],"42":["12.6"],"50":["1.24"],"94":["33.3"],"100":["2.1","12.26"],"123":["27.50"],"200":["9.1"],"404":["9.15"],"405":["9.15"],"406":["9.15"],"407":["9.15"],"408":["9.15"],"409":["9.15"],"456":["62.11"],"1000":["62.1"],"3000":["13.3"],"and":["0.1","2.9"],"price":["0.2"],"img":["0.2"],"images":["0.2"],"meals":["0.2","27.49"],"png":["0.2"],"then":["0.2","13.7","40.0"],"res":["0.2","13.7","40.0"],"读json格式数据":["0.2"],"eval":["0.3"],"jsonstr":["0.3"],"根据传参决定的":["0.4"],"post通过请求体传参":["0.4"],"后台通过数据流接收":["0.4"],"速度稍微慢一些":["0.4"],"而get通过url传参可以直接获取":["0.4"],"com":["0.5","0.6","6.20"],"主域名不同":["0.5"],"需要后台设置":["0.6"],"access":["0.6"],"origin":["0.6"],"允许所有域名访问":["0.6"],"或者":["0.6","63.1"],"a":["0.6","12.4","12.22","13.5","52.29"],"只允许所有域名访问":["0.6"],"限制":["0.6"],"浏览器需要支持html5":["0.6"],"可以支持post":["0.6"],"put等方法兼容ie9以上":["0.6"],"promise":["0.8","34.3"],"reject":["0.8","13.0","13.2","34.3","63.2"],"设置响应拦截器":["0.8"],"在接收到响应后验证token的有效性":["0.8"],"response":["0.8"],"在这里执行对响应的处理":["0.8"],"originalrequest":["0.8"],"如果响应状态码为401":["0.8"],"表示token已过期或无效":["0.8"],"left":["1.1","48.5","48.8","48.9","48.12"],"bottom":["1.1"],"right":["1.1","48.11","48.12"],"margin":["1.1","2.2"],"class":["1.2","3.11","28.14"],"block":["1.3","2.2"],"table":["1.3"],"cell":["1.3","62.2"],"shrink":["1.5"],"可缩小":["1.6","1.8"],"basis为auto":["1.7"],"不可缩小":["1.9"],"可以正常触发事件":["1.11"],"因合成层触发gpu加速":["1.11"],"所以不发生回流和重绘":["1.11"],"circle":["1.13"],"0px":["1.13"],"利用裁剪创建元素的可显示区域":["1.13"],"它是一个绝对单位":["1.14"],"em是一个相对长度单位":["1.14"],"view":["1.15"],"width":["1.15","1.16","2.9"],"可视窗口宽度":["1.15"],"基准字体大小":["1.16"],"div":["1.16","27.27"],"10rem":["1.16"],"direction属性决定主轴的方向":["1.17"],"wrap属性定义":["1.17"],"一行或者一列":["1.18"],"布局是将容器划分成了":["1.18"],"overflow":["1.19"],"hidden":["1.19"],"text":["1.19","9.11","57.8"],"然后再作为纹理":["1.20"],"texture":["1.20"],"上传到":["1.20"],"gpu":["1.20"],"只要该层的内容不发生改变":["1.20","6.14"],"就没必要进行重绘":["1.20","6.14"],"根据设置的left":["1.21"],"top等属性成固定位置的效果":["1.21"],"属性值有以下几个特点":["1.21"],"其实就是一个边距的区别":["1.22"],"按水平布局来说":["1.22"],"动画指定需要多少秒或毫秒完成":["1.23"],"设置动画将如何完成一个周期":["1.23"],"以圆形的方式显示":["1.24"],"css":["1.24"],"高度和垂直方向的外边距":["1.25"],"上下外边距":["1.25"],"只能设置水平方向的外边距和内边距":["1.25"],"可用于所有字句变成大写或小写字母":["1.26"],"或每个单词的首字母大写":["1.26"],"uppercase":["1.26"],"transform":["1.26","6.13"],"居中对齐弹性盒的各项":["1.27"],"元素":["1.27","27.51"],"count":["1.28"],"direction":["1.28","36.6"],"元素选择器和伪元素选择器的权重为1":["1.30","36.16"],"内容状态伪类选择器":["1.31"],"content":["1.31"],"state":["1.31"],"first":["1.31","1.32"],"child":["1.31","5.19","27.30"],"选择作为父元素的第一个子元素的元素":["1.31"],"在元素内容之后插入生成的内容":["1.32"],"利用盒模型的":["2.0"],"border":["2.0"],"份":["2.1"],"inline":["2.2"],"其":["2.2"],"和边框":["2.3"],"的大小":["2.3"],"不计算外边距":["2.3"],"而w3c盒模型把内边距边框放到外面相加":["2.4"],"默认值为content":["2.5"],"hidden隐藏一个dom节点":["2.6"],"只触发重绘":["2.6"],"因为没有几何变化":["2.6"],"因为":["2.7"],"格式具有更好的图像数据压缩算法":["2.7"],"能带来更小的图片体积":["2.7"],"而且拥有肉眼识别无差异的图像质量":["2.7"],"颜色":["2.8"],"新增":["2.8"],"rgba":["2.8"],"hsla":["2.8"],"模式":["2.8"],"渐变":["2.8"],"max":["2.9","48.10","54.2"],"inner":["2.10"],"浏览器端与服务器端通用的模块化开发规范":["3.1"],"导入其它模块成员使用":["3.2"],"import关键字":["3.2"],"否则会报错":["3.4"],"可以使用":["3.5"],"as":["3.5","25.13"],"绑定":["3.6"],"这个区域":["3.6"],"不再受外部作用域的影响":["3.6"],"ecmascript":["3.7"],"简称es6":["3.7"],"b":["3.8","13.5","14.1"],"箭头函数是在哪定义就指向谁":["3.9"],"普通函数可以当成构造函数":["3.9"],"export":["3.12"],"可以导出多个属性或者方法":["3.12"],"需要用":["3.12"],"函数与":["3.14"],"yield":["3.14"],"结合可以实现更简洁的异步编程":["3.14"],"迭代器":["3.14"],"返回的数组元素不是字符串":["4.0"],"而是实际的symbol值":["4.0"],"因此可以通过它引用到对象的该属性":["4.0"],"es6新增的reflect":["4.0"],"ownkeys":["4.0"],"方法可以遍历出所有的常规键名和symbol键名":["4.0"],"reflect":["4.0"],"文档结构":["5.1"],"化的表述":["5.1"],"也是一样的":["5.2"],"需要通过分词器先将字节流转换为一个个":["5.2"],"分为":["5.2"],"tag":["5.2"],"和文本":["5.2"],"上述":["5.2"],"代码通过词法分析生成的":["5.2"],"如下所示":["5.2"],"维护了一个token":["5.2"],"会阻止dom树的解析":["5.3"],"chrome":["5.4"],"浏览器预解析操作":["5.4"],"当渲染引擎收到字节流之后":["5.4"],"或":["5.5","9.31","10.4","15.2"],"的生成":["5.6"],"碰到js前先生成cssom在执行js然后继续构建dom":["5.6"],"渲染":["5.6"],"当有外部css和js引入时":["5.6"],"在接收到":["5.6"],"html":["5.6","5.7","5.10"],"数据之后的预解析过程中":["5.6"],"文档中的图片资源":["5.7"],"dom树构建完成":["5.8","11.49"],"domcontentloaded":["5.8"],"回流":["5.9","6.9"],"重排":["5.9","6.9"],"计算元素位置":["5.9"],"它不必等到整个":["5.10"],"这三个过程在实际进行的时候并不是完全独立的":["5.11"],"而是会有交叉":["5.11"],"解析越慢":["5.12"],"个":["5.13"],"节点就要从头到尾执行10遍":["5.13"],"到":["5.14"],"树上":["5.14"],"再进行后续操作":["5.14"],"避免大量无谓的计算量":["5.14"],"所以":["5.14"],"用":["5.14","9.8"],"树的差异":["5.15"],"src":["5.17"],"core":["5.17"],"window":["5.18","12.22"],"表示浏览器窗口":["5.18"],"提供了操作和访问浏览器窗口的方法和属性":["5.18"],"location":["5.18"],"创建一个包含指定文本内容的文本节点":["5.19"],"appendchild":["5.19","30.0","42.0"],"将一个节点添加为当前节点的子节点":["5.19"],"removechild":["5.19"],"title":["5.20"],"hasattribute":["5.21"],"获取元素相对于offsetparent元素的左边距的距离":["5.22"],"offsetwidth":["5.22"],"获取元素的可见宽度":["5.22"],"包括内容区域":["5.22"],"内边距和边框":["5.22"],"offsetheight":["5.22"],"获取元素的可见高度":["5.22"],"clientwidth":["5.22"],"获取元素的内部宽度":["5.22"],"每隔指定的时间间隔执行一次指定的函数":["5.24"],"cleartimeout":["5.24","38.1"],"timeoutid":["5.24"],"取消由":["5.24"],"获取当前窗口的视口宽度":["5.25"],"innerheight":["5.25"],"获取当前窗口的视口高度":["5.25"],"screen":["5.25"],"中发生的特定事件":["5.26"],"可以包含有关事件的信息和方法":["5.26"],"目标阶段":["5.27"],"at":["5.27"],"或冒泡阶段":["5.27"],"同时阻止调用其他的事件处理函数":["5.28"],"initevent":["5.28"],"type":["5.28","6.4","19.2","25.8","25.25","25.29"],"不同的版本之间格式书写上略有差异":["6.1"],"如果没有事先告诉浏览器":["6.1"],"那么浏览器就不知道文档解析标准是什么":["6.1"],"是标明重点内容":["6.2"],"有语气加强的含义":["6.2"],"使用阅读设备阅读网络时":["6.2"],"strong会重读":["6.2"],"总是在新行上开始":["6.3"],"就是每个块级元素独占一行":["6.3"],"默认从上到下排列":["6.3"],"宽度缺少时是它的容器的100":["6.3"],"除非设置一个宽度":["6.3"],"高度":["6.3"],"行高以及外边距和内边距都是可以设置的":["6.3"],"块级元素可以容纳其它行级元素和块级元素":["6.3"],"radio":["6.4"],"name":["6.4","23.4","38.4","44.2","59.3","59.4"],"sex":["6.4"],"id":["6.4","23.4"],"sms":["6.5"],"keywords这三个标签":["6.6"],"用javascript解决":["6.7"],"使用html5的shim框架":["6.7"],"在head标签中调用以下代码":["6.7"],"地理":["6.8"],"本地离线存储":["6.8"],"localstorage长期存储数据":["6.8"],"浏览器关闭后数据不丢失":["6.8"],"sessionstorage的数据在浏览器关闭后自动删除":["6.8"],"对渲染树进行reflow":["6.9"],"不占位置会忽略":["6.10"],"visiabllity":["6.10"],"当页面中的元素的大小或位置发生变化":["6.11"],"便会触发重排":["6.11"],"对于":["6.13"],"和":["6.13","6.18"],"opacity":["6.13"],"效果":["6.13"],"来计算":["6.14"],"使用固定定位或绝对定位":["6.15"],"将元素设置为position":["6.15"],"fixed或position":["6.15"],"absolute":["6.15"],"可以使元素创建为单独的合成层":["6.15"],"layer":["6.16"],"squashing":["6.16"],"的处理":["6.16"],"解决层爆炸的问题":["6.17"],"最佳方案是打破":["6.17"],"overlap":["6.17"],"span":["6.18"],"无法提供关于其内容的信息":["6.18"],"以及label标签的灵活运用":["6.19"],"便于团队开发和维护":["6.19"],"iframe元素的主要特点包括":["6.20"],"独立的文档流":["6.20"],"iframe元素中嵌入的文档与主文档是独立的":["6.20"],"seo是指为了从搜索引擎中获得更多的免费流量":["7.1"],"从网站结构":["7.1"],"提升页面关键词密度":["7.2"],"keywords里面把每个关键词用英文逗号隔开":["7.3"],"三到五个最佳":["7.3"],"通过站内的关键词链接指向网站内部的链接":["7.4"],"关键词占整篇文章的比重":["7.5"],"话术设置":["7.5"],"表现":["8.1"],"即指css样式表":["8.1"],"特殊符号用编码表示":["8.2"],"任何小于号":["8.2"],"不是标签的一部分":["8.2"],"都必须被编码为":["8.2"],"lt":["8.2"],"任何大于号":["8.2"],"提高用户的体验":["8.3"],"样式尽量少用行间样式表":["8.3"],"ok":["9.1","25.5","25.15"],"以及返回的内容":["9.1"],"收到用户的应答后":["9.2"],"便断开连接":["9.2"],"这种方式可以节省传输时间":["9.2"],"无状态":["9.2"],"ip协议不仅仅指的是tcp":["9.3"],"和ip两个协议":["9.3"],"而是指一个由ftp":["9.3"],"起始且默认使用端口80":["9.4"],"而https的url由":["9.4"],"https":["9.4","9.18"],"起始且默认使用端口443":["9.4"],"http是超文本传输协议":["9.4"],"来代替资源名称":["9.8"],"向":["9.8"],"web":["9.8"],"服务器发送":["9.8"],"可以测试服务器功能是否正常运作":["9.8"],"head":["9.8","49.5","49.7"],"所以没啥安全性可言":["9.9"],"get和post有一个重大区别":["9.9"],"简单的说":["9.9"],"get产生一个tcp数据包":["9.9"],"post产生两个tcp数据包":["9.9"],"没有数据量限制":["9.10"],"请求体":["9.11"],"响应体的类型":["9.11"],"plain":["9.11"],"application":["9.11"],"json":["9.11"],"x":["9.11","25.14"],"www":["9.11"],"form":["9.11"],"urlencoded":["9.11"],"accept":["9.11"],"说明接收的类型":["9.11"],"可以多个值":["9.11"],"形式进行存储":["9.12"],"多个请求参数之间用":["9.12"],"连接":["9.12","9.17"],"用于表示资源":["9.14"],"网页等":["9.14"],"被永久转移到其它":["9.14"],"未找到":["9.15"],"服务器找不到请求的网页":["9.15"],"方法禁用":["9.15"],"禁用请求中指定的方法":["9.15"],"不接受":["9.15"],"无法使用请求的内容特性响应请求的网页":["9.15"],"需要代理授权":["9.15"],"此状态代码与":["9.15"],"类似":["9.15"],"但指定请求者应当授权使用代理":["9.15"],"请求超时":["9.15"],"服务器等候请求时发生超时":["9.15"],"冲突":["9.15"],"服务器在完成请求时发生冲突":["9.15"],"tcp":["9.17"],"客户端向服务器发请求":["9.17"],"hsts":["9.18"],"强制客户端使用":["9.18"],"hosts":["9.19"],"文件里":["9.19"],"没有则向":["9.19"],"传输层":["9.20"],"传输报文":["9.20"],"第一次握手就是客户端给服务器端发送一个报文":["9.25"],"客户端的发送能力":["9.25"],"服务端的接收能力是正常的":["9.25"],"第二次就是服务器收到报文之后":["9.25"],"wait状态":["9.26"],"如果服务端也想断开连接了":["9.26"],"和客户端的第一次挥手一样":["9.26"],"发给":["9.26"],"有内网":["9.28"],"确保数据的完整性和顺序性":["9.29"],"不提供":["9.29"],"性保证":["9.29"],"它只是简单地将数据报发送出去":["9.29"],"不关心数据是否到达目的地":["9.29"],"效率":["9.29"],"由于":["9.29"],"需要维护连接状态和保证数据的可靠传输":["9.29"],"服务器无法识别出不同请求来自同一个客户端":["9.30"],"这意味着服务器不能基于之前的请求状态来处理当前的请求":["9.30"],"它使得服务器可以独立地处理每个请求":["9.30"],"url":["9.31"],"参数的方式发送给客户端":["9.31"],"并在后续的请求中":["9.31"],"或参数传递给服务器":["9.31"],"服务器根据":["9.31"],"识别用户":["9.31"],"并在服务器端存储和管理与该用户相关的状态信息":["9.31"],"线程":["9.32"],"thread":["9.32"],"dom":["10.1","26.8","27.51"],"型":["10.1"],"攻击通常发生在":["10.1"],"攻击者会通过修改":["10.1"],"页面的":["10.1"],"文档对象模型":["10.1"],"安全配置和管理":["10.2"],"web服务器和web应用程序必须采取安全的配置和管理策略":["10.2"],"以确保应用程序和服务器免受各种攻击":["10.2"],"这包括配置文件权限":["10.2"],"日志记录":["10.2"],"漏洞扫描和修复":["10.2"],"安全审计等方面":["10.2"],"应用程序中":["10.3"],"是一种攻击方式":["10.3","19.11"],"攻击者通过利用":["10.3"],"属性为":["10.4"],"strict":["10.4"],"httponly":["10.5"],"标记":["10.5"],"将敏感的":["10.5"],"cookie":["10.5"],"是一种加密协议":["10.6"],"用于在计算机网络上保证通信安全":["10.6"],"而私钥用于解密数据":["10.8"],"symbol":["11.1"],"null":["11.1","28.4","48.4","49.1","49.8"],"能区分是否是引用类型":["11.2"],"instanceof用于检测构造函数的":["11.2"],"funcntion":["11.3"],"new":["11.3","12.15","13.2","47.0"],"map":["11.3","11.73"],"weakset":["11.3"],"指的是在渲染该":["11.4"],"script":["11.4"],"的加载与执行并行进行":["11.5"],"异步":["11.5"],"下载时":["11.6"],"async是下载完后立即执行":["11.7"],"defer是在html解析完后再执行":["11.7"],"var声明变量时在闭包里不会提升":["11.8"],"以箭头函数调用时this指向当前实例":["11.9"],"执行第一个宏任务":["11.11"],"全局script脚本":["11.11"],"产生的的宏任务和微任务进入各自的队列中":["11.11"],"执行完script后":["11.11"],"setinterval":["11.12","36.14"],"node中的setimmediate":["11.12"],"等":["11.12","11.25","11.75"],"微任务比宏任务有更高优先级":["11.13"],"否则新入队的任务永远被放在队尾":["11.13"],"另外":["11.14"],"settimeout":["11.14","13.2","38.1"],"将函数插入到tick队列":["11.15","20.7"],"深拷贝采用了在堆内存中申请新的空间来存储数据":["11.18"],"只是拷贝了指针":["11.19"],"使得两个指针指向同一个地址":["11.19"],"浅拷贝":["11.20"],"不会影响":["11.20"],"并返回一个闭包函数":["11.21"],"console":["11.21","11.26","11.27","12.3","12.16","12.18","12.25","13.7","14.2","14.4","14.5","17.4","25.6","26.5","28.7","52.7","52.15","53.2","62.4","63.1"],"log":["11.21","11.26","11.27","12.3","12.12","12.16","12.25","13.7","14.4","14.5","17.4","25.6","26.5","28.7","52.15","53.2","62.4","63.1"],"输出25":["11.21"],"闭包可以像普通函数一样被调用和执行":["11.21"],"同时也可以访问其引用环境中的变量和参数":["11.21"],"回收那些不再使用的内存":["11.24"],"本质上是找到内存中可以释放的变量":["11.24"],"然后再进行释放回收内存":["11.24"],"参数":["11.25"],"其余情况都为false":["11.26"],"js":["11.26","19.2","23.7","26.7","27.27","28.14","28.20","57.2","57.3","57.4","57.6","59.7","60.1","60.2","61.1","61.2"],"in":["11.27"],"强转字符串优先调用tostring":["11.29"],"强转数字优先调用valueof":["11.29"],"引用数据类型":["11.30"],"指针存栈内存":["11.30"],"valueof":["11.33"],"null转数字为0":["11.34"],"undefined转数字为nan":["11.34"],"null是一个对象未初始化":["11.34"],"而null底层的二进制全都是0":["11.35"],"才能为true":["11.36"],"算术运算符":["11.37"],"关系运算符":["11.37","16.3"],"如果一个操作数是字符串":["11.38"],"另一个操作数是数值":["11.38"],"不等于":["11.39"],"左边为对象":["11.41"],"调用tostring转为":["11.41"],"需转二进制进行运算":["11.42"],"有些小数无法用二进制表示":["11.42"],"所以只能取近似值":["11.42"],"true":["11.45","12.7","12.14","12.21","29.3","50.1","50.2"],"var":["11.46","12.22"],"function":["11.46","13.5","25.15","27.20","28.27"],"并往下传播":["11.47"],"dom事件流":["11.47"],"是基于promise对xhr对象的封装":["11.48"],"fetch":["11.48"],"domcontentloaded触发":["11.49"],"节省性能":["11.52"],"子元素不需要每个都去绑定同一事件":["11.52"],"push":["11.53","25.3","36.0","54.3"],"将当前元素添加到新数组中":["11.53"],"return":["11.53","12.30","12.31","13.5","27.33","28.7","28.8","28.15","44.4","46.2","48.12","48.15","52.4","52.5","52.9","52.14"],"reduce方法中必须要return":["11.53"],"nan为假值":["11.54"],"转布尔值为false":["11.54"],"arr1":["11.57"],"arr2":["11.57"],"arr3":["11.57","53.2"],"连接数组":["11.57"],"arr":["11.57","52.6","52.8"],"round":["11.58"],"小数四舍五入":["11.58"],"prompt":["11.59"],"n":["11.60"],"decodeuri":["11.61"],"函数用于解码js中的url":["11.61"],"它将编码的url字符串作为参数并返回已解码的字符串":["11.61"],"获取域名和端口":["11.62"],"hostname":["11.62"],"获取主机名":["11.62"],"port":["11.62"],"获取端口号":["11.62"],"browser":["11.63"],"对象来访问":["11.63"],"控制":["11.63"],"修改客户端":["11.63"],"s":["11.65","11.66","47.0"],"hello":["11.65","11.66","25.5","25.10"],"指令的目的是强制执行严格模式下的代码":["11.67"],"用来声明允许用户输入数据的":["11.68"],"遍历字符串的索引":["11.72"],"set":["11.73","12.4","14.7","27.16","28.8","28.15","28.28"],"一组不重复的值的集合":["11.73"],"一组键值对的集合":["11.73"],"类数组对象":["11.73"],"arguments":["11.73"],"对象":["11.73","13.1","23.3","40.1"],"generator":["11.73"],"即":["11.74","25.32"],"this":["11.74","27.33","46.6","48.4","48.13","48.15"],"关键字的指向":["11.74"],"按下的键的标识符":["11.75"],"如":["11.75","19.9"],"enter":["11.75"],"arrowup":["11.75"],"类型的实例":["12.1"],"它们都会从":["12.1"],"wrapper":["12.2"],"expected":["12.3","12.19"],"output":["12.3","12.19"],"matthew":["12.4"],"property":["12.4","28.7"],"on":["12.4"],"或者修改一个对象的现有属性":["12.5"],"writable":["12.6","12.7"],"false":["12.6","12.21","12.25","48.12"],"不可写":["12.6"],"key":["12.8","14.9","14.10","48.7","62.10"],"value":["12.8","13.8","28.13","28.32","28.33"],"of":["12.8","12.13","14.10","25.32"],"可配置性":["12.9"],"可写性":["12.9"],"obj":["12.10"],"指定对象的原型":["12.11"],"内部":["12.11"],"the":["12.13"],"to":["12.13","25.32","27.41"],"prototypal":["12.13"],"const":["12.15","26.11","28.13","38.4","41.0","47.0","52.22","52.23"],"auto":["12.15"],"值作为名称的属性":["12.17"],"组成的数组":["12.17"],"objectsymbols":["12.18"],"或都是":["12.21"],"都是相同长度":["12.21"],"相同字符":["12.21"],"undefined":["12.22","38.5","52.16"],"是否可以在它上面添加新的属性":["12.23"],"方法判断一个对象是否被冻结":["12.24"],"an":["12.26"],"也就是永远不能再添加新的属性":["12.27"],"表示指定的属性是否可枚举":["12.28"],"阻止添加新属性并将所有现有属性标记为不可配置":["12.29"],"gabby":["12.30"],"dogtostring":["12.30"],"成功回调":["13.0"],"失败回调":["13.0"],"方法返回的是":["13.1"],"使用catch":["13.1"],"相当于给前面一个then方法返回的promise":["13.1"],"注册回调":["13.1"],"可以捕获到前面then没有被处理的异常":["13.1"],"如果是promise内部报错":["13.1"],"reject抛出错误后":["13.1"],"then的第二个参数就能捕获得到":["13.1"],"resolve":["13.2","63.2"],"失败":["13.2"],"3s后":["13.3"],"对象原型":["13.4"],"proto":["13.4"],"sum":["13.5"],"if":["13.5","28.15","28.19","28.22","29.0","36.0","38.2","45.1","45.5","49.6","54.4"],"typeof":["13.5"],"number":["13.5","25.8"],"status":["13.8"],"rejected":["13.8"],"reason":["13.8"],"fulfilled":["13.8","36.13"],"该方法会在":["13.8"],"所有的promise都有结果":["13.8"],"无论是fulfilled":["13.8"],"还是rejected":["13.8"],"才会有最终的结果":["13.8"],"如果其中一个promise没有结果":["13.8"],"被放进微任务队列中了":["13.10"],"add":["14.1","14.3"],"o":["14.7"],"p":["14.7","25.23"],"haha":["14.7"],"通过键":["14.8"],"从字典中移除对应的数据":["14.8"],"for":["14.9","46.3","47.0","52.22","52.23"],"keys":["14.10","17.1"],"得到的也是一个空对象":["15.1"],"在浏览器环境下":["15.1"],"指向的是":["15.1"],"的值就是该对象":["15.2"],"如果使用":["15.2"],"call":["15.2","15.3","28.4"],"apply":["15.2","15.3"],"方法调用函数":["15.2"],"的值就是传入的第一个参数":["15.2"],"bind改变this":["15.3"],"obj1":["15.3"],"林三心":["15.3"],"不同":["16.1"],"乘法运算符":["16.3"],"加法运算符":["16.3"],"findindex":["17.1"],"找到符合条件的第一个数的索引":["17.1"],"indexof":["17.1"],"返回某个元素第一个索引如果没有则返回":["17.1"],"lastindexof":["17.1"],"返回某个元素最后一个索引如果没有则返回":["17.1"],"includes":["17.1","36.0"],"判断是否包含某个元素返回true或false":["17.1"],"返回数组索引的":["17.1"],"表示匹配小写字母a到z中的任何一个字符":["18.0"],"匹配重复字符":["18.0"],"用星号":["18.0"],"表示前一个字符可以重复零次或多次":["18.0"],"用加号":["18.0"],"表示前一个字符可以重复一次或多次":["18.0"],"用问号":["18.0"],"表示前一个字符可以重复零次或一次":["18.0"],"component注册组件":["19.1"],"在通过export导出":["19.1"],"进行类型的切换":["19.2"],"的值发生变化时":["19.2"],"vue":["19.2","27.22","28.4","28.16"],"的响应式更新是异步的":["19.2"],"尚未对模板进行重新渲染":["19.2"],"因此":["19.2"],"的初始类型仍然是":["19.2"],"gulp":["19.3"],"可以用series规定执行顺序":["19.4"],"在js的基础上声明了变量":["19.5"],"和一个timeout":["19.6"],"和getters":["19.7"],"设置了允许跨域的响应头":["19.8"],"通过清晰的接口定义和规范化的开发流程":["19.9"],"减少代码冲突和问题":["19.9"],"跨平台开发":["19.9"],"前后端分离可以为不同的客户端提供服务":["19.9"],"3是http协议的下一代版本":["19.10"],"目前还处于实验阶段":["19.10"],"预计基于quic":["19.10"],"quick":["19.10"],"udp":["19.10"],"攻击者试图在通信双方之间插入自己以截获":["19.11"],"篡改或窃取通信内容":["19.11"],"指示客户端在每次请求时都必须向服务器验证资源的有效性":["19.12"],"但仍然可以缓存资源文件":["19.12"],"store":["19.12","27.49"],"指示客户端不应缓存资源文件":["19.12"],"face规则":["19.13"],"提前加载字体文件":["19.13"],"确保字体在应用前已经准备就绪":["19.13"],"使用占位符":["19.13"],"在资源加载完成之前":["19.13"],"根据网络速度和设备性能动态调整视频质量":["19.14"],"缓存策略":["19.14"],"使用浏览器缓存":["19.14"],"设置合适的缓存头部":["19.14"],"利用浏览器缓存来存储静态资源":["19.14"],"减少重复请求":["19.14"],"数据缓存":["19.14"],"合理缓存数据":["19.14"],"更可编程和更现代化的图形处理能力":["19.15"],"pnpm使用一种称为":["19.16"],"锁定文件链接":["19.16"],"的机制":["19.16"],"lerna":["19.17"],"简称":["20.1"],"esm":["20.1"],"另一种是":["20.1"],"是同步加载":["20.2"],"后面的代码必须等待这个命令执行完":["20.2"],"才会执行":["20.2"],"就认为它是":["20.3"],"模块":["20.3"],"默认启用严格模式":["20.3"],"模块的输出接口是module":["20.4"],"exports":["20.4"],"是一个对象":["20.4"],"无法被静态分析":["20.4"],"所以只能整体加载":["20.4"],"上面代码指定require":["20.5"],"和import":["20.5"],"加载该模块会自动切换到不一样的入口文件":["20.5"],"总结为一句话":["20.5"],"如果是相对路径则自动转为绝对路径":["20.8"],"sessionstorage的有效期是仅保持在当前页面":["21.1"],"关闭当前会话页或者浏览器后就会失效":["21.1"],"localstorage和sessionstorage的存储容量是5mb":["21.2"],"读取":["21.4"],"let":["21.4","25.23","28.20","44.5","44.6","47.1","49.4"],"data":["21.4"],"getitem":["21.4"],"清除":["21.4"],"removeitem":["21.4"],"localstorage和sessionstorage出现的时间较晚":["21.5"],"当第一次登录后":["21.7"],"客户端收到token后把它存储起来":["21.8"],"可以放在cookie或者local":["21.8"],"storage":["21.8"],"本地存储":["21.8"],"里":["21.8"],"存cookie里":["21.9"],"过期时间":["21.10"],"expires":["21.10"],"cookie的过期时间":["21.10"],"如果不设置":["21.10"],"则在":["21.10"],"浏览器关闭时失效":["21.10"],"直接用esm方式来运行项目":["22.0"],"preview":["22.1"],"defineconfig":["22.3"],"在项目中创建src目录":["23.0"],"写代码默认":["23.0"],"index":["23.0","26.7","49.4","49.7","49.8","52.4","52.5","52.9","52.14"],"里写多个入口":["23.3"],"hash":["23.4","26.4"],"支持链式调用":["23.5"],"链中的每个":["23.5"],"use":["23.6","55.2","56.2","59.2"],"loader":["23.6","23.7"],"babel":["23.6"],"无法实现的其他事":["23.7"],"plugins":["23.7"],"实时自动刷新":["23.8"],"让调试和错误定位边的非常困难":["23.9"],"源代码映射":["23.9"],"pack":["24.0"],"vuerouter的懒加载":["24.0"],"扩展运算符":["24.0"],"也可以存储字符串类型的数据":["25.1"],"定义指定对象成员的数组":["25.1"],"剩余参数":["25.3"],"array":["25.3","27.22","53.7"],"值得注意的是":["25.7"],"方法没有返回值将得到undefined":["25.7"],"但是我们需要定义成void类型":["25.7"],"而不是undefined类型":["25.7"],"否则将报错":["25.7"],"类型的特性来实现全面性检查":["25.8"],"具体示例如下":["25.8"],"foo":["25.8","29.3"],"controlflowanalysiswithnever":["25.8"],"类型":["25.9","25.17"],"这种机制起到了很强的预防性":["25.10"],"更安全":["25.10"],"这就要求我们必须缩小类型":["25.10"],"我们可以使用typeof":["25.10"],"类型断言等方式来缩小未知范围":["25.10"],"空对象类型和大":["25.11"],"一样":["25.11"],"也是表示原始类型和非原始类型的集合":["25.11"],"并且在严格模式下":["25.11"],"具有初始化值的变量":["25.12"],"有默认值的函数参数":["25.12"],"将从":["25.14"],"is":["25.16","25.32"],"string":["25.16"],"这里表示一个字符串字面量类型":["25.17"],"的父类型":["25.17"],"implement":["25.18"],"typescript":["25.18"],"中的接口是一个非常灵活的概念":["25.18"],"ro":["25.19"],"确定属性和可选属性的类型都必须是它的类型的子集":["25.20"],"有时和":["25.24"],"很像":["25.24"],"void":["25.25"],"union联合":["25.26"],"partialpoint":["25.26"],"y":["25.27"],"接口扩展类别名":["25.28"],"在定义泛型时通常用作第一个类型变量名称":["25.29"],"但实际上":["25.29"],"可以用任何有效名称代替":["25.29"],"trace":["25.30"],"gender":["25.32"],"报错":["25.32"],"argument":["25.32"],"not":["25.32"],"assignable":["25.32"],"parameter":["25.32"],"首先看泛型":["25.32"],"这里有t和k两种类型":["25.32"],"根据类型推断":["25.32"],"第一个参数person就是person":["25.32"],"类型会被推断为person":["25.32"],"而第二个数组参数的类型推断":["25.32"],"keyof关键字可以获取t":["25.32"],"也就是person的所有属性名":["25.32"],"而extends关键字让泛型k继承了person的所有属性名":["25.32"],"所以当用户刷新页面时会向服务器发请求导致请求资源为404":["26.2"],"因此需要对nginx进行一个配置":["26.2"],"需要把所有路由都重定向到根页面":["26.2"],"router就会依据路由表当中声明了的路由对应匹配的组件":["26.3"],"值变化不会导致浏览器向服务器发出请求":["26.4"],"模式是用":["26.4"],"popstate":["26.5"],"replace":["26.6"],"用于执行一些异步操作":["26.7"],"比如向服务器发送数据":["26.7"],"埋点等":["26.7"],"beforeenter":["26.7"],"一般配置在路由配置文件中":["26.7"],"router":["26.7"],"对进入某个路由之前进行相关操作":["26.7"],"导航被确认":["26.8"],"aftereach":["26.8"],"钩子":["26.8"],"触发":["26.8"],"即在需要的时候的时候进行加载":["26.9"],"也就是":["26.9"],"被作为分离的模块起点":["26.10"],"意思是":["26.10"],"views":["26.11"],"替换成":["26.11"],"并且它可以在路由地址和导航守卫上都被访问到":["26.12"],"然后在接下来的":["26.13"],"组件生命周期钩子中获取数据":["26.13"],"在数据获取期间显示":["26.13"],"的查询字符串传递的键值对":["26.14"],"路由对象参数":["26.14"],"路由":["27.1"],"只在第一次加载页面时":["27.2"],"dom挂载完成调用":["27.3","34.0"],"beforeupdate":["27.3","34.0"],"onbeforeupdate":["27.3","27.5","34.0"],"数据更新之前被调用":["27.3"],"updated":["27.3","27.5"],"setup执行时机在组件实例创建之前":["27.4"],"内存中的数据已经改变":["27.5"],"页面上的还没更新":["27.5"],"对组件的编辑次数":["27.5"],"甚至跟踪创建撤销功能的操作很有用":["27.5"],"父beforeupdate":["27.6"],"子beforeupdate":["27.6"],"子updated":["27.6"],"一般在频繁切换状态的地方使用v":["27.8"],"所以这样就会导致无论需不需展示这个元素":["27.9"],"都会先遍历整个列表":["27.9"],"页面多次使用addsum":["27.10"],"但是只会打印一次":["27.10"],"内部逻辑执行":["27.10"],"的依赖追踪机制为基础":["27.12"],"当某个依赖数据发生变化时":["27.12"],"被观察者":["27.13"],"其内部监听的对象必须是已经定义响应式的属性":["27.14"],"比如":["27.14"],"在前":["27.15"],"将render":["27.15"],"中":["27.16"],"计算属性工作是做依赖收集":["27.16"],"watch":["27.17"],"而":["27.17","28.26"],"当回调函数里面的响应数据发生变化":["27.18"],"回调函数就会立即执行":["27.18"],"watcheffect只能看到新值看不到旧值":["27.18"],"vue2将响应式数据放到data函数中":["27.19"],"而vue3则是使用ref和reactive将数据声明为响应式":["27.19"],"响应式实现方式":["27.19"],"这个虚拟dom树会在后续的渲染过程中用于高效地更新实际的dom":["27.20"],"解析和渲染模板":["27.20"],"如果组件配置中包含模板":["27.20"],"vue会将模板解析为渲染函数":["27.20"],"render":["27.20"],"或渲染器":["27.20"],"当访问或修改这些属性时":["27.21"],"可以捕捉到":["27.21"],"并执行相应的逻辑":["27.21"],"prototype方法的修改":["27.22"],"或者app":["27.23"],"具名插槽内容":["27.24"],"在slot标签绑定属性从而传递给父组件中的插槽内容":["27.24"],"首先来看下默认插槽的传值方式":["27.24"],"作用域slot":["27.25"],"scope":["27.25"],"v":["27.25","27.30","57.8"],"slot":["27.25"],"子组件访问父组件":["27.25","34.4"],"这允许我们通过ref来访问和操作dom元素":["27.29"],"例如修改样式":["27.29"],"添加事件监听器或执行其他dom操作":["27.29"],"父":["27.30"],"template":["27.30"],"vuex除了上面三个概念还有getters":["27.31"],"moudles":["27.31"],"getters就像vue中的计算属性computed一样用来描述依赖响应式状态state中的复杂逻辑":["27.31"],"moudles则是可以将store分割成模块":["27.31"],"module":["27.31"],"getters":["27.32"],"changenames":["27.32"],"states":["27.33"],"孙悟空":["27.33"],"usercomputed":["27.33"],"它接收组件的名字数组":["27.35"],"字符串或者正则":["27.35"],"当我们使用动态组件component或者路由router":["27.35"],"view的时候可以使用":["27.35"],"beforemount":["27.36"],"和destroyed":["27.37"],"组件销毁":["27.37"],"哪个组件需要用到时":["27.38"],"直接将提取的这部分混入到组件内部即可":["27.38"],"mixin的生命周期会在父组件生命周期之前执行":["27.38"],"的代理行为是在破坏原对象的基础上实现的":["27.39"],"popup":["27.41"],"fallback":["27.42"],"在初始渲染时":["27.42"],"而是把需要更新的watcher加入到queuewatcher队列中":["27.44"],"然后在合适的时机在nexttick中调用这些watcher的更新函数进行dom更新":["27.44"],"然后使用虚拟节点树进行渲染":["27.46"],"当某些状态发生变更时会生成新的虚拟dom节点树":["27.46"],"时间复杂度太高":["27.47"],"因此前端框架规定了只做同层":["27.47"],"还有":["27.47"],"双端比较":["27.48"],"的策略":["27.48"],"同时从新旧虚拟dom树的头部和尾部开始比较子节点":["27.48"],"以尽可能地复用已有的dom节点":["27.48"],"递归处理子节点":["27.48"],"继续递归地应用diff算法":["27.48"],"children":["27.49","34.4"],"meal":["27.49"],"self":["27.50"],"用于在下次":["27.51"],"更新循环结束后执行回调函数":["27.51"],"如果在修改数据后立即访问更新后的":["27.51"],"for不写key默认是index":["27.52"],"index的效率低":["27.52"],"fallback是占位符":["27.53"],"当异步组件一些耗时的任务是":["27.53"],"ref需要用value读取更新值":["27.54"],"子":["27.55"],"观察者":["28.2"],"observer":["28.2"],"channel":["28.3"],"订阅者":["28.3","28.5"],"发布订阅模式":["28.3","28.24"],"将依赖收集的目标对象设置成自身":["28.4"],"绑定当前":["28.4"],"实例进行一次函数执行":["28.4"],"在运行过程中收集函数中用到的数据":["28.4"],"此时会在所有用到数据的":["28.4"],"依赖管理中插入该观察者实例":["28.4"],"函数执行完毕后将依赖收集目标清空":["28.4"],"避免重复收集":["28.4"],"依赖收集器":["28.5"],"depend":["28.8","28.15"],"如果value是对象":["28.9"],"递归调用observe来监测该对象":["28.9"],"如果value不是对象":["28.9"],"observe函数会直接返回":["28.9"],"创建了arraymothods的对象以object":["28.10"],"巧妙之处":["28.11"],"watcher设置在全局中读取数据":["28.11"],"因为读取了数据":["28.11"],"所以触发getter方法":["28.11"],"通知组件":["28.12"],"通过虚拟dom和diff算法进行页面更新":["28.12"],"初始化watcher实例时订阅数据":["28.13"],"get":["28.13","28.22","28.34"],"一个属性可能有多个依赖":["28.14"],"每个响应式数据都有一个dep来管理它的依赖":["28.14"],"要通知到的地方":["28.14"],"依赖":["28.14"],"constructor":["28.14"],"本次新增":["28.15"],"newval":["28.15"],"的局限性":["28.16"],"采用了全新的":["28.16"],"deleteproperty":["28.17"],"方法会调用":["28.18"],"track":["28.18"],"进行依赖收集":["28.18"],"isobject":["28.19"],"如果当前获取的属性值是一个对象":["28.19"],"则继续将为此对象创建":["28.19"],"代理":["28.19"],"方法":["28.20"],"has":["28.21"],"副作用是一个函数包裹器":["28.23"],"在函数被调用前就启动跟踪":["28.23"],"只能针对对象的已知属性进行读取和更新的操作拦截":["28.24"],"都是通过":["28.24"],"unwrapref":["28.25"],"interface":["28.25"],"其实也会通过":["28.26"],"reactive":["28.26","41.0"],"方法进行深层数据处理":["28.26"],"与":["28.26"],"readonly":["28.26"],"则比较相似":["28.26"],"effect":["28.27"],"fn":["28.27"],"dep":["28.29"],"proxy的get对应reflect":["28.34"],"自动聚焦的指令":["29.2"],"directive":["29.2"],"如果有的话":["29.3"],"参数是":["29.3"],"modifiers":["29.3"],"一个包含修饰符的对象":["29.3"],"bar":["29.3"],"修饰符对象是":["29.3"],"则指令将会被忽略且抛出一个警告":["29.4"],"组件的一个根结点就是在一个":["29.4"],"vdebounce":["29.6"],"指令地址":["29.6"],"body":["30.0","42.0"],"这可以通过提供组件属性":["33.0"],"props":["33.0"],"主题配置":["33.0"],"样式覆盖或插槽等方式来实现":["33.0"],"放弃目标版本之后的提交":["33.2"],"8d":["33.3"],"ba":["33.3"],"bc":["33.3"],"8f":["33.3"],"那样对整个项目进行重新构建":["33.5"],"请求的选项中的":["33.6"],"c":["33.7"],"d":["33.7"],"onmounted":["34.0"],"在created时":["34.1"],"data必须是一个函数且返回一个对象":["34.2"],"parent":["34.4","48.14"],"父组件访问子组件":["34.4"],"getter":["34.5"],"获取器":["34.5"],"用于从":["34.5"],"用this获取数据":["34.6"],"在":["34.6"],"才会重新计算":["34.7"],"使用includes":["36.0"],"遍历数组":["36.0"],"返回值不同":["36.2"],"watch的回调函数接收两个参数":["36.2"],"新值和旧值":["36.2"],"没有返回值":["36.2"],"这对于需要监听嵌套对象或数组的变化非常有用":["36.3"],"异步操作":["36.3"],"由于watch是在数据变化后立即执行的":["36.3"],"可以利用它来处理异步操作":["36.3"],"例如":["36.3"],"justify":["36.6"],"不保留原有的空间占位":["36.10"],"fixed":["36.10"],"元素的定位相对于浏览器窗口进行定位":["36.10"],"即使页面滚动":["36.10"],"元素仍然固定在相同的位置":["36.10"],"将数据传递给子组件":["36.11"],"但子组件不能直接修改父组件的数据":["36.11"],"并发和并行执行异步操作使得在同一时间可以执行多个操作":["36.12"],"从而实现并发和并行处理":["36.12"],"pending":["36.13"],"进行中":["36.13"],"已完成":["36.13"],"存储异步任务的队列":["36.14"],"常见的有宏任务队列如settimeout":["36.14"],"dom事件":["36.14"],"一定事件循环周期内":["36.15"],"date":["38.2"],"now":["38.2"],"john":["38.4","44.2"],"age":["38.4","44.1","44.6"],"等特殊类型的对象":["38.5"],"如果对象中存在循环引用":["38.5"],"catch":["39.0"],"error":["39.0"],"else":["39.0","48.12","48.15","49.4","49.8","53.6"],"length":["40.0","46.1","46.7","49.6","53.4"],"将每个元素都转换为":["40.1"],"foreach":["41.0"],"handler":["41.0"],"receiver":["41.0"],"john3":["44.5"],"j":["45.2","45.3","45.4"],"开始依次与之前的元素比较":["45.3"],"while":["45.3","49.3"],"temp":["45.4"],"i":["45.5","46.3","46.5","46.7","47.0"],"不修改则插入":["46.2"],"splice":["46.4","50.1","50.2"],"isprime":["46.6"],"bucket":["46.7"],"floor":["47.1"],"bin":["47.1"],"满足以下性质":["48.1"],"非空左子树的所有键值小于其根结点的键值":["48.1"],"我们可以做什么事情呢":["48.2"],"通过先序遍历方式遍历所有结点":["48.3"],"postordertraverse":["48.3"],"通过后序遍历方式遍历所有结点":["48.3"],"root":["48.4","48.13"],"node":["48.4"],"向左查找":["48.5"],"处理经过节点的左子节点":["48.7"],"处理左子树中的节点":["48.8"],"处理右子树中的节点":["48.9"],"while循环":["48.11"],"isleftchild":["48.14"],"情况3":["48.15","48.16"],"非叶子结点":["48.15"],"有两个节点":["48.15"],"递归删除函数":["48.15"],"next":["49.1","49.8"],"current":["49.2","49.4","49.5"],"当current":["49.2"],"next不为空时":["49.2"],"情况二":["49.4"],"previous":["49.8"],"remove":["49.11","49.12"],"break":["50.1","50.2"],"isempty":["51.1"],"dequeue":["51.2"],"result6":["52.1"],"result7":["52.2"],"result8":["52.3"],"item":["52.4","52.5","52.9","52.14"],"填充一个数组到最后":["52.13"],"然后展平":["52.13"],"的空数组":["52.16"],"这意味着一个由":["52.16"],"个空槽组成的数组":["52.16"],"而不是具有实际":["52.16"],"result20":["52.19"],"result22":["52.22"],"result24":["52.23"],"f":["52.24"],"result25":["52.24"],"result28":["52.26"],"result32":["52.29"],"infinity":["53.1"],"concat":["53.5","53.7"],"isarray":["53.7"],"math":["54.2"],"cur":["54.4","54.5"],"reduce":["54.5"],"pre":["54.5"],"在组件内挂载之后只需要引用下面这行代码":["55.3"],"你就可以看到流光按钮啦":["55.3"],"选择大小":["56.1"],"size":["56.1"],"mount":["56.2"],"l":["56.3"],"button":["56.3"],"刷新":["56.8"],"success":["56.8"],"br":["57.7"],"model":["57.8"],"saoyisao":["59.1"],"shibai":["59.1"],"shengyinguanbi":["59.1"],"shangchuan":["59.1"],"shezhi":["59.1"],"选择你想要的图标":["59.3"],"apple":["59.4"],"line":["59.5"],"color":["59.5"],"适合多列等高布局":["62.2"],"设置宽度":["62.2"],"都不起作用":["62.2"],"td标签":["62.2"],"td":["62.2"],"tel":["62.5"],"服务器目前从不同位置的网页响应请求":["62.6"],"unshift":["62.7"],"reverse":["62.7"],"区域内的部分显示":["62.8"],"可以转换为字符串类型":["62.12"],"var没有":["62.13"],"块级作用域输出3":["62.13"],"box":["62.14"],"transition":["62.14"],"触发inpute事件":["62.15"],"使用浮动时先写left再写right再写中间的":["62.18"],"待更新":["66.0"],"鹏之徙于南冥也":["66.0"],"组件库":["67.0"]},{"0":["17.4","25.19","36.0","45.3","45.4","54.1"],"1":["11.65","11.66","28.2","28.21"],"2":["1.6","1.7","1.8","1.9","1.20","1.21","3.8","5.2","6.16","6.18","12.18","12.22","19.1","19.17","26.13","27.18","28.17","29.2","47.0","48.1","52.9"],"3":["0.4","3.2","5.15","6.11","6.15","7.2","8.1","9.4","9.18","9.19","9.20","11.11","11.13","11.37","13.1","15.2","21.1","27.15","27.29","27.35","27.38","28.34","36.13","47.0","48.7","48.8","48.9"],"4":["1.31","2.7","3.5","3.9","6.13","6.15","9.26","11.38","11.41","11.72","18.0","21.4","23.0","23.4","26.6","26.14","27.12","27.19","27.32","27.35","27.39","28.18","33.1","33.5","36.12","36.14"],"5":["2.10","5.8","5.9","6.9","6.14","6.19","7.5","9.17","11.29","11.49","13.8","13.10","17.1","21.8","28.11","29.3","33.0","33.7","34.5","36.3","36.10","52.4","52.5","52.14"],"6":["4.0","14.5","27.1","29.3","33.7","53.0","54.0"],"7":["11.75","19.2","25.32","53.0","54.0"],"8":["19.2","52.11","52.20","52.28","52.31"],"9":["16.3","52.11","52.17","52.19","52.20","52.27","52.28","52.31"],"10":["9.15","25.15","52.8","52.11","52.12","52.20","52.27","52.28","52.31","52.32"],"11":["9.15"],"12":["9.15","25.19","26.8"],"13":["9.15"],"14":["9.15"],"18":["27.24"],"20":["44.2"],"25":["25.23","46.4"],"37":["46.1"],"77":["12.6"],"86":["33.3"],"90":["33.3"],"100":["13.5"],"401":["0.8"],"410":["9.15"],"411":["9.15"],"412":["9.15"],"413":["9.15"],"414":["9.15"],"456":["62.10"],"1998":["12.15"],"3000":["13.2"],"8080":["0.5"],"x":["0.1","9.5","11.57","25.10"],"return":["0.2","12.13","28.13","28.22","49.9","52.29","54.3","54.5"],"else":["0.2","11.50","11.51","13.5","45.5","48.13","53.5","54.4"],"throw":["0.2"],"error":["0.2","12.6","25.21"],"重新then":["0.2"],"读取数据":["0.2"],"对象转字符串":["0.3"],"post传输文件大理论没有限制":["0.4"],"get传输文件小大概7":["0.4"],"8k":["0.4"],"端口号不同":["0.5"],"代理":["0.6"],"代理是一种常用的解决跨域请求的方法":["0.6"],"它通过在服务器端设置一个代理":["0.6"],"将客户端请求发送给目标服务器":["0.6"],"并将响应返回给客户端":["0.6"],"客户端只与代理服务器交互":["0.6"],"而代理服务器则与目标服务器交互":["0.6"],"代理服务器是一种位于客户端和目标服务器之间的中间层服务器":["0.6"],"当客户端请求目标服务器的资源时":["0.6"],"请求会先发送到代理服务器":["0.6"],"代理服务器再将请求发送到目标服务器":["0.6"],"然后将响应返回给客户端":["0.6"],"通过这种方式":["0.6"],"代理服务器可以绕过浏览器的同源策略限制":["0.6"],"从而实现跨域请求":["0.6"],"websocket":["0.6"],"websocket是html5中引入的一种双向通信协议":["0.6"],"它支持跨域请求":["0.6"],"status":["0.8"],"retry":["0.8"],"true":["0.8","11.26","12.4","12.16","12.20","14.3","49.9"],"发送请求以刷新token":["0.8"],"tokenrefreshrequest":["0.8"],"post":["0.8"],"refresh":["0.8"],"then":["0.8","11.12","13.2","13.9","40.1"],"如果刷新token成功":["0.8"],"更新本地存储或全局状态管理中的token值":["0.8"],"绝对定位配合transform实现":["1.1"],"推荐":["1.1"],"触发合成层优化性能":["1.1"],"浮动元素":["1.2"],"使用父元素设置":["1.2"],"overflow":["1.2"],"caption":["1.3"],"flex":["1.3"],"inline":["1.3"],"指定了对应元素的收缩规则":["1.5"],"只有在所有元素的默认宽度之和大于容器宽度时才会触发":["1.5"],"basis为0":["1.6","1.8"],"auto是根据内容的大小来分":["1.7"],"basis为auto":["1.9"],"content":["1.11","14.7","36.6"],"9999px":["1.12"],"超大负边距会将元素抛出视图":["1.12"],"因为定位本身脱离了文档流所以不占据空间":["1.12"],"translate":["1.12"],"区域外会隐藏":["1.13"],"具体的大小需要相对于父元素计算":["1.14"],"比如父元素的字体大小为80px":["1.14"],"height":["1.15","1.16"],"宽度为10倍基准字体大小":["1.16"],"5rem":["1.16"],"高度为5倍基准字体大小":["1.16"],"如果一条轴线排不下":["1.17"],"如何换行":["1.17"],"flow属性是flex":["1.17"],"direction属性和flex":["1.17"],"wrap属性的简写形式":["1.17"],"行":["1.18"],"和":["1.18","27.32"],"ellipsis":["1.19"],"repaint":["1.20","6.14"],"left属于布局属性":["1.20"],"该属性的变化会导致重排":["1.20"],"该元素并不脱离文档流":["1.21"],"仍然保留元素原本在文档流中的位置":["1.21"],"当元素在容器中被滚动超过指定的偏移值时":["1.21"],"元素在容器内固定在指定位置":["1.21"],"between是两端对齐":["1.22"],"在左右两侧没有边距":["1.22"],"而space":["1.22"],"设置动画在启动前的延迟间隔":["1.23"],"iteration":["1.23"],"count":["1.23","46.2","46.4"],"定义动画的播放次数":["1.23"],"img":["1.24"],"它们一般用于包裹文本或者嵌套在块级元素中":["1.25"],"默认样式":["1.25"],"lowercase":["1.26"],"self":["1.27"],"属性定义flex子项单独在侧轴":["1.27"],"纵轴":["1.27"],"方向上的对齐方式":["1.27"],"fill":["1.28"],"mode":["1.28"],"last":["1.31"],"选择作为父元素的最后一个子元素的元素":["1.31"],"nth":["1.31"],"n":["1.31"],"选择作为父元素的第n个子元素的元素":["1.31"],"表单伪类选择器":["1.31"],"form":["1.31","6.18"],"line":["1.32","59.4"],"选择元素的第一行":["1.32"],"属性上下左右边框交界处会呈现出平滑的斜线这个特点":["2.0"],"margin":["2.1"],"或者":["2.1"],"auto":["2.2"],"居中方式失效":["2.2"],"给父级添加":["2.2"],"而ie盒模型的大小计算方式是":["2.3"],"元素的内容区域":["2.3"],"不计算外边距":["2.4"],"表示使用标准盒模型":["2.5"],"移动或者给页面中的dom节点添加动画":["2.6"],"添加一个样式表":["2.6"],"调整样式属性":["2.6"],"缺点就是兼容性并不好":["2.7"],"小图使用":["2.7"],"png":["2.7"],"线性渐变":["2.8"],"径向渐变":["2.8"],"字体":["2.8"],"font":["2.8","6.8"],"face":["2.8"],"2d":["2.8"],"600px":["2.9"],"body":["2.9"],"background":["2.9"],"定位position":["2.10"],"利用绝对定位的方式":["2.10"],"好处":["2.10"],"这种实现方式的三栏html结构可以任意摆放":["2.10"],"不用考虑先后次序":["2.10"],"absolute":["2.10"],"直接导入并执行模块中的代码":["3.3"],"默认导入时的接收名称可以任意名称":["3.4"],"关键字进行重命名":["3.5"],"全局作用域中":["3.6"],"var声明的变量":["3.6"],"通过function声明的函数":["3.6"],"中新增了块级作用域":["3.7"],"使用let声明的变量只能在块级作用域里访问":["3.7"],"有":["3.7"],"暂时性死区":["3.7"],"的特性":["3.7"],"而箭头函数是不可以的":["3.9"],"类名":["3.11"],"构造函数和方法":["3.11"],"括起来":["3.12"],"在用import接受的时候也得用":["3.12"],"接受":["3.12"],"iterator":["3.14","17.1"],"函数默认返回一个迭代器对象":["3.14"],"可以通过":["3.14"],"for":["4.0","36.0"],"keyfor":["4.0"],"这里的symbol":["4.0"],"创建的都是symbol":["4.0"],"类型":["4.0","25.8","62.5"],"但是他们的创建机制有所不同":["4.0"],"的创建方式会在":["4.0"],"创建之前在全局中寻找":["4.0"],"有没有用symbol":["4.0"],"的方式":["4.0"],"并且key是":["4.0"],"dom树":["5.1"],"栈结构":["5.2"],"该":["5.2"],"栈主要用来计算节点之间的父子关系":["5.2"],"在第一个阶段中生成的":["5.2"],"会被按照顺序压到这个栈中":["5.2"],"通过分词器产生的新":["5.2"],"就这样不停地压栈和出栈":["5.2"],"整个解析过程就这样一直持续下去":["5.2"],"直到分词器将所有字节流分词完成":["5.2"],"解析为":["5.2"],"最终css":["5.3"],"cssom":["5.3"],"会开启一个预解析线程":["5.4"],"用来分析":["5.4"],"html":["5.4"],"defer":["5.5"],"预解析器识别出来了有":["5.6"],"文件和":["5.6"],"文件需要下载":["5.6"],"然后就同时发起这两个文件的下载请求":["5.6"],"需要注意的是":["5.6"],"这两个文件的下载过程是重叠的":["5.6"],"所以下载时间按照最久的那个文件来算":["5.6"],"后面的流水线就和前面是一样的了":["5.6"],"代码中有异步加载的":["5.7"],"css":["5.7"],"加载图片等外部文件":["5.8"],"绘制网页repaint":["5.9","6.9"],"文档解析完成之后才开始构建":["5.10"],"会一边加载":["5.11"],"计算":["5.13"],"节点坐标值等都是白白浪费的性能":["5.13"],"对象模拟":["5.14"],"节点的好处是":["5.14"],"页面的更新可以先全部反映在":["5.14"],"对象":["5.14","15.1","17.1","27.32"],"将两个虚拟":["5.15"],"vdom":["5.17"],"create":["5.17","12.26"],"表示当前页面的":["5.18"],"url":["5.18","5.20","9.14"],"信息":["5.18"],"提供了操作和访问":["5.18"],"从当前节点中移除指定的子节点":["5.19"],"addeventlistener":["5.19","11.44"],"type":["5.19","27.47","56.3"],"listener":["5.19"],"注册事件监听器":["5.19"],"获取或设置文档的标题":["5.20"],"返回当前文档的完整":["5.20"],"检查是否存在指定属性名的属性":["5.21"],"removeattribute":["5.21"],"包括内容区域和内边距":["5.22"],"不包括滚动条":["5.22"],"边框和外边距":["5.22"],"clientheight":["5.22"],"获取元素的内部高度":["5.22"],"scrollwidth":["5.22"],"获取元素内容的总宽度":["5.22"],"方法和属性":["5.23"],"方法设置的定时器":["5.24"],"clearinterval":["5.24"],"intervalid":["5.24"],"获取关于用户屏幕的信息":["5.25"],"如屏幕宽度":["5.25"],"高度等":["5.25"],"bubbling":["5.27"],"bubbles":["5.27","5.28"],"cancelable":["5.28"],"此时":["6.1"],"大部分浏览器将开启最大兼容模式来解析网页":["6.1"],"而b是展示强调内容":["6.2"],"是italic":["6.2"],"斜体":["6.2"],"的简写":["6.2"],"行内元素":["6.3"],"和其它元素都会在一行显示":["6.3"],"高":["6.3"],"行高以及外边距和内边距可以设置":["6.3"],"宽度就是文字或者图片的宽度":["6.3"],"不能改变":["6.3"],"行级元素只能容纳文本或者其它行内元素":["6.3"],"female":["6.4"],"女":["6.4"],"还有邮件等等":["6.5"],"当然":["6.5"],"title表示标题标签":["6.6"],"description是描述标签":["6.6"],"js":["6.7","23.0","52.16"],"if":["6.7","25.4","25.8","28.7","28.8","40.0","45.2","46.5","46.7"],"拖拽释放":["6.8"],"移除的元素":["6.8"],"纯表现的元素":["6.8"],"basefont":["6.8"],"s":["6.8"],"计算元素位置":["6.9"],"hidden":["6.10"],"position":["6.10"],"定位":["6.10"],"每次修改样式都会触发重排":["6.11"],"不会触发":["6.13"],"layout":["6.13"],"paint":["6.13"],"提升合成层的最好":["6.13"],"元素提升为合成层后":["6.14"],"transform":["6.14"],"使用iframe元素":["6.15"],"将一些常用的元素或动画效果放置在iframe中":["6.15"],"可以减少对页面的影响":["6.15"],"浏览器的自动层压缩并不是万能的":["6.16"],"有很多特定情况下":["6.16"],"的条件":["6.17"],"也就是说让其他元素不要和合成层元素重叠":["6.17"],"语义元素":["6.18"],"语义化使得代码更具有可读性":["6.19"],"让其他开发人员更加理解你的html结构":["6.19"],"减少差异化":["6.19"],"可以有自己的css样式":["6.20"],"javascript脚本等":["6.20"],"安全性":["6.20"],"iframe元素中嵌入的文档来自其他域名或者服务器":["6.20"],"内容建设方案":["7.1"],"用户互动传播":["7.1"],"描述":["7.2"],"尽量覆盖每个关键词":["7.3"],"通过这样的方式":["7.4"],"域名选择":["7.5"],"后缀选择":["7.5"],"一般选择":["7.5"],"com":["7.5","57.7"],"行为":["8.1"],"gt":["8.2"],"任何与号":["8.2"],"不是实体的一部分的":["8.2"],"amp":["8.2"],"使结构与表现分离":["8.3"],"标签的id和class等属性命名要做到见文知义":["8.3"],"标签越少":["8.3"],"如请求的文件":["9.1"],"错误消息":["9.1"],"或者其它信息":["9.1"],"客户端":["9.1"],"服务器":["9.1"],"无状态是指协议对于事物处理没有记忆能力":["9.2"],"不对请求和响应之间的通信状态进行保存":["9.2"],"缺少状态意味着如果后续处理需要前面的信息":["9.2"],"则它必须重传":["9.2"],"smtp":["9.3"],"udp":["9.3"],"信息是明文传输":["9.4"],"https则是具有安全性的":["9.4"],"加密传输协议":["9.4"],"http的连接很简单":["9.4"],"大幅度的提升了":["9.5"],"与":["9.8"],"方法一样":["9.8"],"都是向服务器发出指定资源的请求":["9.8"],"只不过服务器将不传回资源的本文部分":["9.8"],"它的好处在于":["9.8"],"使用这个方法可以在不必传输全部内容的情况下":["9.8"],"就可以获取其中关于该资源的信息":["9.8"],"原因是":["9.9"],"对于get方式的请求":["9.9"],"浏览器会把http":["9.9"],"header和data一并发送出去":["9.9"],"服务器响应200":["9.9"],"发送包含未知字符的用户输入时":["9.10"],"用":["9.11"],"英文逗号":["9.11"],"分开":["9.11"],"length":["9.11","12.18","14.2","36.0","46.3","51.1"],"响应体的长度":["9.11"],"单位字节":["9.11"],"encoding":["9.11"],"响应体的编码格式":["9.11"],"gzip":["9.11"],"如果请求当中请求体":["9.12"],"那么在请求头当中的":["9.12"],"也就是所谓的重定向":["9.14"],"4xx":["9.14"],"服务器必须在响应中包含有关冲突的信息":["9.15"],"已删除":["9.15"],"如果请求的资源已永久删除":["9.15"],"服务器就会返回此响应":["9.15"],"需要有效长度":["9.15"],"服务器不接受不含有效内容长度标头字段的请求":["9.15"],"未满足前提条件":["9.15"],"服务器未满足请求者在请求中设置的其中一个前提条件":["9.15"],"请求实体过大":["9.15"],"服务器无法处理请求":["9.15"],"因为请求实体过大":["9.15"],"超出服务器的处理能力":["9.15"],"请求的":["9.15"],"uri":["9.15"],"过长":["9.15"],"通常为网址":["9.15"],"http协议":["9.17"],"服务器处理请求":["9.17"],"访问页面":["9.18"],"浏览器还会进行一些额外的操作":["9.18"],"服务器发送查询请求":["9.19"],"负责对数据拆分":["9.20"],"网络层":["9.20"],"ip协议查询mac地址":["9.20"],"会应答一个报文给客户端":["9.25"],"服务端的接收":["9.25"],"发送能力是正常的":["9.25"],"此时服务端处于last":["9.26"],"ack的状态":["9.26"],"客户端收到":["9.26"],"和公网":["9.28"],"因此相对而言会增加一定的开销":["9.29"],"使得数据传输效率较低":["9.29"],"而":["9.29","28.23"],"没有这些开销":["9.29"],"传输效率较高":["9.29"],"应用场景":["9.29"],"适用于要求数据传输的可靠性和顺序性的应用":["9.29"],"如文件传输":["9.29"],"网页浏览":["9.29"],"不需要为每个客户端维护状态信息":["9.30"],"从而更容易实现负载均衡和横向扩展":["9.30"],"使用":["9.30","11.27"],"通常存储在服务器的内存或持久化存储":["9.31"],"如数据库":["9.31"],"中":["9.31","34.6"],"可以存储更多敏感的用户信息":["9.31"],"无状态的身份验证机制":["9.31"],"在用户":["9.31"],"是进程中的执行单元":["9.32"],"来触发攻击":["10.1"],"而不是从服务器返回恶意代码":["10.1"],"这种攻击通常需要用户与":["10.1"],"应用程序交互":["10.1"],"例如在搜索框中输入特定的恶意代码":["10.1"],"攻击者可以构造包含恶意代码的搜索字符串":["10.1"],"当用户输入该字符串并提交搜索表单时":["10.1"],"恶意代码会在其浏览器中执行":["10.1"],"为了防止":["10.1"],"可以采取以下措施":["10.1"],"网络安全":["10.2"],"web应用程序的安全还涉及网络安全":["10.2"],"包括网络拓扑":["10.2"],"网络协议":["10.2"],"网络访问控制等方面":["10.2"],"这可以确保web应用程序免受网络层面的攻击":["10.2"],"如拒绝服务攻击":["10.2"],"dos":["10.2"],"用户当前已经登录的身份":["10.3"],"伪造请求并以用户的名义":["10.3"],"执行恶意操作":["10.3"],"lax":["10.4"],"以限制":["10.4"],"标记为":["10.5"],"这样它们就无法通过":["10.5"],"javascript":["10.5"],"它通过使用对称加密和非对称加密的组合来实现数据的机密性":["10.6"],"bigint":["11.1"],"引用数据类型":["11.1"],"prototype":["11.2","12.11"],"tostringtag":["11.3"],"自定义类型":["11.3"],"是一个内置符号属性":["11.3"],"它的值是一个字符串":["11.3"],"用于表示一个对象的默认描述":["11.3"],"也就是调用":["11.3"],"会返回的内容":["11.3"],"let":["11.3","25.17","36.0","45.1","48.11","52.16"],"abc":["11.3"],"console":["11.3","11.60","12.8","12.10","12.15","12.30","13.2","14.6","44.1","47.0","51.2","52.5","52.6","52.8","52.24","53.1","54.1","54.2","62.9"],"log":["11.3","11.60","12.8","12.10","12.15","12.18","12.30","14.2","14.6","47.0","51.2","52.6","52.7","52.24","53.1","62.9"],"对于自定义对象":["11.3"],"调用上面的方法":["11.3"],"都只会返回":["11.3"],"此时就可以使用":["11.3"],"来指定一个确定的类型了":["11.3"],"标签之下的文档元素之前":["11.4"],"也就是说不等待后续载入的文档元素":["11.4"],"解析html和下载async脚本同时进行":["11.5"],"解析html和下载defer脚本同时进行":["11.6"],"在dom树构建完成":["11.7"],"私有属性":["11.8"],"把当前的微任务队列清空":["11.11"],"完成一次事件循环":["11.11"],"接着再取出一个宏任务":["11.11"],"同样把在此期间产生的回调入队":["11.11"],"微任务":["11.12"],"promise":["11.12"],"区分了微任务和宏任务后":["11.13"],"0ms":["11.14"],"也不是立刻执行":["11.14"],"它有一个默认最小时间":["11.14"],"这样每个可以避免指针悬挂":["11.18"],"这样在对象块结束":["11.19"],"调用函数析构的时":["11.19"],"拷贝后原对象改变":["11.20"],"这使得闭包具有一定的灵活性和可重用性":["11.21"],"通过使用闭包":["11.21"],"可以创建出一个独立的作用域":["11.21"],"避免变量污染和冲突":["11.21"],"同时也可以实现代码的分离和重用":["11.21"],"闭包的应用场景非常广泛":["11.21"],"例如":["11.21","27.22","36.12"],"垃圾清除":["11.23"],"所谓的内存泄漏是程序认为一个变量已经没有用了":["11.24"],"垃圾回收机制认为他还在用":["11.24"],"在执行时":["11.25"],"会首先查找当前作用域下的变量":["11.25"],"a":["11.26"],"a为假时执行b":["11.28"],"正常情况下":["11.29"],"运算操作符情况下优先调用valueof":["11.29"],"指向堆内存中一块地址":["11.30"],"undefined是初始化了":["11.34"],"但未定义赋值":["11.34"],"那前三位肯定也是000":["11.35"],"在比较相等性之前先将字符串转换为数值":["11.38"],"如果一个操作数是对象":["11.38"],"等于":["11.40"],"转换为":["11.41"],"所以造成误差":["11.42"],"解决方法":["11.42"],"先变成整数运算":["11.42"],"click":["11.44"],"或冒泡阶段":["11.45"],"false":["11.45"],"name":["11.46","25.1","27.55"],"是window的一个方法":["11.48"],"也是基于promise":["11.48"],"ready触发":["11.49"],"window":["11.50","11.51","15.1"],"如果后续又有新的子元素添加":["11.52"],"的作用是将累加器的值传递给下一次迭代":["11.53"],"new":["11.53","12.31","15.2","23.7","38.4","44.5","44.6"],"作为":["11.53"],"方法的初始值":["11.53"],"nan本质是一个number":["11.54"],"typeof":["11.54","25.4","25.8"],"将arr数组元素连接成字符串并返回这个字符串":["11.57"],"map":["11.57","28.28"],"操作数组每一项并返回一个新数组":["11.57"],"foreach":["11.57","25.3"],"遍历数组":["11.57"],"没有返回值":["11.57"],"sqrt":["11.58"],"num":["11.58"],"对num进行开方":["11.58"],"pow":["11.58"],"yyyy":["11.60"],"pathname":["11.62","26.5"],"获取url的路径":["11.62"],"search":["11.62"],"获取":["11.62"],"开始的部分":["11.62"],"浏览器":["11.63"],"由于bom的window包含了document":["11.63"],"window对象的属性和方法是直接可以使用而且被感知的":["11.63"],"因此可以直接使用window对象的document属性":["11.63"],"通过document属性就可以访问":["11.63"],"在严格模式下":["11.67"],"咱们不能在不声明变量的情况下使用变量":["11.67"],"控件":["11.68"],"输入字段可通过多种方式改变":["11.68"],"输出":["11.70","28.17"],"遍历数组的元素":["11.72"],"element":["11.72"],"使用生成器函数创建的对象":["11.73"],"可以通过迭代来获取生成器函数的值序列":["11.73"],"字符串迭代器":["11.73"],"返回对象实例":["11.74"],"如果构造函数中没有显式地返回一个对象":["11.74"],"那么":["11.74"],"clientx":["11.75"],"鼠标事件中":["11.75"],"鼠标指针相对于浏览器窗口可视区域左上角的水平坐标":["11.75"],"clienty":["11.75"],"传入的参数":["12.2"],"but":["12.4"],"not":["12.4"],"inherited":["12.4"],"并返回此对象":["12.5"],"throws":["12.6"],"an":["12.6"],"in":["12.6","16.3","28.17"],"property2":["12.7"],"hello":["12.7","12.13"],"以及不能修改已有属性的值":["12.9"],"此外":["12.9"],"expected":["12.10","12.16","12.20","12.25","12.30"],"proto":["12.12"],"inheritance":["12.13"],"chain":["12.13"],"speak":["12.13"],"says":["12.13"],"honda":["12.15"],"accord":["12.15"],"configurable":["12.16"],"output":["12.16","12.20","12.30"],"返回一个数组":["12.17"],"tostring":["12.19"],"按相同顺序排列的字符串":["12.21"],"都是相同对象":["12.21"],"意味着都是同一个对象的值引用":["12.21"],"都是数字且":["12.21"],"signed":["12.22"],"zero":["12.22"],"getfoo":["12.26"],"is":["12.26"],"property":["12.26"],"which":["12.26"],"isn":["12.26"],"t":["12.26"],"enumerable":["12.26"],"my":["12.26","27.41"],"当前属性的值只要原来是可写的就可以改变":["12.29"],"判断类型":["12.30"],"const":["12.31","25.27","27.27","28.20","29.6"],"object1":["12.31"],"当执行了reslove函数":["13.0"],"会回调promise对象的":["13.0"],"如果then的第二个参数不存在":["13.1"],"则catch方法会捕获到":["13.1"],"如果是then的第一个参数函数":["13.1"],"resolve":["13.1"],"中抛出了异常":["13.1"],"即成功回调函数出现异常后":["13.1"],"then的第二个参数reject":["13.1"],"捕获捕获不到":["13.1"],"catch方法可以捕获到":["13.1"],"区别":["13.1"],"成功":["13.2"],"res":["13.2","30.0","42.0"],"如果resolve中传入的是一个对象":["13.3"],"并且这个对象有实现then方法":["13.3"],"那么会执行该then方法":["13.3"],"then方法会传入resolve":["13.3"],"reject函数":["13.3"],"此时的promise状态取决于你调用了resolve":["13.3"],"还是reject函数":["13.3"],"这种模式也称之为":["13.3"],"thenable":["13.3"],"原型对象":["13.4"],"即new出来实例对象的":["13.4"],"输入正确数字":["13.5"],"settimeout":["13.5"],"finally":["13.7"],"什么都不打印":["13.8"],"race":["13.8"],"优先获取第一个返回的结果":["13.8"],"无论结果是fulfilled还是rejectd":["13.8"],"set1":["14.1"],"undefined":["14.2","25.7","25.20"],"或":["14.4"],"get":["14.7","28.9"],"clear":["14.8","21.4"],"将这个字典中的所有元素删除":["14.8"],"keys":["14.8"],"将字典中包含的所有键名以迭代器形式返回":["14.8"],"value":["14.9","41.0","52.23"],"of":["14.9","52.22","52.23"],"maps":["14.9"],"set":["14.10","28.7","28.9","28.19"],"如果在浏览器环境下直接访问":["15.1"],"关键字创建对象实例时调用函数":["15.2"],"的值就是新创建的对象实例":["15.2"],"事件处理函数中的":["15.2"],"在事件处理函数中调用":["15.2"],"sayname":["15.3"],"obj2":["15.3"],"sunshin":["15.3"],"lin":["15.3"],"改变sayname的this指向obj2":["15.3"],"它会比较不同类型的操作数":["16.1"],"instanceof":["16.3"],"相等运算符":["16.3"],"values":["17.1"],"返回数组值的":["17.1"],"扁平化":["17.1"],"flat":["17.1"],"表示匹配任意数量的a":["18.0"],"表示匹配至少一个a":["18.0"],"表示匹配0或1个a":["18.0"],"匹配位置":["18.0"],"正则表达式还可以匹配特定的位置":["18.0"],"例如开头":["18.0"],"和结尾":["18.0"],"text":["19.2"],"通过将设置密码框类型的逻辑放入微任务队列中":["19.2"],"可以确保在下一轮事件循环开始之前进行密码框类型的切换":["19.2"],"这种做法可以避免在":["19.2"],"同一轮事件循环中执行密码框类型切换的逻辑":["19.2"],"从而确保正确的初始密码框类型":["19.2"],"如果在同一轮事件循环中意味着在切换密码框类型之后":["19.2"],"模板中对应的元素可能仍然是使用旧的类型进行渲染":["19.2"],"从而无法立即反映出切换后的效果":["19.2"],"注意icon放在后面时要用计算属性做一个判断":["19.2"],"因为会与一键清空":["19.2"],"密码显示隐藏图标冲突":["19.2"],"进行打包":["19.3"],"样式打包和组件打包通过parallel并行执行":["19.4"],"和一个获取数据之前的拦截器":["19.6"],"获取器":["19.7"],"web":["19.9"],"应用":["19.9"],"移动应用和其他第三方集成":["19.9"],"通过提供统一的后端":["19.9"],"internet":["19.10"],"connections":["19.10"],"协议":["19.10"],"quic是基于udp协议的传输协议":["19.10"],"相较于基于tcp的http":["19.10"],"quic在网络层上提供更好的性能和连接管理能力":["19.10"],"正常的https通信是经过加密和身份验证的":["19.11"],"基于使用公钥加密的ssl":["19.11"],"并且每次都必须从服务器获取最新的文件副本":["19.12"],"使用expires字段":["19.12"],"expires":["19.12"],"date":["19.12"],"指定资源文件过期的日期和时间":["19.12"],"使用占位符或固定尺寸的元素来预留空间":["19.13"],"以避免后续内容加载时的布局偏移":["19.13"],"使用动画和过渡":["19.13"],"如果有元素在网页加载后需要进行动画或过渡效果":["19.13"],"减少对后端接口的请求次数":["19.14"],"提高数据加载速度":["19.14"],"响应式设计和布局优化":["19.14"],"自适应布局":["19.14"],"使用响应式设计":["19.14"],"根据不同设备和屏幕大小":["19.14"],"自动适应布局和样式":["19.14"],"将项目的依赖版本信息存储在单独的pnpm":["19.16"],"lock":["19.16"],"专用的":["20.1"],"import命令则是异步加载":["20.2"],"或者更准确地说":["20.2"],"不必在每个模块文件顶部指定":["20.3"],"use":["20.3"],"strict":["20.3"],"不能":["20.4"],"mjs文件总是以":["20.5"],"es6":["20.5"],"模块加载":["20.5"],"nexttick的优先级比promise":["20.7"],"then高":["20.7"],"mkdir":["20.9"],"官方介绍":["21.2"],"localstorage和sessionstorage是单纯的前端存储":["21.3"],"移除所有":["21.4"],"localstorage的相关操作":["21.4"],"localstorage":["21.4"],"对于版本较低的浏览器不支持":["21.5"],"服务器生成一个token便将此token返回给客户端":["21.7"],"以后客户端只需带上这个token前来请求数据即可":["21.7"],"客户端存储token":["21.8"],"客户端每次向服务端发送请求的时候都需要带上服务端发给的token":["21.8"],"会自动发送":["21.9"],"缺点不能跨域":["21.9"],"域":["21.10"],"domain":["21.10"],"cookie所属的域名":["21.10"],"则默认为当前域名":["21.10"],"路径":["21.10"],"在项目部署再打包":["22.0"],"工具函数":["22.3"],"打包成多个文件":["23.3"],"app":["23.3"],"有可能有多个name":["23.4"],"path":["23.4"],"会将转换应用在已处理过的资源上":["23.5"],"一组链式的":["23.5"],"将按照相反的顺序执行":["23.5"],"链中的第一个":["23.5"],"将其结果":["23.5"],"也就是应用过转换后的资源":["23.5"],"options":["23.6"],"presets":["23.6"],"progressplugin":["23.7"],"用于将生产环境中的压缩代码映射回原始的源代码":["23.9"],"这样":["23.9"],"当你在浏览器的开发者工具中设置断点":["23.9"],"nexttick":["24.0"],"xss攻击":["24.0"],"csrf攻击":["24.0"],"伪数组数组":["24.0"],"虚拟dom":["24.0"],"设置localstorage时间":["24.0"],"浏览器输入url发生了什么":["24.0"],"interface":["25.1"],"arrobj":["25.1"],"any":["25.3"],"items":["25.3"],"ts":["25.7"],"function":["25.7","27.27","28.20"],"fun":["25.7"],"这里":["25.8"],"被收窄为":["25.8"],"这让":["25.9"],"getdogname":["25.10"],"dogname":["25.10"],"直接使用":["25.10"],"也不能赋给":["25.11"],"综上结论":["25.11"],"大":["25.11"],"是比小":["25.11"],"函数返回的类型都可以根据上下文推断出来":["25.12"],"比如我们能根据":["25.12"],"值域中排除":["25.14"],"通过":["25.15"],"specifiednum":["25.16"],"类型的父类型":["25.17"],"number":["25.17"],"除了可用于对类的一部分行为进行抽象以外":["25.18"],"也常用于对":["25.18"],"这里真实的类型应该为":["25.20"],"上面代码":["25.21"],"在参数里写对象就相当于是直接给labeledobj赋值":["25.21"],"这个对象有严格的类型定义":["25.21"],"所以不能多参或少参":["25.21"],"而当你在外面将该对象用另一个变量myobj接收":["25.21"],"myobj不会经过额外属性检查":["25.21"],"但会根据类型推论为let":["25.21"],"索引签名":["25.22"],"兔神":["25.23"],"但是可以作用于原始值":["25.24"],"基本类型":["25.24"],"联合类型":["25.24"],"元组以及其它任何你需要手写的类型":["25.24"],"tuple":["25.26","46.3"],"data":["25.26","27.14","49.3"],"dom":["25.26"],"除了":["25.29"],"之外":["25.29"],"以下是常见泛型变量代表的意思":["25.29"],"k":["25.29"],"arg":["25.30"],"这三个特性组合保证了代码的动态性和准确性":["25.32"],"也让代码提示变得更加丰富了":["25.32"],"映射类型":["25.32"],"我们可以通过":["25.32"],"来指定添加还是删除":["25.32"],"optionaltestinterface":["25.32"],"newtestinterface":["25.32"],"testinterface":["25.32"],"readonly":["25.32"],"nginx":["26.2"],"config的对应location里配置一行代码":["26.2"],"try":["26.2"],"files":["26.2"],"然后使用routerview组件来对vue":["26.3"],"createwebhashhistory":["26.4"],"创建的":["26.4"],"location":["26.5"],"在你的服务器上添加一个简单的回退路由":["26.5"],"如果":["26.5"],"beforerouteenter":["26.7"],"进入该组件之前调用":["26.7"],"无法获取到vue实例":["26.7"],"因为没有this":["26.7"],"所以支持给":["26.7"],"传递回调":["26.7"],"在导航确认后被调用":["26.7"],"更新":["26.8","27.6"],"调用":["26.8"],"守卫中传给":["26.8"],"next":["26.8","49.2"],"的回调函数":["26.8"],"创建好的组件实例会作为回调函数的参数传入":["26.8"],"组件现在路由里注册但不进行组件的加载与执行":["26.9"],"被请求的模块和它引用的所有子模块":["26.10"],"会分离到一个单独的":["26.10"],"import":["26.11"],"加载中":["26.13"],"之类的指示":["26.13"],"可以通过在编程式导航中传递query一个包含参数的路由对象来传递参数":["26.14"],"是通过路由的路径进行传递":["26.15"],"的查询字符串进行传递":["26.15"],"状态管理":["27.1"],"返回唯一的html页面和它的公共静态资源":["27.2"],"后续的页面跳转都不会从服务端拿html文件":["27.2"],"onupdated":["27.3","27.5","34.0"],"数据更新之后被调用":["27.3","34.0"],"beforedestroy":["27.3","27.5"],"onbeforeunmount":["27.3","27.5"],"页面上数据和内存中的一致":["27.5"],"移除":["27.5"],"父updated":["27.6"],"销毁过程":["27.6"],"在vue3中v":["27.9"],"if的优先级会更高":["27.9"],"但是当我们遍历一个数组的时候":["27.9"],"侦听器可以检测某个响应式数据的变化并执行副作用":["27.10"],"常见用法是传递一个函数":["27.10"],"执行副作用":["27.10"],"watch没有返回值":["27.10"],"但可以执行异步操作等复杂逻辑":["27.10"],"一般用来请求接口":["27.10"],"所有依赖这个数据的相关数据或函数都会自动发生变化或调用":["27.12"],"侦听器watch常用场景是状态变化之后做一些异步操作":["27.12"],"的":["27.13","28.26"],"的属性":["27.14"],"在后":["27.15"],"这样就能实现":["27.15"],"计算属性重要工作是重新执行计算方法":["27.16"],"这里需要多补充一句":["27.16"],"因为":["27.16","27.51"],"vue2中是通过object":["27.19"],"defineproperty对数据劫持实现的":["27.19"],"vue3中则是使用proxy对数据代理实现的":["27.19"],"生命周期区别":["27.19"],"渲染函数或渲染器负责将组件的状态渲染为虚拟dom":["27.20"],"创建组件实例":["27.20"],"vue会根据组件配置和渲染函数创建组件实例":["27.20"],"并将其与虚拟dom关联起来":["27.20"],"调用生命周期钩子函数":["27.20"],"vue会依次调用组件的生命周期钩子函数":["27.20"],"中有一个":["27.21"],"watcher":["27.21","28.12"],"3对一些数组方法进行了修改":["27.22"],"使其更符合规范并提供更好的类型推导":["27.22"],"会调用我们插件的install属性的函数":["27.23"],"personname":["27.24"],"xiaoyue":["27.24"],"age":["27.24","44.2"],"parent":["27.25","48.15"],"父组件访问子组件":["27.25"],"children":["27.25"],"emits":["27.27"],"defineemits":["27.27"],"vue2使用":["27.29"],"this":["27.29","28.14","34.6","38.1","62.4"],"refs":["27.29"],"default":["27.30"],"slotprops":["27.30"],"每个模块都拥有自己的state":["27.31"],"actions等":["27.31"],"在大型应用中经常用到":["27.31"],"孙行者":["27.32"],"多条数据修改":["27.32"],"patch":["27.32","34.6"],"方法可以接受两个类型的参数":["27.32"],"函数":["27.32"],"appstore":["27.33"],"pinia其实就是vuex5":["27.33"],"它和vuex的主要区别有以下几点":["27.33"],"pinia使用更简单":["27.33"],"alive还接收max属性表示最大缓存实例数":["27.35"],"如果超出这个数则最久没有被访问的缓存实例将被销毁":["27.35"],"都不会触发":["27.36"],"因为组件没被销毁":["27.37"],"如果mixin中的属性或者方法与父组件冲突则会使用父组件中的":["27.38"],"优点":["27.38"],"则不会破坏原对象":["27.39"],"只是在原对象上覆盖了一层":["27.39"],"video":["27.41"],"src":["27.41"],"将在内存中渲染其默认的插槽内容":["27.42"],"如果在这个过程中遇到任何异步依赖":["27.42"],"所以在data刚被修改的时候":["27.44"],"我们是获取不到更新后的dom的":["27.44"],"然后与上一次虚拟dom节点树进行比较":["27.46"],"diff":["27.46"],"不一样就认为节点不一样":["27.47"],"不再对比子节点":["27.47"],"这样时间复杂度一下子就降到了":["27.47"],"比较每对相同位置的子节点的差异":["27.48"],"在比较子节点的过程中":["27.48"],"js会使用一些优化策略":["27.48"],"例如为每个子节点添加唯一的key属性":["27.48"],"以便更精确地定位和复用已有的dom节点":["27.48"],"filltermeals":["27.49"],"子组件":["27.49"],"父组件":["27.50"],"father":["27.50"],"可能无法获取到最新的结果":["27.51"],"的更新是异步执行的":["27.51"],"需要等待下一次":["27.51"],"如果在列表中添加一个数据后面的index就要重新排列":["27.52"],"先在fallback插槽显示占位符例如加载中":["27.53"],"reactive可以直接读取更新":["27.54"],"观察者模式":["28.2"],"一个被观察对象对应多个观察者":["28.2"],"被观察对象与观察者之间可能是":["28.3"],"多对多":["28.3"],"的关系":["28.3"],"两者都可以绑定多个另一角色":["28.3"],"依赖更新时会调用":["28.4"],"执行回调函数":["28.4"],"update":["28.4","28.13"],"oldvalue":["28.4"],"依赖收集管理者的构造函数":["28.4"],"保存所有":["28.4"],"观察者依赖数组":["28.4"],"subs":["28.4"],"插入一个观察者到依赖数组中":["28.4"],"addsub":["28.4","28.14"],"被观察者":["28.5"],"是在":["28.5"],"执行响应式时候调用":["28.5"],"newval":["28.7"],"下文中该方法统称为setter":["28.7"],"reactivesetter":["28.8","28.9"],"newvalue":["28.8","28.9"],"这里第一次调用来监测该对象":["28.9"],"defineproperty":["28.9"],"reactivegetter":["28.9"],"setprototypeof强制让vue的数据指向了新定义的arraymothods":["28.10"],"在getter中就能得到当前正在读取数据的watcher":["28.11"],"并把这个watcher收到dep中":["28.11"],"改变数据":["28.11"],"注意":["28.12"],"parsepath":["28.13"],"当收到数据变化的消息时执行该方法":["28.13"],"从而调用cb":["28.13"],"depend":["28.14"],"target":["28.14","28.25"],"notify":["28.14"],"被改变了":["28.15"],"通知依赖去更新":["28.15"],"proxy":["28.16","28.26"],"对象来实现整个响应式系统基础":["28.16"],"是":["28.16"],"delete":["28.17"],"建立一个对象":["28.18"],"属性":["28.18"],"副作用函数的依赖关系":["28.18"],"add":["28.21"],"执行完成成后我们得到一个如下的数据结构":["28.21"],"集合":["28.21"],"effects":["28.22"],"收集数据依赖":["28.24"],"因为发布者和观察者之间多了一个":["28.24"],"dependence":["28.24"],"依赖收集者":["28.24"],"返回一个对象的响应式代理":["28.25"],"extends":["28.25"],"object":["28.25","62.11"],"unwrapnestedrefs":["28.25"],"都是通过":["28.26"],"createreactiveobject":["28.26"],"方法来创建一个":["28.26"],"对象返回":["28.26"],"只是":["28.26"],"dep":["28.28"],"trigger":["28.32"],"设置target的key属性为value":["28.33"],"等常用的指令":["29.0"],"除此之外vue":["29.0"],"mounted":["29.2"],"el":["29.2"],"mount":["29.2","55.2","59.2"],"instance":["29.3"],"使用该指令的组件实例":["29.3"],"dir":["29.3"],"指令的定义对象":["29.3"],"代表绑定元素的底层":["29.3"],"prevnode":["29.3"],"之前的渲染中代表指令所绑定元素的":["29.3"],"钩子中可用":["29.3"],"vue":["29.3"],"div":["29.4"],"select":["30.0","42.0"],"execcommand":["30.0","42.0"],"可访问性":["33.0"],"高性能和优化":["33.0"],"组件库应该追求高性能和优化":["33.0"],"文档维护":["33.1"],"revert":["33.2"],"8e":["33.3"],"9f":["33.3"],"e7":["33.3"],"md":["33.3"],"webpack是commonjs":["33.4"],"内置了一个轻量级的开发服务器":["33.5"],"利用浏览器的原生模块解析能力":["33.5"],"实现了快速的热模块替换":["33.5"],"字段":["33.6"],"我们可以调用":["33.6"],"e":["33.7"],"f":["33.7","52.15"],"数据更新之前被调用":["34.0"],"updated":["34.0"],"视图中的html并没有渲染出来":["34.1"],"此时如果直接操作dom节点一定找不到相关元素":["34.1"],"这是因为在vue中每一个组件都是一个单独的实例":["34.2"],"全局拦截":["34.3"],"对所有的axios获取数据时都拦截":["34.3"],"特定拦截":["34.3"],"ref":["34.4"],"expose":["34.4"],"中派生出一些衍生状态":["34.5"],"类似于组件中的计算属性":["34.5"],"module":["34.5"],"模块":["34.5"],"在模板中使用computed属性时":["34.7"],"你可以像使用普通属性一样获取它们的值":["34.7"],"i":["36.0"],"而computed定义的计算属性会返回计算的结果":["36.2"],"可以像访问普通属性一样使用":["36.2"],"综上所述":["36.2"],"在监听到某个数据变化后":["36.3"],"可以发送异步请求到服务器获取数据":["36.3"],"并在数据返回后更新其他相关数据或界面":["36.3"],"路由监听":["36.3"],"在vue路由中":["36.3"],"align":["36.6"],"sticky":["36.10"],"元素在滚动时表现为":["36.10"],"的混合":["36.10"],"元素在滚动到指定阈值前表现为":["36.10"],"任何修改都必须通过向父组件发送事件来触发":["36.11"],"简化了组件之间的数据传递和维护":["36.11"],"处理外部事件和回调":["36.12"],"异步操作还用于处理外部事件和回调函数":["36.12"],"和rejected":["36.13"],"已失败":["36.13"],"并行和串行操作":["36.13"],"和微任务队列如promise的回调函数":["36.14"],"异步任务完成后他们的回调函数或者结果会被放入相应的任务队列中":["36.14"],"先处理微任务队列中的任务在处理宏任务":["36.15"],"apply":["38.1"],"timmer":["38.2"],"hobbies":["38.4"],"reading":["38.4"],"swimming":["38.4"],"address":["38.4"],"city":["38.4"],"york":["38.4"],"country":["38.4"],"usa":["38.4"],"copiedobj":["38.4"],"将导致无限循环的序列化":["38.5"],"可能会导致错误":["38.5"],"对象的键名将被强制转换为字符串":["38.5"],"可能会导致类型信息丢失":["38.5"],"null":["39.0","46.7","49.4"],"第一个完成的":["40.1"],"执行":["40.1"],"reflect":["41.0"],"john":["44.3","44.5"],"john2":["44.4"],"john4":["44.6"],"temp":["45.1"],"push":["45.5","46.2","53.5","53.6"],"charcodeat":["46.1"],"是否需要扩容":["46.2"],"newsize":["46.4"],"math":["46.4","52.29"],"floor":["46.4"],"continue":["46.7"],"j":["46.7"],"isempty":["47.1"],"非空右子树的所有键值大于其根结点的键值":["48.1"],"查找效率非常高":["48.2"],"min":["48.3"],"返回树中最小的值":["48.3"],"键":["48.3"],"max":["48.3"],"key":["48.4","48.8","52.22"],"left":["48.7"],"处理经过节点的右子节点":["48.7"],"处理当前节点":["48.8"],"处理右子树中的节点":["48.8"],"right":["48.9"],"whilesearch":["48.11"],"while":["48.11","49.4","49.5","49.7","49.8"],"在上面的代码中":["48.12"],"我们先保存了一些临时变量":["48.12"],"用于一会儿找到的要删除的节点对应的node":["48.12"],"用于保存current节点的父节点":["48.12"],"因为如果current有子节点":["48.12"],"那么在删除current节点的时候":["48.12"],"左为空":["48.14"],"root":["48.15"],"isleftchild":["48.15"],"有两个节点":["48.16"],"递归删除函数":["48.16"],"successor":["48.16"],"getsuccessor":["48.16"],"head":["49.1"],"让current指到下一个data":["49.2"],"直到current":["49.2"],"next为空":["49.2"],"最后把新节点赋值给current":["49.2"],"新节点就加入到了最后":["49.2"],"后一个":["49.4"],"prev":["49.4"],"前一个":["49.4"],"从头开始找位置":["49.4"],"index":["49.5","52.1","52.2","52.3"],"break":["49.9"],"previous":["49.11","49.12"],"removedata":["49.11","49.12"],"string":["50.1","50.2"],"size":["51.1"],"endname":["51.2"],"front":["51.2"],"ljt":["51.2"],"item":["52.1","52.2","52.3","52.12"],"result27":["52.10"],"result26":["52.12"],"result":["52.13"],"值的槽":["52.16"],"result17":["52.16"],"result19":["52.18"],"result34":["52.21"],"pre":["52.26"],"cur":["52.26"],"result29":["52.27"],"result31":["52.28"],"b":["52.29"],"abs":["52.29"],"result33":["52.30"],"result36":["52.32"],"concat":["53.4"],"全局挂载之后在组件内就可以直接使用了":["55.2","56.2","59.2"],"或者直接写disabled":["55.4"],"midium":["56.1"],"small":["56.1"],"只需要引用下面这行代码":["56.2"],"你就可以看到按钮啦":["56.2"],"success":["56.3","56.5","56.6","56.7"],"plain":["56.3"],"dianhua":["56.8"],"电话":["56.8"],"append":["57.7"],"shanchu":["59.1"],"shaixuan":["59.1"],"shandian":["59.1"],"pinglun":["59.1"],"shengyin":["59.1"],"你就可以看到图标啦":["59.3"],"dot":["59.4"],"red":["59.5"],"td默认继承tr的高度":["62.2"],"且平分table的宽度":["62.2"],"若table":["62.2"],"不存在":["62.2"],"给td设置的宽高不能用百分比只能用准确的数":["62.2"],"object小写":["62.3"],"但请求者应继续使用原有位置来进行以后的请求":["62.6"],"sort会影响原数组":["62.7"],"区域外的隐藏":["62.8"],"转为字符串都是":["62.11"],"判断数据类型得用":["62.12"],"hight":["62.14"],"1s":["62.14"],"且当标签失焦后触发change事件":["62.15"],"顺序不能乱":["62.18"],"挂载到原型上":["63.2"],"水击三千里":["66.0"],"抟扶摇而上者九万里":["66.0"],"温故而知新":["67.0"]},{"0":["1.14","6.10","12.21","46.5","52.21","62.1"],"1":["9.2","9.8","12.30","17.4","25.16","25.27","49.6","52.16"],"2":["3.12","11.53","12.30","13.6","46.2","46.4","49.12","52.16"],"3":["1.21","5.2","9.25","11.71","12.30","12.31","14.3","28.17","29.2","48.1","48.15","48.16","52.16","62.1"],"4":["0.4","9.18","9.19","9.20","11.11","11.14","11.65","11.66","12.31","13.10","15.2","27.10","27.31","27.38","28.25","28.26","33.3","62.2"],"5":["1.31","3.6","6.15","9.26","13.9","18.0","19.16","25.19","26.6","27.10","27.12","27.19","27.48","33.3","36.0"],"6":["2.10","5.8","5.9","6.9","9.17","10.2","11.49","13.8","17.1","21.8","33.0","36.10"],"7":["5.18","13.5","27.1","33.0","62.17"],"8":["11.75","13.5","25.32","53.0","54.0"],"9":["6.7","8.2","19.2","25.32","53.0","54.0"],"10":["8.2","16.3","52.17","59.4"],"11":["8.2","16.3"],"12":["16.3","19.12","52.17"],"14":["52.17"],"15":["9.15"],"16":["9.15"],"17":["9.15"],"20":["44.3","44.4","44.5"],"50":["1.1"],"60":["50.2"],"75":["46.2"],"415":["9.15"],"416":["9.15"],"417":["9.15"],"500":["9.15"],"501":["9.15"],"2023":["19.12"],"100000":["25.23"],"xml":["0.1"],"ajax用来与后台交互":["0.1"],"catch":["0.2","13.2","40.1"],"err":["0.2","13.2"],"axios":["0.2"],"baseurl":["0.2"],"url":["0.2","5.24"],"stringify":["0.3"],"ie4k左右":["0.4"],"get获取数据":["0.4"],"post上传数据":["0.4"],"上传的数据比较多":["0.4"],"可以在不同域名的页面之间进行实时通信":["0.6"],"websocket是一种长连接":["0.6"],"可以持续地发送和接收数据":["0.6"],"而不需要每次请求都建立新的连接":["0.6"],"websocket协议有以下特点":["0.6"],"全双工通信":["0.6"],"websocket允许客户端和服务器之间实现双向通信":["0.6"],"可以在任何时候发送和接收数据":["0.6"],"不需要等待请求或响应":["0.6"],"基于消息":["0.6"],"通信是基于消息的":["0.6"],"而不是基于请求和响应的":["0.6"],"客户端和服务器之间可以发送和接收任意类型的消息":["0.6"],"如文本":["0.6"],"二进制数据等":["0.6"],"高效":["0.6"],"newtoken":["0.8"],"data":["0.8","27.5","33.7"],"setitem":["0.8"],"更新本地存储中的token":["0.8"],"或者使用全局状态管理库更新token":["0.8"],"this":["0.8","12.26","25.7","38.2"],"store":["0.8","27.32","34.5"],"commit":["0.8"],"updatetoken":["0.8"],"更新请求的authorization头部":["0.8"],"属性":["1.2","6.13","27.29"],"父元素使用":["1.2"],"弹性盒子布局":["1.2"],"overflow除visible以外的值":["1.3"],"hidden":["1.3"],"basis":["1.5"],"不管内容多少":["1.6"],"一般都是平分空间":["1.6"],"不是均分的":["1.7"],"除非内容都是一样":["1.7"],"不可扩大":["1.8","1.9"],"设置元素内容可见性":["1.11"],"设置的元素本身不受影响":["1.11"],"隐藏效果与":["1.11"],"利用偏移抛出视图":["1.12"],"空间会占据":["1.12"],"z":["1.13","6.17"],"index":["1.13","6.17","26.2","26.5","46.1","52.10","52.12"],"层叠上下文在合适的情况下可以遮挡住元素":["1.13"],"那么子元素1em就表示大小和父元素一样为80px":["1.14"],"可视窗口高度":["1.15"],"1vw":["1.15"],"就等于可视窗口宽度的百分之一":["1.15"],"在不同屏幕尺寸下":["1.16"],"浏览器会自动根据基准字体大小进行缩放":["1.16"],"从而实现自适应布局":["1.16"],"默认值为row":["1.17"],"nowrap":["1.17"],"content属性定义了项目在主轴上的对齐方式":["1.17"],"items属性定义项目在交叉轴上如何对齐":["1.17"],"列":["1.18"],"产生了一个个的网格":["1.18"],"我们可以将网格元素放在与这些行和列相关的位置上":["1.18"],"white":["1.19"],"space":["1.19"],"reflow":["1.20"],"relayout":["1.20"],"所谓重排即指对这些节点以及受这些节点影响的其它节点":["1.20"],"进行css计算":["1.20"],"布局":["1.20"],"亦即如果你设置了top":["1.21"],"50px":["1.21"],"那么在sticky元素到达距离相对定位的元素顶部50px的位置时固定":["1.21"],"不再向上移动":["1.21"],"around是每个子项目左右方向的":["1.22"],"margin":["1.22","2.4"],"相等":["1.22"],"direction":["1.23"],"指定是否应该轮流反向播放动画":["1.23"],"fill":["1.23"],"mode":["1.23","12.6"],"规定当动画不播放时":["1.23"],"当动画完成时":["1.23"],"circle":["1.24"],"块级元素的默认显示方式为":["1.25"],"block":["1.25"],"而行内元素的默认显示方式为":["1.25"],"capitalize":["1.26"],"每个单词的首字母大写":["1.26"],"注意":["1.27","48.15"],"属性可重写灵活容器的":["1.27"],"play":["1.28"],"state":["1.28","27.33"],"选择已选中的复选框或单选按钮":["1.31"],"disabled":["1.31"],"选择禁用的表单元素":["1.31"],"目标伪类选择器":["1.31"],"target":["1.31","5.24"],"letter":["1.32"],"通过设置不同的上下左右边框宽度或者颜色即可得到三角形或者梯形":["2.0"],"padding":["2.1"],"的百分比计算是参照父元素的":["2.1"],"width":["2.1"],"清除浮动方法":["2.2"],"万能清除法":["2.2"],"after":["2.2"],"和外边距":["2.3"],"ie盒模型包含内边距":["2.4"],"而border":["2.5"],"box表示使用ie盒模型":["2.5"],"用户行为":["2.6"],"例如调整窗口大小":["2.6"],"改变字号":["2.6"],"其实对于大部分图标这类图片":["2.7"],"完全可以使用":["2.7"],"svg":["2.7"],"代替":["2.7"],"3d转换":["2.8"],"transform":["2.8"],"过渡与动画":["2.8"],"transition":["2.8"],"color":["2.9","29.3"],"red":["2.9"],"当设备屏幕宽度小于等于600px时":["2.9"],"弹性布局":["2.10"],"flex":["2.10","36.6"],"利用flex布局的方式":["2.10"],"左右两栏设置固定宽度":["2.10"],"中间一栏设置为flex":["2.10"],"这种实现方式代码非常简洁":["2.10"],"display":["2.10","36.10"],"向外共享模块成员使用":["3.2"],"export关键字":["3.2"],"只要是合法的成员名称即可":["3.4"],"按需导入可以和默认导入一起使用":["3.5"],"es6新增":["3.5"],"会自动变为window对象的变量":["3.6"],"属性或方法":["3.6"],"但const和let不会":["3.6"],"也就是说声明前不可用":["3.7"],"大部分包含":["3.7"],"的都可以构成块级作用域":["3.7"],"但是函数和对象不构成块级作用域":["3.7"],"user":["3.8"],"obj":["3.8","28.13"],"箭头函数没有arguments":["3.9"],"要接受所有的参数用":["3.9"],"rest":["3.9"],"通过extends关键字实现继承":["3.11"],"default是以整体的方式抛出":["3.12"],"next":["3.14","49.3","49.5","49.7","52.24"],"方法逐步遍历生成器函数中的每个值":["3.14"],"状态机":["3.14"],"由于":["3.14"],"的字符串创建了":["4.0"],"symbol类型":["4.0"],"创建了就会在全局中登记":["4.0"],"如果有则不重复创建":["4.0"],"已登记的":["4.0"],"然而symbol":["4.0"],"的创建是":["4.0"],"不会去检索全局":["4.0"],"的":["4.0","5.2","6.13"],"是":["4.0","13.1"],"直接创建一个新的symbol类型":["4.0"],"这也是用symbol":["4.0"],"创建的两个":["4.0"],"类型不相等的根本原因":["4.0"],"方法返回一个已登记的":["4.0"],"类型值的":["4.0"],"key":["4.0","25.29","48.9"],"是表述":["5.1"],"的内部数据结构":["5.1"],"节点":["5.2"],"并将dom":["5.2"],"节点添加到":["5.2"],"树中":["5.2"],"解析器开始工作时":["5.2"],"会默认创建了一个根为":["5.2"],"document":["5.2","25.26"],"的空":["5.2"],"同时会将一个":["5.2"],"starttag":["5.2"],"会影响dom树的渲染":["5.3"],"也可以说最终会影响渲染树的生成":["5.3"],"文件中包含的":["5.4"],"css":["5.4","6.13","19.13"],"等相关文件":["5.4"],"来标记代码":["5.5"],"不管":["5.6"],"文件谁先到达":["5.6"],"都要先等到":["5.6"],"文件下载完成并生成":["5.6"],"图片资源都加载完毕之后":["5.7"],"load":["5.7"],"页面加载完毕":["5.8","11.49"],"重绘":["5.9","6.9"],"根据浏览器提供各层的信息合成图层":["5.9","6.9"],"render":["5.10","26.3","28.24"],"树和布局":["5.10"],"一边解析":["5.11"],"以及一边渲染":["5.11"],"即使计算机硬件一直在迭代更新":["5.13"],"的代价仍旧是昂贵的":["5.13"],"上":["5.14"],"操作内存中的":["5.14"],"对象的速度显然要更快":["5.14"],"等更新完成后":["5.14"],"对象的差异应用到真正的":["5.15"],"elemenet":["5.17"],"js":["5.17","11.29"],"的方法和属性":["5.18"],"xmlhttprequest":["5.18"],"表示":["5.18","11.3"],"ajax":["5.18"],"当指定类型的事件触发时执行相应的回调函数":["5.19"],"removeeventlistener":["5.19"],"移除事件监听器":["5.19"],"cookie":["5.20","9.2","9.30"],"获取或设置文档的":["5.20"],"移除指定属性名的属性":["5.21"],"包括被隐藏的部分":["5.22"],"如果有":["5.22"],"scrollheight":["5.22"],"获取元素内容的总高度":["5.22"],"scrollleft":["5.22"],"获取或设置元素内容在水平方向上滚动的像素数":["5.22"],"scrolltop":["5.22"],"获取或设置元素内容在垂直方向上滚动的像素数":["5.22"],"open":["5.24"],"打开一个新窗口或标签页":["5.24"],"localstorage":["5.25"],"提供了对本地存储的访问":["5.25"],"可以存储和读取数据":["5.25"],"sessionstorage":["5.25"],"对象的属性和方法可以用于事件处理":["5.26"],"事件传播和事件信息的获取":["5.26"],"指示事件是否会冒泡的布尔值":["5.27"],"cancelable":["5.27"],"指示事件是否可以取消的布尔值":["5.27"],"defaultprevented":["5.27"],"初始化事件对象":["5.28"],"设置事件的类型":["5.28"],"我们一般称为怪异模式":["6.1"],"这不仅会降低解析效率":["6.1"],"而且会在解析过程中产生一些难以预知的bug":["6.1"],"是早期的斜体元素":["6.2"],"表示内容展示为斜体":["6.2"],"而":["6.2","13.1"],"是emphasize":["6.2"],"使用行内元素需要注意的是":["6.3"],"行内元素设置宽度width无效":["6.3"],"行内元素设置height无效":["6.3"],"但是可以通过line":["6.3"],"height来设置":["6.3"],"设置margin只有左右有效":["6.3"],"上下无效":["6.3"],"设置padding只有左右有效":["6.3"],"a元素最常见的就是用来做锚点和":["6.5"],"下载文件":["6.5"],"锚点可以在点击时快速定位到一个页面的某个位置":["6.5"],"keywords是关键词标签":["6.6"],"lt":["6.7"],"ie":["6.7"],"strike":["6.8"],"tt":["6.8"],"u":["6.8"],"big":["6.8"],"center":["6.8"],"obsity":["6.10"],"这三个占位置":["6.10"],"重排非常耗费资源":["6.11"],"开发尽量减少次数":["6.11"],"式是使":["6.13"],"will":["6.13"],"change":["6.13"],"和":["6.14","11.3","25.14","27.33"],"opacity":["6.14"],"才不会触发":["6.14"],"使用video":["6.15"],"canvas等元素":["6.15"],"这些元素通常都是单独的合成层":["6.15"],"可以减少对其他元素的影响":["6.15"],"浏览器是无法进行层压缩的":["6.16"],"比如":["6.16"],"video":["6.16"],"譬如巧妙的使用":["6.17"],"table":["6.18"],"以及":["6.18"],"img":["6.18"],"方便其他设备解析":["6.19"],"如屏幕阅读器":["6.19"],"盲人阅读器":["6.19"],"需要遵循同源策略":["6.20"],"从而保证网页的安全性":["6.20"],"高度和宽度的控制":["6.20"],"可以通过设置height和width属性来控制iframe元素的大小":["6.20"],"网页性能的影响":["6.20"],"页面等角度进行合理规划":["7.1"],"使网站更适合搜索引擎的索引原则的行为":["7.1"],"用自然语言描述页面的主要内容":["7.2"],"description就是用自然语言描述页面的主要内容":["7.3"],"这里注意一点就是把每个关键词至少覆盖一遍才能达到最佳效果":["7.3"],"还可以在不同的页面之间相互投权重":["7.4"],"短域名":["7.5"],"越短越好记":["7.5"],"域名历史":["7.5"],"买之前":["7.5"],"在搜索引擎搜索以下":["7.5"],"主要是有js":["8.1"],"dom组成":["8.1"],"所有属性必须有属性值":["8.2"],"所有的标签都必须有相应的结束标签":["8.2"],"所有的标签都必须合理嵌套":["8.2"],"加载越快":["8.3"],"用户体验提高":["8.3"],"服务器监听客户端的请求":["9.1"],"收到请求":["9.1"],"状态码":["9.1"],"无状态协议解决办法":["9.2"],"通过":["9.2"],"ip等协议构成的协议簇":["9.3"],"只是因为在tcp":["9.3"],"ip协议中tcp协议和ip协议最具代表性":["9.3"],"是无状态的":["9.4"],"协议是由":["9.4"],"协议构建的可进行加密传输":["9.4"],"web":["9.5"],"性能":["9.5"],"原信息或称元数据":["9.8"],"trace":["9.8"],"显示服务器收到的请求":["9.8"],"主要用于测试或诊断":["9.8"],"connect":["9.8"],"http":["9.8"],"返回数据":["9.9"],"而对于post":["9.9"],"浏览器先发送header":["9.9"],"服务器响应100":["9.9"],"continue":["9.9"],"比":["9.10"],"get":["9.10"],"deflate":["9.11"],"告知对方我方接受的":["9.11"],"给当前资源的标识":["9.11"],"和last":["9.11"],"content":["9.12","10.1"],"length":["9.12","11.70","25.19","49.1"],"客户端错误":["9.14"],"请求有语法错误或者请求无法实现":["9.14"],"5xx":["9.14","9.15"],"服务器无法处理":["9.15"],"不支持的媒体类型":["9.15"],"请求的格式不受请求页面的支持":["9.15"],"请求范围不符合要求":["9.15"],"如果页面无法提供请求的范围":["9.15"],"则服务器会返回此状态代码":["9.15"],"未满足期望值":["9.15"],"服务器未满足":["9.15"],"期望":["9.15"],"请求标头字段的要求":["9.15"],"服务器错误":["9.15"],"服务器内部错误":["9.15"],"服务器遇到错误":["9.15"],"无法完成请求":["9.15"],"尚未实施":["9.15"],"返回响应":["9.17"],"客户端接受响应":["9.17"],"比如安全检查":["9.18"],"访问限制":["9.18"],"路由器缓存":["9.19"],"isp":["9.19"],"添加信息":["9.20"],"链路层":["9.20"],"不过此时服务器并不能确认客户端的接收能力是否正常":["9.25"],"第三次握手就是客户端收到报文后再给服务器发送一个报文":["9.25"],"三次握手就成功了":["9.25"],"一样发送一个":["9.26"],"报文作为应答":["9.26"],"此时客户端处于time":["9.26"],"同时还有子网掩码用于定义":["9.28"],"电子邮件等":["9.29"],"适用于实时性要求较高":["9.29"],"对数据可靠性要求较低的应用":["9.29"],"如音频和视频流媒体":["9.29"],"实时游戏等":["9.29"],"总结来说":["9.29"],"提供可靠的":["9.29"],"面向连接的数据传输":["9.29"],"适用于对数据可靠性和顺序性有要求的应用":["9.29"],"session":["9.30"],"token":["9.30"],"服务器会生成一个加密的令牌":["9.31"],"并返回给客户端":["9.31"],"客户端在后续的请求中将该":["9.31"],"包含在请求头":["9.31"],"中发送给服务器进行身份验证":["9.31"],"服务器在接收到":["9.31"],"后解密并验证其有效性":["9.31"],"从而确定用户的身份":["9.31"],"一个进程可以拥有多个线程":["9.32"],"对用户输入的数据进行过滤和验证":["10.1"],"防止恶意代码注入":["10.1"],"对输出到":["10.1"],"页面的数据进行编码":["10.1"],"避免恶意代码在浏览器中执行":["10.1"],"使用":["10.1","27.29","29.2"],"security":["10.1"],"policy":["10.1"],"csp":["10.1"],"策略":["10.1"],"端口扫描等":["10.2"],"应用程序架构和设计":["10.2"],"web应用程序的架构和设计也可以影响安全性":["10.2"],"例如":["10.2","11.73"],"使用安全的框架":["10.2"],"设计模式和最佳实践":["10.2"],"可以降低应用程序受攻击的风险":["10.2"],"xss":["10.3"],"是指攻击者将":["10.3"],"恶意脚本":["10.3"],"的跨站请求":["10.4"],"验证请求方法":["10.4"],"访问":["10.5"],"安全编码实践":["10.5"],"遵循安全编码实践":["10.5"],"包括对输入进行严格验证":["10.5"],"完整性和身份验证":["10.6"],"object":["11.1","11.29"],"function":["11.1","12.26","28.13"],"属性是否出现在某个实例对象的原型链上":["11.2"],"class":["11.3"],"person":["11.3"],"getsymbol":["11.3"],"return":["11.3","12.26","25.4","25.12","46.5","46.6","47.1","49.3","49.6","51.2","52.1","52.2","52.3","52.26","53.5","53.6","54.4"],"isprototypeof":["11.3"],"类似":["11.3"],"isarray":["11.3"],"专业检测数组三十年":["11.3"],"isnan":["11.3"],"属于":["11.3"],"es6":["11.3","28.16"],"标准":["11.3"],"中有一个特殊的":["11.3"],"数字":["11.3"],"nan":["11.3","12.21"],"not":["11.3"],"不是一个数字":["11.3"],"但它却归属于数字类型":["11.3"],"读到就加载并执行":["11.4"],"先执行下载js脚本然后执行然后再解析html":["11.4"],"async脚本下载完成后立即执行":["11.5"],"然后开始解析剩下的html":["11.5"],"执行时会在html页面解析完毕之后再去执行":["11.6"],"domcontentloaded之前执行":["11.7"],"再把当前的微任务队列清空":["11.11"],"以此往复":["11.11"],"宏任务队列只有一个":["11.11"],"mutationobserver":["11.12"],"监听dom":["11.12"],"node":["11.12"],"中的":["11.12"],"本轮循环中的微任务实际上就是在插队":["11.13"],"这样微任务中所做的状态修改":["11.13"],"为4ms":["11.14"],"所以执行第一个宏任务的script的时间大于4ms执行settimeout的回调":["11.14"],"将函数插入到微任务队列":["11.15"],"tick队列比微任务队列先执行":["11.15"],"会造成同一份资源析构2次":["11.19"],"即delete同一块内存2次":["11.19"],"也不会影响":["11.20"],"封装私有变量和方法":["11.21"],"实现模块化开发":["11.21"],"保存函数执行状态和数据":["11.21"],"实现记忆化和缓存":["11.21"],"创建多个具有相同功能的函数":["11.21"],"实现柯里化和高阶函数":["11.21"],"处理异步回调":["11.21"],"释放内存":["11.23"],"从而导致这段内存无法释放":["11.24"],"程序对一段内存失去了控制":["11.24"],"才定义为内存泄漏":["11.24"],"如果找不到":["11.25"],"就会沿着作用域链中查找":["11.25"],"a为真时执行a":["11.28"],"prototype":["11.29","12.1","62.12"],"内容存在堆内存中":["11.30"],"tostring":["11.33","12.20","17.1","62.12"],"所以被判断为object":["11.35"],"转成boolean类型":["11.37"],"逻辑非运算符":["11.37"],"另一个操作数不是":["11.38"],"则调用对象的tostring":["11.38"],"方法":["11.38","28.4"],"也不大于":["11.39"],"所以是false":["11.39"],"所以是true":["11.40"],"左边为字符串":["11.41"],"转换为0":["11.41"],"最终为":["11.41"],"然后再变回小数":["11.42"],"tofixed":["11.42"],"性能不好":["11.42"],"false":["11.44","12.7","12.20","14.3","46.5"],"执行":["11.45"],"目标阶段":["11.47"],"但是与xhr无关":["11.48"],"不支持ie":["11.48"],"加载图片等外部文件":["11.49"],"event":["11.50","11.51"],"cancelbubble":["11.50"],"returnvalue":["11.51"],"会由于事件委托的原因":["11.52"],"自动接收到父元素的事件监听":["11.52"],"返回去重后的新数组":["11.53"],"number":["11.54","25.21","39.0"],"filter":["11.57"],"对数组所有项进行判断":["11.57"],"返回符合规则的新数组":["11.57"],"every":["11.57"],"数组每一项都符合规则才返回true":["11.57"],"some":["11.57"],"数组有符合规则的一项就返回true":["11.57"],"reduce":["11.57"],"m":["11.58"],"对num取m次幂":["11.58"],"random":["11.58"],"mm":["11.60"],"ddthh":["11.60"],"href":["11.62"],"获取整个url":["11.62"],"hash":["11.62"],"检索":["11.63"],"修改xhtml文档内容与结构":["11.63"],"因为":["11.63"],"document对象又是dom的根节点":["11.63"],"可以说":["11.63"],"bom包含了dom":["11.63"],"ello":["11.65"],"ell":["11.66"],"早期版本的js忽略了":["11.67"],"取决于":["11.68"],"type":["11.68","56.2"],"具有":["11.70"],"属性和按索引访问属性的能力":["11.70"],"使用扩展运算符":["11.71"],"遍历字符串的字符":["11.72"],"可以通过调用字符串的":["11.73"],"方法获得的迭代器对象":["11.73"],"typedarray":["11.73"],"int32array":["11.73"],"关键字会自动返回新创建的对象实例":["11.74"],"如果构造函数中有显式地返回一个对象":["11.74"],"鼠标指针相对于浏览器窗口可视区域左上角的垂直坐标":["11.75"],"pagex":["11.75"],"鼠标指针相对于整个文档页面左上角的水平坐标":["11.75"],"继承属性和方法":["12.1"],"true":["12.3","12.15","14.7","28.32","41.0"],"properties":["12.4"],"can":["12.4"],"be":["12.4"],"overwritten":["12.4"],"expected":["12.4","12.8","12.15"],"output":["12.4","12.8","12.10","12.15","12.25"],"strict":["12.6"],"console":["12.6","12.31","25.7","25.30","44.2","44.3","44.4","44.5","44.6","47.1","52.1","52.2","52.3","52.4","52.9","52.10","52.14","52.16","52.18","52.19","52.20","52.21","52.26","52.27","52.28","52.30","52.31","52.32","53.4","53.5","53.6","53.7","54.3","54.4","54.5"],"log":["12.6","12.31","13.2","25.7","25.30","44.1","44.2","44.3","44.5","44.6","52.4","52.5","52.8","52.9","52.14","52.16","52.18","52.19","52.21","52.27","52.30","52.32","53.4","53.5","53.6","53.7","54.1","54.2","54.3","54.5"],"etc":["12.7"],"冻结一个对象后该对象的原型也不能被修改":["12.9"],"属性的值":["12.11"],"fly":["12.13"],"is":["12.13","25.7","27.24"],"flying":["12.13"],"const":["12.13","16.2","28.14","50.1","50.2"],"superman":["12.13"],"new":["12.13","16.2","49.12","50.2"],"备注":["12.14"],"与":["12.14"],"instanceof":["12.14"],"运算符不同":["12.14"],"在表达式":["12.14"],"afunction":["12.14"],"value":["12.16","25.29","27.27","28.19","28.21","52.24","63.2"],"该数组对元素是":["12.17"],"obj自身拥有的枚举或不可枚举属性名称字符串":["12.17"],"0n":["12.22"],"array":["12.25"],"non":["12.26"],"arr":["12.30","14.4"],"then函数":["13.0"],"当执行了reject函数":["13.0"],"reject":["13.1"],"的状态":["13.1"],"实例的方法":["13.1"],"是用来抛出异常":["13.1"],"rej":["13.3"],"hi":["13.3"],"指向了promise原型对象":["13.4"],"then的返回值":["13.5"],"then方法是有返回值的":["13.5"],"catch的返回值":["13.6"],"execute":["13.7"],"e":["13.8"],"any":["13.8"],"与race类似":["13.8"],"只获取第一个状态为fulfilled":["13.8"],"如果全部为rejected则报错aggregateerror":["13.8"],"then调用后变为异步微任务":["13.9"],"has":["14.7"],"delete":["14.7"],"values":["14.8"],"将字典中包含的所有数值以迭代器形式返回":["14.8"],"entries":["14.8"],"返回所有成员的迭代器":["14.8"],"得到的是":["15.1"],"在浏览器中":["15.1"],"所有的全局变量和全局函数都会成为":["15.1"],"它的值指向触发事件的对象":["15.2"],"箭头函数中的":["15.2"],"在箭头函数中调用":["15.2"],"并尝试强制类型转换":["16.1"],"看看逻辑非运算符":["16.2"],"number1":["16.2"],"逻辑与运算符":["16.3"],"逻辑或运算符":["16.3"],"数组扁平化":["17.1"],"返回一个新数组":["17.1"],"字符串相关":["17.1"],"join":["17.1","50.1","50.2"],"将数组拼接成字符串":["17.1"],"tolocalstring":["17.1"],"本地化格式转字符串":["17.1"],"用":["17.1"],"分隔成字符串":["17.1"],"表示匹配以hello开头的字符串":["18.0"],"world":["18.0"],"表示匹配以world结尾的字符串":["18.0"],"匹配分组":["18.0"],"用圆括号":["18.0"],"表示分组":["18.0"],"可以将多个字符视为一个整体进行匹配":["18.0"],"创建一个声明文件":["19.1"],"作用是为了让组件有属性提示":["19.1"],"具名插槽做的":["19.2"],"文本域自适应高度":["19.2"],"比较复杂":["19.2"],"通过创建一个虚拟文本域":["19.2"],"通过window":["19.2"],"getcomputedstyle":["19.2"],"获取原生css对象":["19.2"],"getpropertyvalue":["19.2"],"获取css属性值":["19.2"],"把当前文本域的属性和值赋给虚拟文本域":["19.2"],"通过计算虚拟文本域的":["19.2"],"scrollhight":["19.2"],"总高度":["19.2"],"来计算真实文本域高度这里要判断":["19.2"],"actions写一些复杂的逻辑和异步逻辑":["19.7"],"不同平台可以共享相同的业务逻辑和数据处理功能":["19.9"],"更好的用户体验":["19.9"],"前后端分离可以通过前端技术的灵活性和交互性":["19.9"],"3的一个重要特性是使用quic代替了tcp作为传输层协议":["19.10"],"quic通过减少连接建立时间":["19.10"],"降低丢包重传延迟等优化":["19.10"],"提供更快的数据传输和更可靠的连接":["19.10"],"tls协议来确保通信的安全性和完整性":["19.11"],"然而":["19.11"],"中间人攻击利用了攻击者能够截取和篡改通信流量的位置":["19.11"],"wed":["19.12"],"may":["19.12"],"08":["19.12"],"00":["19.12"],"尽量使用":["19.13"],"动画或过渡":["19.13"],"以平滑地过渡":["19.13"],"避免突然的布局变化":["19.13"],"优化css和布局":["19.14"],"减少css文件的大小":["19.14"],"使用合适的选择器和样式规则":["19.14"],"避免过度嵌套和复杂的布局结构":["19.14"],"性能监测和优化":["19.14"],"使用性能分析工具":["19.14"],"使用工具如chrome开发者工具":["19.14"],"yaml文件中":["19.16"],"从而更好地管理依赖版本":["19.16"],"yarn":["19.17"],"commonjs":["20.1","20.5"],"模块有一个独立的静态解析阶段":["20.2"],"依赖关系的分析是在那个阶段完成的":["20.2"],"br":["20.3"],"如果不希望将后缀名改成":["20.3"],"mjs":["20.3"],"可以在项目的package":["20.3"],"require":["20.4","25.32"],"不支持":["20.4"],"模块的一个原因是":["20.4"],"它是同步加载":["20.4"],"cjs文件总是以":["20.5"],"优先输出process":["20.7"],"nexttick的值":["20.7"],"dirname":["20.8"],"rmdir":["20.9"],"localstorage的有效期是在不进行手动删除的情况下是一直有效的":["21.1"],"可能和浏览器有部分差异性":["21.2"],"不参与与服务端的通信":["21.3"],"比如ie8版本以下的都不支持":["21.5"],"无需再次带上用户名和密码":["21.7"],"然后去验证客户端请求里面带着token":["21.8"],"如果验证成功":["21.8"],"会有csrf攻击":["21.9"],"path":["21.10","26.11"],"cookie的使用路径":["21.10"],"则默认为当前路径":["21.10"],"安全标志":["21.10"],"secure":["21.10"],"vite启动开发服务器":["22.1"],"preview命令作用是实时预览打包后代码":["22.1"],"可以获取类型提示":["22.3"],"在终端执行pnpm":["23.0"],"默认在dist的main":["23.0"],"adminapp":["23.3"],"必须要绝对路径":["23.4"],"传递给下一个":["23.5"],"依此类推":["23.5"],"最后":["23.5"],"链中的最后一个":["23.5"],"返回":["23.5"],"preset":["23.6"],"env":["23.6"],"在package":["23.6"],"json中设置兼容列表":["23.6"],"htmlwebpackplugin":["23.7"],"template":["23.7","29.2","29.3"],"src":["23.7"],"查看堆栈跟踪或查看日志时":["23.9"],"你将看到原始的":["23.9"],"易于阅读的代码":["23.9"],"vue的keepalive":["24.0"],"垃圾回收":["24.0"],"三栏布局实现":["24.0"],"diff":["24.0"],"vue数据双向绑定":["24.0"],"eventloop宏任务微任务":["24.0"],"js变量提升":["24.0"],"age":["25.1"],"接口类型定义":["25.2"],"interface":["25.2"],"serachfunc":["25.2"],"item":["25.3","52.10"],"let":["25.3","25.26"],"a":["25.3","39.0","51.2"],"error":["25.5","25.19"],"else":["25.8"],"类型成为了类型系统的顶级类型":["25.9"],"upname":["25.10"],"tolowercase":["25.10"],"typeof":["25.10"],"if":["25.10","27.49"],"string":["25.10"],"更宽泛的类型":["25.11"],"least":["25.11"],"specific":["25.11"],"和大":["25.11"],"可以互相代替":["25.11"],"用来表示原始类型":["25.11"],"语句推断函数返回的类型":["25.12"],"specifiedboolean":["25.16"],"对象的形状":["25.18"],"shape":["25.18"],"push":["25.19","27.22","28.4","38.4","52.22","52.23"],"girl":["25.23"],"起别名不会新建一个类型":["25.24"],"它创建了一个新":["25.24"],"名字来引用那个类型":["25.24"],"div":["25.26","27.49"],"createelement":["25.26"],"类别名扩展接口":["25.28"],"表示对象中的键类型":["25.29"],"v":["25.29","29.2"],"表示对象中的值类型":["25.29"],"partial":["25.32"],"requird":["25.32"],"将类型的属性变成可选":["25.32"],"是代表移除":["25.32"],"pick":["25.32"],"uri":["26.2"],"html":["26.2"],"page的一个渲染":["26.3"],"改变会触发":["26.4"],"onhashchange":["26.4"],"不匹配任何静态资源":["26.5"],"它应提供与你的应用程序中的":["26.5"],"go":["26.6"],"redirect":["26.6"],"通常用于在组件实例化之":["26.7"],"前获取数据或执行其他异步操作":["26.7"],"当异步操作完成后":["26.7"],"通过调用next函数来确认导航":["26.7"],"你可以将实例化后的组件作为参数传递给next函数":["26.7"],"这样组件将被渲染并加载到页面中":["26.7"],"beforerouteupdate":["26.7"],"在当前路由改变":["26.7"],"但是该组件被复用时调用":["26.7"],"因为在这种情况发生的时候":["26.7"],"组件已经挂载好了":["26.7"],"失活的组件beforerouteleave":["26.8"],"复用的组件beforerouteupdate":["26.8"],"组件解析后beforeresolve":["26.8"],"等到需要访问组件的时候才进行真正的加载":["26.9"],"chunk":["26.10"],"中":["26.10"],"router":["26.11"],"createrouter":["26.11"],"routes":["26.11"],"导航完成之前获取":["26.13"],"导航完成前":["26.13"],"在路由进入的守卫中获取数据":["26.13"],"命名路由参数":["26.14"],"可以在路由定义中使用命名的路由参数":["26.14"],"适用于标识资源的唯一性":["26.15"],"适用于传递可选参数":["26.15"],"过渡和动画":["27.1"],"hash和history路由实现浏览器url变化而不刷新页面":["27.2"],"组件销毁前调用":["27.3","34.0"],"destroyed":["27.3","34.0"],"onunmounted":["27.3"],"组件销毁完成调用":["27.3"],"等":["27.5"],"还没开始销毁":["27.5"],"此时刚刚脱离运行阶段":["27.5"],"父beforedestroy":["27.6"],"子beforedestroy":["27.6"],"子destroyed":["27.6"],"if则更适合条件不经常改变的场景":["27.8"],"因为它切换开销相对较大":["27.8"],"根据数组中的某个元素进行v":["27.9"],"if判断的时候就会报错":["27.9"],"因为v":["27.9"],"watch在页面首次加载的时候默认不会执行":["27.10"],"需要设置immediate":["27.10"],"true首次才会执行监听":["27.10"],"有异步请求的用wach":["27.12"],"vuex":["27.14"],"当data属性值变化后":["27.15"],"render函数执行":["27.15"],"是懒执行":["27.16"],"也就是说第一次初始化之后":["27.16"],"便不会执行计算":["27.16"],"本身所有数据对应一个":["27.17"],"在响应数据初始化时是不会执行回调函数的":["27.18"],"vue3中将beforecreate和created合并到了setup函数中":["27.19","33.3"],"根节点":["27.19"],"vue3组件允许多个根节点":["27.19"],"而vue2只允许一个":["27.19"],"例如beforecreate":["27.20"],"created等":["27.20"],"这些钩子函数允许开发者在不同的阶段执行自定义的逻辑":["27.20"],"编译和挂载":["27.20"],"vue会将组件的虚拟dom渲染为实际的dom":["27.20"],"并将其挂载到指定的dom元素上":["27.20"],"这个过程中":["27.20"],"观察者对象":["27.21"],"它会订阅":["27.21"],"被劫持的属性":["27.21"],"的变化":["27.21"],"pop":["27.22","47.1"],"shift":["27.22"],"并且将当前组件的实例传进来":["27.23"],"所以在插件中就可以对这个实例进行一些操作来实现我们插件的功能":["27.23"],"slotprops":["27.24"],"my":["27.24"],"and":["27.24"],"i":["27.24"],"ref":["27.25","41.0"],"expose":["27.25"],"兄弟组件传值":["27.25","34.4"],"eventbus":["27.25","34.4"],"getfileslist":["27.27"],"fileslist":["27.27"],"父":["27.27"],"vue3直接用":["27.29"],"p":["27.30"],"场景":["27.31"],"当我们异步获取结果并赋值给state的时候":["27.31"],"比如数据请求":["27.31"],"count":["27.32"],"通过函数方式去使用的时候":["27.32"],"函数接受一个":["27.32"],"的参数":["27.32"],"就是":["27.32"],"仓库中的":["27.32"],"更符合开发者的开发习惯":["27.33"],"pinia中抛弃传统的":["27.33"],"mutation":["27.33"],"只有":["27.33"],"getter":["27.33"],"简化状态管理库":["27.33"],"状态state的修改可以直接进行修改":["27.33"],"alive有两个生命周期":["27.35"],"分别是activated和deactivated":["27.35"],"activated钩子会在首次挂载或者每次从缓存中被重新插入的时候调用":["27.35"],"执行顺序":["27.36"],"被缓存起来了":["27.37"],"可以降低代码冗余提高逻辑复用性":["27.38"],"缺点":["27.38"],"命名容易冲突":["27.38"],"数组新增修改":["27.39"],"movie":["27.41"],"mp4":["27.41"],"则会进入挂起状态等待异步组件加载完毕":["27.42"],"在挂起状态期间":["27.42"],"展示的是":["27.42"],"这时候便需要调用nexttick函数在它的回调函数中获取到变化后的dom":["27.44"],"利用了异步任务在同步任务之后执行的原理":["27.44"],"从而找到差异的部分":["27.46"],"最后渲染到真实的dom节点上面":["27.46"],"其实":["27.47"],"完成diff过程":["27.48"],"当所有子节点都比较完成后":["27.48"],"diff算法就完成了":["27.48"],"js会根据diff算法生成一系列需要进行的dom操作":["27.48"],"如添加":["27.48"],"删除":["27.48"],"showdatils":["27.50"],"更新循环结束后才能获取到更新后的":["27.51"],"在这种情况下":["27.51"],"可以使用":["27.51"],"所以说能加key就加key":["27.52"],"拿到数据后再default":["27.53"],"显示出来":["27.53"],"子组件的内容":["27.55"],"两者直接联系":["28.2"],"被观察这改变时直接向所有观察者发送消息":["28.2"],"而两个角色之间还有一个":["28.3"],"依赖收集和管理":["28.3"],"的角色":["28.3"],"提供一些观察者的操作方法":["28.3"],"sub":["28.4"],"只有此时的依赖目标":["28.4"],"实例":["28.4"],"存在时才收集依赖":["28.4"],"发送更新":["28.4"],"遍历依赖数组分别执行每个观察者定义好的":["28.4"],"对象主要功能是做依赖收集":["28.5"],"维护多个":["28.5"],"当更新时候循环调用每个":["28.5"],"notify":["28.8","28.15"],"这里第二次调用":["28.9"],"设置的新值也要被监听":["28.9"],"c":["28.9","50.2"],"因为数据变化触发setter方法":["28.11"],"发布依赖":["28.11"],"通知watcher":["28.11"],"watcher收到后执行回调":["28.11"],"dep类收集的依赖是watcher":["28.12"],"watcher的依赖是data数据":["28.12"],"对存储的数据进行更新":["28.13"],"segments":["28.13"],"split":["28.13"],"foreach":["28.14","28.29"],"s":["28.14"],"数据被改变了":["28.15"],"我要把新的值渲染到页面上去":["28.15"],"watcher设置在全局中读取数据":["28.15"],"因为读取了数据":["28.15"],"新增的一个构造函数":["28.16"],"用来创建一个":["28.16"],"目标对象的代理对象":["28.16"],"但是":["28.17","48.15"],"只有通过":["28.17"],"proxyobj":["28.17"],"进行操作的时候才能通过定义的操作拦截方法进行处理":["28.17"],"直接使用原对象则无法触发拦截器":["28.17"],"这也是":["28.17"],"vue":["28.17"],"中要求的":["28.17"],"reactive":["28.17"],"trigger":["28.18"],"进行依赖更新":["28.18"],"通过对象":["28.18"],"与属性":["28.18"],"reactiveeffect":["28.20","28.21"],"在派发更新时就能准确的找到这些被收集起来的副作用函数":["28.23"],"当数据发生更新时再次执行它":["28.23"],"与传统观察者模式不同":["28.24"],"当数据更新时触发":["28.24"],"等一系列":["28.24"],"接受一个对象":["28.25"],"不论是响应式还是普通的":["28.25"],"或是一个":["28.25"],"返回一个原值的只读代理":["28.25"],"deleteproperty":["28.26"],"操作会直接拦截报错":["28.26"],"提示禁止更新":["28.26"],"至于":["28.26"],"设值时自动通知更新":["28.32"],"所以实际是是设置receiver的key的值为value":["28.33"],"但这可不是直接":["28.33"],"proxy的set对应reflect":["28.34"],"还允许开发者自定义指令":["29.0"],"面试经常会问什么是自定义指令":["29.0"],"input":["29.2"],"h1":["29.3"],"button":["29.3","55.2","56.2"],"click":["29.3"],"changecolor":["29.3"],"hello":["29.3"],"下":["29.4"],"use":["29.6"],"mount":["29.6"],"复制成功":["30.0","42.0"],"removechild":["30.0","42.0"],"updated":["30.0","42.0"],"以提供快速":["33.0"],"流畅的用户体验":["33.0"],"持续维护和更新":["33.0"],"持续集成和测试":["33.1"],"创建一个新的提交":["33.2"],"反做目标版本":["33.2"],"vue2中是通过object":["33.3"],"defineproperty对数据劫持实现的":["33.3"],"vue3中则是使用proxy对数据代理实现的":["33.3"],"生命周期区别":["33.3"],"利用了现代浏览器的缓存机制":["33.5"],"将构建的结果缓存到本地":["33.5"],"避免了重复构建相同的模块":["33.5"],"cancel":["33.6"],"方法来中止请求":["33.6"],"函数循环执行":["33.7"],"pipe":["33.7"],"args":["33.7"],"result":["33.7","52.11","54.1"],"beforedestroy":["34.0"],"onbeforeunmount":["34.0"],"而在mounted中html渲染出来了可以直接操作dom":["34.1"],"如果data是一个对象那么所有的组件都会共享这个data对象":["34.2"],"当需要对特定的请求进行拦截时":["34.3"],"可以通过":["34.3"],"creat":["34.3"],"mitt":["34.4"],"它包含了父组件在使用子组件时传递给子组件的所有非":["34.4"],"可以将":["34.5"],"分割成多个小模块":["34.5"],"每个模块都有自己的":["34.5"],"是一个用于修改状态的特殊方法":["34.6"],"它允许你以更简洁的方式更新状态":["34.6"],"而不需要显式地编写一个":["34.6"],"而无需编写计算逻辑":["34.7"],"map":["36.0"],"watch用于监听数据的变化并执行操作":["36.2"],"适用于当需要在数据变化时执行异步或复杂的操作时":["36.2"],"computed用于根据依赖的数据动态计算属性值":["36.2"],"并缓存计算结果":["36.2"],"可以使用watch来监听路由的变化":["36.3"],"当路由发生变化时":["36.3"],"如更新页面内容":["36.3"],"请求新的数据":["36.3"],"记录路由历史等":["36.3"],"items":["36.6"],"定位":["36.10"],"滚动超过阈值后表现为":["36.10"],"对于":["36.10"],"减少数据的混乱和意外的副作用":["36.11"],"提高代码的可维护性和可预测性":["36.11"],"当用户点击按钮":["36.12"],"定时器触发或某个操作完成时":["36.12"],"可以使用异步操作来响应这些事件并执行相应的操作":["36.12"],"通过promise":["36.13"],"all方法":["36.13"],"可以等待多个promise同时完成":["36.13"],"事件循环":["36.14"],"负责协调同步任务和异步任务和任务队列之间的关系的机制":["36.14"],"不断地从任务队列中取出任务":["36.14"],"按照一定顺序执行":["36.14"],"以this作为fn函数执行时的上下文":["38.1"],"以args数组中的元素作为fn函数执行时的参数列表":["38.1"],"apply":["38.2"],"arguments":["38.2"],"alice":["38.4"],"coding":["38.4"],"字符串中的日期对象将被转换为字符串形式":["38.5"],"而不是原始的":["38.5"],"sum":["39.0"],"b":["39.0","52.15"],"输入正确数字":["39.0"],"settimeout":["39.0"],"第一个拒绝的":["40.1"],"proxy":["41.0"],"initvalue":["41.0"],"john":["44.4"],"temp":["45.2"],"newsize":["46.2"],"prime":["46.4"],"getprime":["46.4"],"resize":["46.4"],"tuple":["46.7"],"empty":["47.0"],"左":["48.1"],"右子树本身也都是二叉搜索树":["48.1"],"这也是二叉搜索树中":["48.2"],"搜索的来源":["48.2"],"返回树中最大的值":["48.3"],"remove":["48.3"],"left":["48.4"],"向右查找":["48.5"],"right":["48.5","48.7","48.8","48.10","56.1"],"遍历过程为":["48.7","48.8","48.9"],"访问根结点":["48.7"],"中序遍历其左子树":["48.8"],"处理当前节点":["48.9"],"后序遍历其左子树":["48.9"],"必然需要将parent的left或者right指向它的某一个子节点":["48.12"],"所以需要保存起来current的parent":["48.12"],"树中的节点关系不能向上的":["48.12"],"和链表非常相似":["48.12"],"boolean类型":["48.12"],"它用户记录我们是在current是在父节点的左侧还是右侧":["48.12"],"以便到时候设置parent的left或者right":["48.12"],"然后开始查找对应的key":["48.12"],"还是之前的思路":["48.12"],"isleftchild":["48.13"],"parent":["48.13"],"将删除节点的左子树赋值给successor":["48.15","48.16"],"warning":["48.15"],"警告":["48.15"],"对于删除15我们还缺少什么呢":["48.15"],"已经完成":["48.15"],"11的left指向了18":["48.15"],"18的right指向了13":["48.15"],"没有完成":["48.15"],"19怎么办":["48.15"],"寻找后继":["48.16"],"delnode要删除的节点":["48.16"],"successor后继节点":["48.16"],"successorparent后继节点的父节点":["48.16"],"delnode":["48.16"],"successorparent":["48.16"],"while":["49.2"],"removedata2":["49.9","49.11","49.12"],"position":["49.9","56.1","62.2"],"indexof":["49.9","51.2"],"head":["49.10"],"null":["49.10"],"break":["49.11","49.12"],"isempty":["49.11","49.12"],"size":["49.11","49.12"],"clear":["49.11","49.12"],"link":["49.11","49.12"],"普通js构造函数继承":["50.1"],"pq":["50.1","50.2"],"names":["51.2"],"flat":["52.13"],"infinity":["52.13"],"o":["52.15"],"result30":["52.20"],"concat":["52.26"],"与3差值大小进行排序":["52.29"],"result35":["52.31"],"arr3":["53.7"],"只需要引用下面这行代码":["55.2","59.2"],"你就可以看到流光按钮啦":["55.2"],"flowing":["55.2"],"流光按钮":["55.3"],"mini":["56.1"],"添加icon":["56.1"],"icon":["56.1"],"shuaxin":["56.1","59.1"],"刷新":["56.1"],"l":["56.2"],"primary":["56.2"],"plain":["56.2"],"按钮":["56.3"],"info":["56.8"],"pinglun":["56.8"],"sousuo":["59.1"],"xiaoxi":["59.1"],"zhihui":["59.1"],"gengduo":["59.1"],"fanhui":["59.1"],"选择你想要的图标":["59.2"],"name":["59.2"],"你就可以看到图标啦":["59.2"],"badge":["59.4"],"说明":["59.5"],"部分图标不支持添加颜色":["59.5"],"给td设置vertical":["62.2"],"align":["62.2"],"middle":["62.2"],"td元素里面":["62.2"],"除float":["62.2"],"absolute":["62.2"],"所有的块级":["62.2"],"非块级元素都会相对于td垂直居中":["62.2"],"给td设置text":["62.2"],"undefined首字母大写":["62.3"],"而不是拒绝处理该请求":["62.6"],"其他的不会":["62.7"],"可以指定一些特定形状":["62.8"],"只会执行第一个catch":["62.9"],"对象的键名可以是字符串和symbol值":["62.10"],"所以当键名为除了字符串和symbol值以外的其他类型值时":["62.10"],"都是需要转换为字符串的":["62.10"],"所以和情况一一样重复赋值":["62.11"],"call":["62.12"],"解决设置max":["62.14"],"higeht":["62.14"],"挂载到对象自身里":["63.2"],"庄子":["66.0"],"逍遥游":["66.0"],"错题集":["67.0"],"长点心":["67.0"]},{"0":["12.18","27.49","28.4","49.1","52.24"],"1":["12.13","25.3","28.8","46.3","46.7"],"2":["6.3","9.2","17.4","25.3","25.27","49.11"],"3":["12.22","16.2","25.3","28.9","49.11","49.12"],"4":["10.1","13.1","49.11","49.12","51.2"],"5":["0.6","2.7","10.1","15.2","27.39","49.11","49.12","52.6"],"6":["7.5","27.19","33.3"],"7":["2.10","7.5","9.17","10.2","12.31","17.1","39.0"],"8":["39.0"],"9":["11.75"],"10":["11.3","25.32","47.1","50.1","50.2","54.0"],"11":["52.7"],"12":["8.2"],"13":["8.2","16.3"],"16":["52.17"],"18":["25.1","52.17"],"20":["52.17"],"25":["25.20"],"60":["50.1"],"70":["50.1","50.2"],"100":["25.19","39.0"],"123":["11.3","27.49"],"222":["49.11","49.12"],"502":["9.15"],"503":["9.15"],"504":["9.15"],"505":["9.15"],"authorization":["0.2"],"bearer":["0.2"],"token":["0.2"],"result":["0.2","41.0"],"而且上传数据都是重要数据":["0.4"],"所以不论在安全性还是数据量级":["0.4"],"post是最好的选择":["0.4"],"ip地址和网址不同":["0.5"],"websocket协议使用":["0.6"],"单个tcp连接":["0.6"],"可以减少网络延迟和带宽占用":["0.6"],"从而提高通信的效率":["0.6"],"跨域支持":["0.6"],"与ajax请求不同":["0.6"],"websocket通信":["0.6"],"可以跨域":["0.6"],"进行":["0.6"],"不受同源策略的限制":["0.6"],"安全性":["0.6"],"websocket支持使用":["0.6"],"ssl":["0.6","9.8"],"tls加密":["0.6"],"连接":["0.6"],"从而保证通信的安全性":["0.6"],"重新发送原始请求":["0.8"],"catch":["0.8","40.0"],"处理刷新token失败的情况":["0.8"],"例如重定向到登录页":["0.8"],"console":["0.8","12.13","14.1","38.4","39.0","49.11","49.12","50.1","50.2","52.12","52.13","52.29"],"failed":["0.8"],"重定向到登录页或执行其他操作":["0.8"],"处理其他错误响应":["0.8"],"transform":["1.1"],"translate":["1.1"],"flexbox":["1.2"],"flex":["1.2"],"auto":["1.3","2.10"],"scroll":["1.3"],"指定了对应元素在主轴上的大小":["1.5"],"空间大小都一致":["1.6"],"才均分":["1.7"],"表现形式为最小内容宽度":["1.8"],"内容本身的宽度是多少就是多少":["1.9"],"类似":["1.11"],"但实际浏览器只是跳过了内容的渲染":["1.11"],"还保留着内容的渲染状态":["1.11"],"性能上有优势":["1.11"],"不过元素实际不在视窗内所以无法交互":["1.12"],"此方法对行内元素无效":["1.12"],"也算是一种隐藏方式":["1.13"],"5em就表示字体大小是父元素的一半为40px":["1.14"],"1vh":["1.15"],"就等于可视窗口高度的百分之一":["1.15"],"如果用户在移动设备上浏览网页":["1.16"],"浏览器会根据屏幕宽度自动调整基准字体大小":["1.16"],"使得网页元素的尺寸相对于屏幕宽度保持一定比例":["1.16"],"content属性定义了多根轴线的对齐方式":["1.17"],"如果项目只有一根轴线":["1.17"],"该属性不起作用":["1.17"],"从而达到我们布局的目的":["1.18"],"nowrap":["1.19"],"重绘过程":["1.20"],"浏览器需要为整个层进行重绘并重新上传到":["1.20"],"造成了极大的性能开销":["1.20"],"元素固定的相对偏移是相对于离它最近的具有滚动框的祖先元素":["1.21"],"如果祖先元素都不可以滚动":["1.21"],"那么是相对于viewport来计算元素的偏移量":["1.21"],"所以两个item中间的间距会比较大":["1.22"],"或当动画有一个延迟未开始播放时":["1.23"],"要应用到元素的样式":["1.23"],"play":["1.23"],"state":["1.23"],"指定动画是否正在运行或已暂停":["1.23"],"inline":["1.25","36.10"],"indent":["1.26"],"50px":["1.26"],"首行缩进":["1.26"],"属性":["1.27","2.1","6.17","11.68","34.4"],"class":["1.31"],"选择url片段标识符":["1.31"],"url":["1.31"],"fragment":["1.31"],"identifier":["1.31"],"与元素的id匹配的元素":["1.31"],"选择元素的第一个字母":["1.32"],"伪元素清浮动":["2.2"],"现在主流方法":["2.2"],"推荐使用":["2.2"],"的大小的总和":["2.3"],"默认使用标准盒模型":["2.3"],"或者滚动":["2.6"],"照片使用":["2.7"],"jpeg":["2.7"],"keyframes":["2.8"],"animation":["2.8"],"多列布局":["2.8"],"媒体查询":["2.8"],"改变背景颜色为红色":["2.9"],"网格布局":["2.10"],"grid":["2.10"],"利用grid布局的方式":["2.10"],"中间一栏设置为auto":["2.10"],"这种实现方式代码也非常简洁":["2.10"],"核心代码":["2.10"],"左右两栏固定宽度":["2.10"],"中间自适应宽度":["2.10"],"template":["2.10"],"columns":["2.10"],"var没有块级作用域":["3.6"],"let和const有块级作用域":["3.6"],"函数属于的是函数作用域而不是块级作用域":["3.7"],"对象的话":["3.7"],"又不能在里面let":["3.7"],"扩展运算符":["3.9"],"接受的时候只接一个":["3.12"],"函数可以被暂停和恢复":["3.14"],"因此可以用于实现复杂的状态机逻辑":["3.14"],"foo":["4.0"],"undefined":["4.0"],"它会将web页面和javascript脚本连接起来":["5.1"],"压入栈底":["5.2"],"然后经过分词器解析出来的第一个":["5.2"],"会被压入到栈中":["5.2"],"并创建一个":["5.2"],"添加到":["5.2"],"上":["5.2"],"解析到相关文件之后":["5.4"],"预解析线程会提前下载这些文件":["5.4"],"然后再执行":["5.6"],"最后再继续构建dom":["5.6"],"构建渲染树":["5.6"],"绘制页面":["5.6"],"文件下载完成之前有白屏":["5.6"],"事件触发":["5.7"],"load":["5.8"],"显示到屏幕上":["5.9","6.9"],"频繁操作还是会出现页面卡顿":["5.13"],"影响用户体验":["5.13"],"再将最终的":["5.14"],"对象映射成真实的":["5.14"],"交由浏览器去绘制":["5.14"],"中":["5.17","12.14"],"请求对象":["5.18"],"用于发送异步":["5.18"],"http":["5.18","9.15"],"请求":["5.18"],"open":["5.19"],"打开一个新的空白文档":["5.19"],"close":["5.19","5.24"],"关闭当前文档":["5.19"],"parentelement":["5.22"],"获取元素的父元素":["5.22"],"children":["5.22"],"返回一个htmlcollection对象":["5.22"],"包含了元素的子元素":["5.22"],"previouselementsibling":["5.22"],"获取元素的前一个兄弟元素":["5.22"],"nextelementsibling":["5.22"],"获取元素的后一个兄弟元素":["5.22"],"并加载指定的":["5.24"],"关闭当前窗口或标签页":["5.24"],"提供了对会话存储的访问":["5.25"],"可以在会话期间存储和读取数据":["5.25"],"指示事件的默认行为是否被取消的布尔值":["5.27"],"timestamp":["5.27"],"事件触发的时间戳":["5.27"],"冒泡和取消属性":["5.28"],"所以文档声明是必须的":["6.1"],"强调":["6.2"],"表示强调的文本":["6.2"],"可以通过display属性对行内元素和块级元素进行切换":["6.3"],"主要看第":["6.3"],"4三个值":["6.3"],"而下载的原理在于a标签所对应的资源浏览器无法解析":["6.5"],"于是浏览器会选择将其下载下来":["6.5"],"endif":["6.7"],"对可选用性产生负面影响的元素":["6.8"],"frame":["6.8"],"frameset":["6.8"],"noframes":["6.8"],"不会忽略":["6.10"],"target":["6.13"],"如果不是合成层":["6.14"],"则其依然会触发":["6.14"],"隐式合成":["6.15"],"一个或多个非合成元素应出现在堆叠顺序上的合成元素之上":["6.15"],"会被提升为合成层":["6.15"],"元素的渲染等":["6.16"],"清晰地定义其内容":["6.18"],"移动设备等":["6.19"],"以有意义的方式来渲染网页":["6.19"],"iframe元素会加载嵌入的文档":["6.20"],"从而对网页的性能和加载速度产生一定的影响":["6.20"],"需要注意优化":["6.20"],"以最低的成本来提高你网站的排名":["7.1"],"查看是否有非法信息":["7.5"],"服务器速度":["7.5"],"推广":["7.5"],"图片添加有意义的alt属性":["8.2"],"在form表单中增加label":["8.2"],"以增加用户友好度":["8.2"],"代码维护简单":["8.3"],"便于改版":["8.3"],"通过session会话保存":["9.2"],"所以被称为tcp":["9.3"],"ip协议":["9.3"],"比":["9.4"],"协议安全":["9.4"],"中预留给能够将连接改为通道方式的代理服务器":["9.8"],"通常用于":["9.8"],"加密服务器的链接":["9.8"],"经由非加密的":["9.8"],"代理服务器":["9.8"],"浏览器再发送data":["9.9"],"ok":["9.9","25.23"],"更稳定也更可靠":["9.10"],"since配合":["9.11"],"用于缓存控制":["9.11"],"cache":["9.11"],"control":["9.11"],"取值一般为no":["9.11"],"max":["9.11"],"age":["9.11"],"xx":["9.11"],"xx为整数":["9.11"],"表示资源缓存有效期":["9.11"],"秒":["9.11"],"属性记录的就是该请求体的长度":["9.12"],"服务器端错误":["9.14"],"服务器未能实现合法的请求":["9.14"],"服务器不具备完成请求的功能":["9.15"],"例如":["9.15","26.14"],"服务器无法识别请求方法时可能会返回此代码":["9.15"],"错误网关":["9.15"],"服务器作为网关或代理":["9.15"],"从上游服务器收到无效响应":["9.15"],"服务不可用":["9.15"],"服务器目前无法使用":["9.15"],"由于超载或停机维护":["9.15"],"这只是暂时状态":["9.15"],"网关超时":["9.15"],"但是没有及时从上游服务器收到请求":["9.15"],"版本不受支持":["9.15"],"服务器不支持请求中所用的":["9.15"],"协议版本":["9.15"],"渲染页面":["9.17"],"检查缓存":["9.18"],"缓存":["9.19"],"以太网协议":["9.20"],"传输信息":["9.20"],"发送能力正常":["9.25"],"服务器自己的发送":["9.25"],"接收能力也正常":["9.25"],"报文之后":["9.26"],"就处于关闭连接了":["9.26"],"处于closed状态":["9.26"],"地址的网络部分和主机部分":["9.28"],"提供无连接的":["9.29"],"不可靠的数据传输":["9.29"],"选择使用":["9.29"],"还是":["9.29","19.2"],"取决于具体的应用需求":["9.29"],"来维护状态":["9.30"],"可以包含一些用户信息":["9.31"],"但通常不存储在服务器端":["9.31"],"而是在令牌本身进行加密和验证":["9.31"],"常见的":["9.31"],"实现方式包括":["9.31"],"json":["9.31"],"web":["9.31"],"jwt":["9.31"],"限制页面中可以执行的脚本":["10.1"],"httponly":["10.1","21.10"],"和":["10.1"],"secure":["10.1"],"标记":["10.1"],"防止":["10.1"],"cookie":["10.1"],"被窃取":["10.1"],"对于前端框架和第三方组件":["10.1"],"要及时更新到最新版本":["10.1"],"避免已知的安全漏洞":["10.1"],"社交工程和恶意行为":["10.2"],"web安全还需要考虑社交工程和恶意行为":["10.2"],"如钓鱼":["10.2"],"恶意软件等":["10.2"],"用户教育和意识提高可以帮助减少这些攻击的风险":["10.2"],"注入到网页中":["10.3"],"使其在用户浏览器中执行":["10.3"],"添加验证码":["10.4"],"不信任外部数据":["10.5"],"及时更新软件和框架等":["10.5"],"以减少潜在的安全漏洞":["10.5"],"array":["11.1","12.30","36.0"],"用于表示不是一个数字":["11.3"],"它不等于任何值":["11.3"],"包括它本身":["11.3"],"在":["11.3"],"之前":["11.3"],"windows":["11.3"],"对象提供了一个全局方法":["11.3"],"用于判断一个数字是不是":["11.3"],"对于字符串的检测结果也是":["11.3"],"但这其实并不严谨":["11.3"],"它对要判断的数据做了一个隐式类型转换":["11.3"],"先转为数字再进行判断":["11.3"],"而nan":["11.3"],"的检测应该仅限于数字类型":["11.3"],"所以":["11.3"],"提供了":["11.3"],"方法":["11.3","34.6","48.4"],"它能判断一个值是否严格等于nan":["11.3"],"而每一个宏任务都有一个自己的微任务队列":["11.11"],"每轮循环都是由一个宏任务":["11.11"],"多个微任务组成":["11.11"],"process":["11.12"],"nexttick等":["11.12"],"在下一轮事件循环中也能得到同步":["11.13"],"小于4ms执行setimmediate的回调":["11.14"],"造成程序崩溃":["11.19"],"就像地址一样的两个不同的个体":["11.20"],"保留回调函数中的变量状态等":["11.21"],"闭包里的变量会一直存在于内存中":["11.21"],"不会被回收":["11.21"],"当闭包函数被销毁时才会被回收":["11.21"],"注意内存泄漏":["11.21"],"泄露的本在在于程序是否能控制":["11.24"],"一直到全局作用域":["11.25"],"nan":["11.26"],"call":["11.29","12.30"],"arr":["11.29"],"false":["11.34","11.51","14.7","25.23","27.50"],"用得到的基本类型值按照前面的规则进行比较":["11.38"],"不推荐":["11.42"],"load触发":["11.49"],"true":["11.50","11.65","11.66","12.12","25.16","46.5","49.4","49.7"],"quchong":["11.53"],"接收上一个return和数组的下一项":["11.57"],"flat":["11.57"],"数组扁平化":["11.57"],"slice":["11.57"],"截取数组":["11.57"],"返回被截取的区间":["11.57"],"取0":["11.58"],"num的随机数":["11.58"],"ss":["11.60"],"sssz":["11.60"],"origin":["11.62"],"获取当前域名":["11.62"],"navigator":["11.62"],"获取当前浏览器信息":["11.62"],"对象":["11.63","38.5"],"浏览器提供出来给予访问的是bom对象":["11.63"],"从bom对象再访问到dom对象":["11.63"],"从而js可以操作浏览器以及浏览器读取到的文档":["11.63"],"i":["11.70","28.4"],"char":["11.72"],"h":["11.72"],"e":["11.72","25.29"],"l":["11.72"],"o":["11.72","12.26"],"float64array":["11.73"],"等":["11.73"],"表示固定类型的数组":["11.73"],"nodelist":["11.73"],"dom":["11.73"],"操作返回的节点列表":["11.73"],"关键字会返回这个对象而不是新创建的对象实例":["11.74"],"pagey":["11.75"],"鼠标指针相对于整个文档页面左上角的垂直坐标":["11.75"],"目标对象":["12.3"],"接收源对象属性的对象":["12.3"],"也是修改后的返回值":["12.3"],"sources":["12.3"],"源对象":["12.3"],"包含将被合并的属性":["12.3"],"expected":["12.6","12.12","12.31"],"output":["12.6","12.12","12.31"],"返回和传入的参数相同的对象":["12.9"],"clark":["12.13"],"kent":["12.13"],"log":["12.13","14.1","38.4","39.0","44.4","47.1","49.11","49.12","50.1","50.2","52.1","52.2","52.3","52.10","52.12","52.13","52.20","52.26","52.28","52.29","52.31","54.4"],"的原型链是针对":["12.14"],"进行检查的":["12.14"],"而不是针对":["12.14"],"本身":["12.14"],"undeclaredpropertyvalue":["12.19"],"都是同一个值":["12.21"],"非零且都不是":["12.21"],"argument":["12.26"],"will":["12.26"],"be":["12.26"],"coerced":["12.26"],"f":["12.26"],"catche函数":["13.0"],"是用来处理异常":["13.1"],"reject后的东西":["13.1"],"一定会进入then中的第二个回调":["13.1"],"如果then中没有写第二个回调":["13.1"],"则进入catch":["13.1"],"网络异常":["13.1"],"比如断网":["13.1"],"会直接进入catch而不会进入then的第二个回调":["13.1"],"当我调用reject之后":["13.2"],"在调用resolve是无效的":["13.2"],"因为状态已经发生改变":["13.2"],"并且是不可逆的":["13.2"],"它的返回值是promise":["13.5"],"那它的状态如何决定":["13.5","13.6"],"返回一个普通值":["13.5"],"状态":["13.5"],"fulfilled":["13.5"],"明确返回一个promise":["13.5"],"返回一个thenable对象":["13.5"],"返回值是promise":["13.6"],"如果返回值明确一个promise或者thenable对象":["13.6"],"取决于你调用了resolve还是reject":["13.6"],"promise处理错误的方式有两种":["13.8"],"第一种在then中传递两个回调":["13.8"],"第二个回调是错误回调":["13.8"],"状态改变只有两种结果":["13.8"],"完成或者失败":["13.8"],"foreach":["14.8","28.22"],"遍历字典的所有成员":["14.8"],"return":["14.9","14.10","25.30","45.5","46.1"],"对象的属性或方法":["15.1"],"所以可以通过访问":["15.1"],"对象来访问全局变量和全局函数":["15.1"],"它的值指向外层作用域中的":["15.2"],"这是因为箭头函数没有自己的执行上下文":["15.2"],"它的上下文由外层作用域提供":["15.2"],"立即执行函数的this指向全局作用域":["15.2"],"bind":["15.3"],"number2":["16.2"],"条件运算符":["16.3"],"赋值运算符":["16.3"],"其他":["17.1"],"entries":["17.1"],"返回一个新的数组迭代器对象类似generator":["17.1"],"reduce":["17.1"],"累加器返回一个新数组":["17.1"],"reduceright":["17.1"],"累加器从右往左返回一个新数组":["17.1"],"reverse":["17.1"],"颠倒数组":["17.1"],"ab":["18.0"],"表示匹配一个或多个ab连续出现的字符串":["18.0"],"这些只是正则表达式的基础":["18.0"],"实际上它们还可以实现更复杂的匹配逻辑":["18.0"],"在编写正则表达式时":["18.0"],"您还可以使用一些特殊字符和标志":["18.0"],"这些字符和标志有特定的含义和用法":["18.0"],"可以帮助您更精确地控制匹配过程":["18.0"],"boxsizing":["19.2"],"是":["19.2"],"borderbox":["19.2"],"contentbox":["19.2"],"如果是borderbox":["19.2"],"高度要加上":["19.2"],"上下boreder的高度":["19.2"],"如果是":["19.2"],"高度要减去":["19.2"],"上下padding的高度":["19.2"],"然后清空虚拟文本域计算单行行高":["19.2"],"设置最小行数的高度和最大行数的高度":["19.2"],"最后把虚拟文本域移除":["19.2"],"提供更丰富":["19.9"],"动态和响应式的用户界面":["19.9"],"这可以改善用户体验并提高用户满意度":["19.9"],"3旨在进一步提升性能":["19.10"],"降低延迟":["19.10"],"并解决某些网络环境下tcp存在的一些问题":["19.10"],"如丢包恢复速度慢":["19.10"],"拥塞控制等":["19.10"],"以破坏通信的安全性":["19.11"],"gmt表示资源文件将在指定日期之后过期":["19.12"],"推荐的做法是结合使用cache":["19.12"],"control和expires字段":["19.12"],"以提供更好的缓存控制和兼容性":["19.12"],"避免动态内容":["19.13"],"尽量避免在页面加载后动态插入或移除内容":["19.13"],"或者在动态内容加载前预留足够的空间":["19.13"],"lighthouse等来分析和监测应用的性能指标":["19.14"],"发现潜在的性能瓶颈并进行优化":["19.14"],"定期优化和更新":["19.14"],"持续监测应用的性能":["19.14"],"定期进行优化和更新":["19.14"],"以适应不断变化的平台和设备环境":["19.14"],"可靠性":["19.16"],"workspaces":["19.17"],"cjs":["20.1"],"这两种模块不兼容":["20.1"],"最底层的模块第一个执行":["20.2"],"json文件中":["20.3"],"指定type字段为module":["20.3"],"模块内部可以使用顶层await命令":["20.4"],"导致无法被同步加载":["20.4"],"js文件的加载取决于package":["20.5"],"json里面type字段的设置":["20.5"],"就向客户端返回请求的数据":["21.8"],"服务端验证token":["21.8"],"表示该cookie只能通过https连接传输":["21.10"],"httponly标志":["21.10"],"表示该cookie只能通过http协议访问":["21.10"],"无法通过javascript脚本访问":["21.10"],"dirname":["23.4"],"dist":["23.4"],"所期望的":["23.5"],"loader要放在style":["23.5"],"loader后面":["23.5"],"browserslist":["23.6"],"defaults":["23.6"],"index":["23.7"],"html":["23.7","26.5"],"而不是压缩后的代码":["23.9"],"this指向":["24.0"],"html语义化":["24.0"],"callapplybind":["24.0"],"箭头函数":["24.0"],"数组去重":["24.0"],"ljt":["25.1"],"tostring":["25.4","51.1"],"typescript":["25.7"],"在这里是":["25.8"],"除了never本身没有人可以给他赋值":["25.8"],"const":["25.8","49.11","49.12"],"check":["25.8"],"类型断言":["25.10"],"as":["25.10"],"除外":["25.11"],"和非原始类型":["25.11"],"而小":["25.11"],"则表示非原始类型":["25.11"],"编译器就会知道该属性会被明确地赋值":["25.15"],"boolean":["25.17"],"进行描述":["25.18"],"然后将这个myobj再赋值给labeledobj":["25.21"],"此时根据类型的兼容性":["25.21"],"两种类型对象":["25.21"],"参照鸭式辨型法":["25.21"],"因为都具有label属性":["25.21"],"所以被认定为两个相同":["25.21"],"故而可以用此法来绕开多余的类型检查":["25.21"],"给基本类型起别名通常没什么用":["25.24"],"尽管可以做为文档的一种形式使用":["25.24"],"b":["25.26","50.1","50.2","51.2"],"typeof":["25.26"],"element":["25.29"],"表示元素类型":["25.29"],"ts泛型":["25.29"],"从某个类型中挑出一些属性出来":["25.32"],"record":["25.32"],"的作用是将":["25.32"],"中所有的属性的值转化为":["25.32"],"类型":["25.32"],"告诉nginx如果按顺序检查文件是否存在":["26.2"],"若不存在则重定向到index":["26.2"],"html文件":["26.2"],"事件":["26.4"],"相同的页面":["26.5"],"漂亮依旧":["26.5"],"在路由配置中使用":["26.6"],"导航守卫可以访问组件实例":["26.7"],"this":["26.7","27.24"],"beforerouteleave":["26.7"],"在离开当前组件时调用":["26.7"],"与":["26.7"],"一样":["26.7"],"它可以访问组件实例":["26.7"],"导航确认":["26.8"],"dom更新":["26.8"],"users":["26.11"],"id":["26.11"],"在数据获取成功后执行导航":["26.13"],"的参数在路径中可见":["26.15"],"对于敏感信息或较长的参数可能不太适合":["26.15"],"而":["26.15"],"的参数不会在路径中显示":["26.15"],"vue支持在组件间添加过渡效果和动画":["27.1"],"vue3也兼容vue2的选项式api":["27.3"],"vue3使用选项式api生命周期和vue2一样":["27.3"],"vue3的组合式api生命周期有所变化":["27.3"],"methods":["27.5"],"指令之类的都在正常运行":["27.5"],"destroyed":["27.5"],"onunmounted":["27.5","34.0"],"组件销毁完毕":["27.5"],"父destroyed":["27.6"],"销毁":["27.6"],"if会先执行此时还没有拿到这个数组":["27.9"],"所以vue3中依然不建议这样使用":["27.9"],"watch默认只监听一层数据":["27.10"],"不监听多层数据里属性的变化":["27.10"],"需要设置deep":["27.10"],"true才会进行深度监听":["27.10"],"其他情况能用计算属性就首选计算属性":["27.12"],"computed属性函数执行并返回新执行结果":["27.15"],"下一次变更执行重新计算是在":["27.16"],"在响应数据初始化时就会立即执行回调函数":["27.18"],"内置组件":["27.19","33.3"],"vue3新增了传送组件teleport和异步依赖处理组件suspense":["27.19","33.3"],"vue会执行一系列的编译和补丁操作":["27.20"],"以确保dom的正确渲染和更新":["27.20"],"完成初始化":["27.20"],"vue完成初始化阶段":["27.20"],"组件已经准备就绪":["27.20"],"并且可以响应用户的交互和数据变化":["27.20"],"当属性发生变化时":["27.21"],"观察者对象会接收到通知":["27.21"],"并触发相应的更新操作":["27.21"],"unshift":["27.22"],"splice等方法的返回类型和参数类型都得到了改进":["27.22"],"am":["27.24"],"years":["27.24"],"old":["27.24"],"year":["27.24"],"mitt":["27.25"],"除了上面的传参方式你也可以回答vuex和pinia":["27.25"],"前提你了解这两个状态管理器":["27.25"],"因为你说了大概率下个问题就会问你vuex和pinia":["27.25"],"child":["27.27"],"value":["27.29","36.0"],"我们可以在actions中进行数据请求":["27.31"],"拿到结果通过它的dispatch方法调用mutations中修改state的函数":["27.31"],"从而将结果赋值给了state":["27.31"],"patchmethod":["27.32"],"或者在actions中修改":["27.33"],"或者使用它的":["27.33"],"patch方法进行修改":["27.33"],"pinia中没有了modules":["27.33"],"如果想使用多个store":["27.33"],"直接使用definestore定义多个store传入不同的id即可":["27.33"],"更好的ts支持":["27.33"],"不需要创建自定义的复杂包装器来支持ts":["27.33"],"此时组件被激活":["27.35"],"deactivated钩子则是在组件从dom上移除或者组件卸载时调用":["27.35"],"此时组件被缓存":["27.35"],"beforeupdate":["27.36"],"不好追溯源":["27.38"],"后期排查不方便":["27.38"],"proxy不兼容ie11及以下":["27.39"],"video将会被传送到id为popup的元素下":["27.41"],"fallback插槽内容":["27.42"],"使nexttick里的回调函数在最后调用立刻触发dom更新":["27.44"],"算法最重要的就是找到可复用的节点":["27.47"],"然后移动到正确的位置":["27.47"],"只不过不同的算法查找顺序不一样":["27.47"],"移动":["27.48"],"替换等":["27.48"],"js会将这些dom操作打包成批量更新操作":["27.48"],"通过一次性地应用到真实dom上":["27.48"],"以减少dom操作的次数":["27.48"],"来确保在":["27.51"],"更新后执行相关操作":["27.51"],"调用观察者的更新方法":["28.2"],"hr":["28.3","28.15"],"br":["28.3","28.15"],"vue2":["28.3"],"表达式解析":["28.4"],"function":["28.4"],"path":["28.4"],"segments":["28.4"],"split":["28.4"],"for":["28.4","28.13","33.7"],"let":["28.4","28.13"],"length":["28.4","49.2"],"执行更新":["28.5"],"watcher主要是用于更新":["28.5"],"而且是收集的重点对象":["28.5"],"obj":["28.8"],"a":["28.8","50.1","50.2","52.15","56.1","59.1"],"observe将一个正常的object转换为每个层级的属性都是响应式的":["28.9"],"observer中通过definereactive方法进行响应式的绑定":["28.9"],"在数据被读的时候":["28.9"],"触发getter方法":["28.9"],"执行dep来收集依赖":["28.9"],"也就是收集watcher":["28.9"],"在数据被改的时候":["28.9"],"触发setter方法":["28.9"],"触发依赖":["28.9"],"通过对应的所有依赖":["28.9"],"watcher":["28.9","28.24"],"去执行更新":["28.9"],"比如watch和computed就执行开发者自定义的回调方法":["28.9"],"通知组件":["28.11"],"通过虚拟dom和diff算法进行页面更新":["28.11"],"key":["28.13"],"of":["28.13","33.7"],"if":["28.13"],"update":["28.14"],"sub":["28.14"],"push":["28.14"],"所以触发getter方法":["28.15"],"在getter中就能得到当前正在读取数据的watcher":["28.15"],"并把这个watcher收到dep中":["28.15"],"vue3":["28.15"],"拦截对原对象的所有操作":["28.16"],"用户可以通过注册相应的拦截方法来实现对象操作时的自定义行为":["28.16"],"声明的对象修改原对象无法触发视图更新的原因":["28.17"],"并且":["28.17"],"也只针对":["28.17"],"引用类型数据":["28.17"],"才能进行代理":["28.17"],"所以这也是":["28.17"],"的基础数据都需要通过":["28.17"],"ref":["28.17"],"进行声明的原因":["28.17"],"内部会建立一个新对象保存原有的基础数据值":["28.17"],"coutner":["28.18"],"找到对应的":["28.18"],"副作用函数":["28.18","28.21"],"然后重新执行":["28.18"],"trigger":["28.19"],"依赖更新":["28.19"],"注意":["28.21"],"当我们调用":["28.21"],"时":["28.21"],"会将当前的副作用函数赋值给全局的":["28.21"],"所以此时我们可以正确的关联其依赖":["28.21"],"effect":["28.22","28.29"],"函数的执行来实现视图更新的":["28.24"],"deepreadonly":["28.25"],"操作的拦截两者的大体思路差不多":["28.26"],"不过":["28.26"],"因为只读的原因":["28.26"],"数据不会发生改变":["28.26"],"所以不会进行依赖收集操作":["28.26"],"如果有深层数据则会继续向内部进行同样的处理操作":["28.26"],"null":["28.27"],"add":["28.28"],"new":["28.32"],"proxy":["28.32"],"set":["28.34"],"你用自定义指令做过哪些功能":["29.0"],"不使用":["29.2"],"backgroundcolor":["29.3"],"bordercolor":["29.3"],"handleclick":["29.3"],"点击":["29.3"],"引入完成之后就可以在组件中使用v":["29.6"],"debounce":["29.6"],"unmounted":["30.0","42.0"],"良好的":["33.0"],"文档":["33.0"],"和示例":["33.0"],"根节点":["33.3"],"vue3组件允许多个根节点":["33.3"],"而vue2只允许一个":["33.3"],"但在生产环境下webpack打包的代码更小":["33.5"],"效率更高":["33.5"],"func":["33.7"],"组件销毁完成调用":["34.0"],"创建一个axios实例":["34.3"],"用这个实例对特定请求进行拦截":["34.3"],"子组件通过expose把需要暴露出来的属性暴露出来":["34.4"],"父组件通过inject接收":["34.4"],"并且可以嵌套子模块":["34.5"],"mutations":["34.6"],"uniquearr":["36.0"],"from":["36.0"],"values":["36.0"],"适用于根据已有数据派生出新的数据":["36.2"],"以及在模板中使用计算结果":["36.2"],"通过使用watch":["36.3"],"可以监视数据的变化":["36.3"],"并在数据变化时执行相应的操作":["36.3"],"从而实现对数据的动态响应和处理":["36.3"],"属性为":["36.10"],"的元素":["36.10"],"设置":["36.10"],"position":["36.10"],"会被忽略":["36.10"],"这种机制允许程序与外部环境进行交互":["36.12"],"并根据需要作出反应":["36.12"],"race方法":["36.13"],"可以等待多个promise中的任何一个完成":["36.13"],"一定事件循环周期内":["36.14"],"先处理微任务队列中的任务在处理宏任务":["36.14"],"执行fn函数":["38.1"],"这样就可以保证函数在正确的上下文中执行":["38.1"],"并且能够正确地处理参数":["38.1"],"san":["38.4"],"francisco":["38.4"],"原始对象不受影响":["38.4"],"拷贝对象被修改":["38.4"],"date":["38.5"],"res":["39.0"],"err":["39.0","40.0"],"computed":["41.0"],"concat":["45.5"],"prime":["46.2"],"getprime":["46.2"],"resize":["46.2"],"put":["46.7"],"二叉树":["48.1"],"从树中移除某个键":["48.3"],"right":["48.4"],"先序遍历其左子树":["48.7"],"先序遍历其右子树":["48.7"],"递归图解":["48.7","48.8","48.9"],"先序遍历递归图解":["48.7"],"访问根结点":["48.8","48.9"],"中序遍历其右子树":["48.8"],"中序遍历递归图解":["48.8"],"后序遍历其右子树":["48.9"],"后序遍历递归图解":["48.9"],"依次向下找到节点":["48.12"],"同时记录current":["48.12"],"isleftchild这些变量":["48.12"],"如果遍历到current":["48.12"],"那么说明在二叉搜索树中没有该key":["48.12"],"直接返回false即可":["48.12"],"如果找到":["48.12"],"后面就需要我们进一步考虑更加复杂的情况了":["48.12"],"20这个左子树怎么办":["48.15"],"很明显":["48.15"],"19应该放在20的左边":["48.15"],"20应该放在18的右边":["48.15"],"19放在20的左边代码":["48.15"],"20放在18的右边代码":["48.15"],"图解删除":["48.15"],"data":["49.5","49.8"],"next":["49.6"],"remove":["49.9"],"links":["49.11","49.12"],"links2":["49.11","49.12"],"linkget":["49.11","49.12"],"c":["50.1","51.2"],"d":["51.2"],"infinity":["52.11","53.6","53.7"],"r":["52.15"],"arr3":["53.5","53.6"],"流光按钮":["55.2"],"dianhua":["56.1"],"电话":["56.1"],"pinglun":["56.1"],"评论":["56.1","56.8"],"licon":["56.1","59.2"],"name":["56.1"],"xiala2":["56.1","59.1"],"jinru":["56.1","59.1","59.2","59.3"],"按钮":["56.2"],"guanbi":["59.1"],"fenxiang2":["59.1"],"center":["62.2"],"td元素里面所有非block元素":["62.2"],"都会相对于td水平居中":["62.2"],"虽然block元素不居中":["62.2"],"但其中的文字或inline元素会水平居中":["62.2"],"undefinded":["62.4"],"第二个catch无结果":["62.9"],"以":["62.10"],"这种形式调用对象的键名时":["62.10"],"里面的键b一定要有引号":["62.10"],"必须为字符串或者是symbol":["62.10"],"如果不是字符串则转为字符串":["62.10"]}]'},e={"0.0":{t:"# ajax\r",p:"\r",l:"audition/ajax/ajax.html",a:"ajax"},"0.1":{t:"什么是ajax？ajax作用是什么？\r",p:`
a 异步的
j javascript a and
x xml
ajax用来与后台交互

`,l:"audition/ajax/ajax.html#什么是ajax-ajax作用是什么",a:"什么是ajax-ajax作用是什么"},"0.2":{t:"ajax 常见的方法\r",p:`
XHR

const xhr = new XMLHttpRequest();
xhr.open('GET', &quot;http://localhost:3000/goods&quot;)
xhr ...`,l:"audition/ajax/ajax.html#ajax-常见的方法",a:"ajax-常见的方法"},"0.3":{t:"json字符串转换集json对象、json对象转换json字符串\r",p:`//字符串转对象
JSON.parse(json)
eval('(' + jsonstr + ')')   
// 对象转字符串
JSON.stringify(json)


`,l:"audition/ajax/ajax.html#json字符串转换集json对象、json对象转换json字符串",a:"json字符串转换集json对象、json对象转换json字符串"},"0.4":{t:"ajax几种请求方式？他们的优缺点？\r",p:`常用的post,get,delete。不常用copy、head、link等等。

get
post

区别

post比get安全(因为post参数在请求体中。get参数在url上面)
get传输速度 ...`,l:"audition/ajax/ajax.html#ajax几种请求方式-他们的优缺点",a:"ajax几种请求方式-他们的优缺点"},"0.5":{t:"什么情况造成跨域？\r",p:`同源策略限制 不同源会造成跨域。




原因




http://
协议不同，http和https


www
子域名不同


baidu.com
主域名不同


8080
端口号不同


www ...`,l:"audition/ajax/ajax.html#什么情况造成跨域",a:"什么情况造成跨域"},"0.6":{t:"跨域解决方案有哪些？\r",p:`
jsonp 只能解决get跨域(问的最多)
原理：动态创建一个script标签。利用script标签的src属性不受同源策略限制。因为所有的src属性和href属性都不受同源策略限制。可以请求第三方 ...`,l:"audition/ajax/ajax.html#跨域解决方案有哪些",a:"跨域解决方案有哪些"},"0.7":{t:"使用axios怎么中止请求\r",p:`axios.CancelToken.source();
`,l:"audition/ajax/ajax.html#使用axios怎么中止请求",a:"使用axios怎么中止请求"},"0.8":{t:"axios的请求响应拦截\r",p:`
响应拦截

全局错误处理：你可以在响应拦截器中检查响应的状态码，并根据不同的状态码执行相应的操作。例如，如果响应状态码是401（未授权），你可以执行相应的操作，例如重新登录或跳转到登录页面。
统一的 ...`,l:"audition/ajax/ajax.html#axios的请求响应拦截",a:"axios的请求响应拦截"},"1.0":{t:"# CSS\r",p:"\r",l:"audition/css/css上篇.html",a:"css"},"1.1":{t:"1. 常见的水平垂直居中实现方案\r",p:`
最简单的方案当然是flex布局

.father {
    display: flex;
    justify-content: center;
    align-items: center; ...`,l:"audition/css/css上篇.html#_1-常见的水平垂直居中实现方案",a:"_1-常见的水平垂直居中实现方案"},"1.2":{t:"清除浮动\r",p:`清除浮动是为了解决浮动元素导致的父元素高度塌陷问题。
使用额外的空元素清除浮动：
&lt;div style=&quot;clear: both;&quot;&gt;&lt;/div&gt;

使用伪 ...`,l:"audition/css/css上篇.html#清除浮动",a:"清除浮动"},"1.3":{t:"2. BFC问题，触发BFC的元素\r",p:`BFC：块级格式化上下文,属于普通流，是一块独立的渲染区域，内部元素不会影响外部的元素。
如何触发？

根元素
float属性不是none position为absolute或者fixed
displ ...`,l:"audition/css/css上篇.html#_2-bfc问题-触发bfc的元素",a:"_2-bfc问题-触发bfc的元素"},"1.4":{t:" ",p:"",l:"audition/css/css上篇.html#",a:""},"1.5":{t:"3. felx是哪些属性的缩写，对应的属性代表什么含义\r",p:`flex在浏览器中查看分别是

flex-grow（设置了对应元素的增长系数）
flex-shrink(指定了对应元素的收缩规则，只有在所有元素的默认宽度之和大于容器宽度时才会触发)
flex-bas ...`,l:"audition/css/css上篇.html#_3-felx是哪些属性的缩写-对应的属性代表什么含义",a:"_3-felx是哪些属性的缩写-对应的属性代表什么含义"},"1.6":{t:"flex:1\r",p:`
flex: 1, 对应的是1 1 0%, 相当于可扩大，可缩小，flex-basis为0%
不管内容多少，一般都是平分空间，空间大小都一致

`,l:"audition/css/css上篇.html#flex-1",a:"flex-1"},"1.7":{t:"flex:auto\r",p:`
flex: auto, 对应的是1 1 auto, 相当于可扩大，可缩小，flex-basis为auto
flex: auto是根据内容的大小来分，不是均分的（除非内容都是一样，才均分）

`,l:"audition/css/css上篇.html#flex-auto",a:"flex-auto"},"1.8":{t:"flex: 0\r",p:`
flex: 0, 对应的是0 1 0%, 相当于不可扩大，可缩小，flex-basis为0%
不可扩大，可缩小,表现形式为最小内容宽度

`,l:"audition/css/css上篇.html#flex-0",a:"flex-0"},"1.9":{t:"flex: none\r",p:`
flex: none, 对应的是0 0 auto, 相当于不可扩大，不可缩小，flex-basis为auto
不可扩大，不可缩小，内容本身的宽度是多少就是多少

`,l:"audition/css/css上篇.html#flex-none",a:"flex-none"},"1.10":{t:"4. 隐藏元素的属性有哪些\r",p:"",l:"audition/css/css上篇.html#_4-隐藏元素的属性有哪些",a:"_4-隐藏元素的属性有哪些"},"1.11":{t:"1. 常规方法\r",p:`
display: none;（结构消失；会触发回流重绘性能消耗较大；非继承属性，子孙节点消失由于元素从渲染树消失造成，通过修改子孙节点属性无法显示）
visibility: hidden;（结构保留 ...`,l:"audition/css/css上篇.html#_1-常规方法",a:"_1-常规方法"},"1.12":{t:"2. 逃逸视窗\r",p:`
position + left/top（利用绝对定位 position 设置 absolute 或 fixed，同时 left 或 top 设置 -9999px；
超大负边距会将元素抛出视图，因为定 ...`,l:"audition/css/css上篇.html#_2-逃逸视窗",a:"_2-逃逸视窗"},"1.13":{t:"3. 移行变换\r",p:`
scale(0) / skew(90deg)（通过2D变换来达到隐藏，占据空间，不可交互。注意：此方法对行内元素无效！）
circle(0px)（利用裁剪创建元素的可显示区域，区域外会隐藏，占据空间 ...`,l:"audition/css/css上篇.html#_3-移行变换",a:"_3-移行变换"},"1.14":{t:"5. px 和 em 的区别\r",p:`
px全称pixel像素，是相对于屏幕分辨率而言的，它是一个绝对单位
em是一个相对长度单位，具体的大小需要相对于父元素计算，比如父元素的字体大小为80px，那么子元素1em就表示大小和父元素一样为8 ...`,l:"audition/css/css上篇.html#_5-px-和-em-的区别",a:"_5-px-和-em-的区别"},"1.15":{t:"6. vw、vh 是什么？\r",p:`vw 和 vh 是 CSS3 新单位，即 view width 可视窗口宽度 和 view height 可视窗口高度。1vw 就等于可视窗口宽度的百分之一，1vh 就等于可视窗口高度的百分之一。
`,l:"audition/css/css上篇.html#_6-vw、vh-是什么",a:"_6-vw、vh-是什么"},"1.16":{t:"自适应布局rem\r",p:`自适应布局使用rem作为单位，其原理是基于浏览器默认字体大小的相对值来计算元素的尺寸，实现不同屏幕尺寸下的自适应布局。
在HTML的&lt;head&gt;标签中设置基准字体大小，一般为16px。然后 ...`,l:"audition/css/css上篇.html#自适应布局rem",a:"自适应布局rem"},"1.17":{t:"7. flex 布局如何使用\r",p:`flex 是 Flexible Box 的缩写，意为&quot;弹性布局&quot;。指定容器display: flex即可。
容器有以下属性：flex-direction，flex-wrap，fle ...`,l:"audition/css/css上篇.html#_7-flex-布局如何使用",a:"_7-flex-布局如何使用"},"1.18":{t:"8. grid布局\r",p:"那就是 flex 布局是一维布局，Grid 布局是二维布局。flex 布局一次只能处理一个维度上的元素布局，一行或者一列。Grid 布局是将容器划分成了“行”和“列”，产生了一个个的网格，我们可以将网 ...",l:"audition/css/css上篇.html#_8-grid布局",a:"_8-grid布局"},"1.19":{t:"8. 如何用 css 或 js 实现多行文本溢出省略效果，考虑兼容性\r",p:`overflow: hidden;
text-overflow:ellipsis;
white-space: nowrap;

`,l:"audition/css/css上篇.html#_8-如何用-css-或-js-实现多行文本溢出省略效果-考虑兼容性",a:"_8-如何用-css-或-js-实现多行文本溢出省略效果-考虑兼容性"},"1.20":{t:"9. 居中为什么要使用 transform（为什么不使用 marginLeft/Top）\r",p:`
transform 属于合成属性（composite property），对合成属性进行 transition/animation 动画将会创建一个合成层（composite layer），这使得被 ...`,l:"audition/css/css上篇.html#_9-居中为什么要使用-transform-为什么不使用-marginleft-top",a:"_9-居中为什么要使用-transform-为什么不使用-marginleft-top"},"1.21":{t:"10. 介绍下粘性布局(sticky)\r",p:"position 中的 sticky 值是 CSS3 新增的，设置了 sticky 值后，在屏幕范围（viewport）时该元素的位置并不受到定位影响（设置是top、left等属性无效），当该元素的位 ...",l:"audition/css/css上篇.html#_10-介绍下粘性布局-sticky",a:"_10-介绍下粘性布局-sticky"},"1.22":{t:"11. 说出 space-between 和 space-around 的区别\r",p:"这个是 flex 布局的内容，其实就是一个边距的区别，按水平布局来说，space-between是两端对齐，在左右两侧没有边距，而space-around是每个子项目左右方向的 margin 相等，所 ...",l:"audition/css/css上篇.html#_11-说出-space-between-和-space-around-的区别",a:"_11-说出-space-between-和-space-around-的区别"},"1.23":{t:"12. CSS3 中 transition 和 animation 的属性分别有哪些\r",p:`transition 过渡动画：

transition-property：指定过渡的 CSS 属性
transition-duration：指定过渡所需的完成时间
transition-timing ...`,l:"audition/css/css上篇.html#_12-css3-中-transition-和-animation-的属性分别有哪些",a:"_12-css3-中-transition-和-animation-的属性分别有哪些"},"1.24":{t:"clip-path\r",p:`clip-path 属性使用裁剪方式创建元素的可显示区域。区域内的部分显示，区域外的隐藏。可以指定一些特定形状。
裁剪一张图像，以圆形的方式显示 50%：
img {
  clip-path: cir ...`,l:"audition/css/css上篇.html#clip-path",a:"clip-path"},"1.25":{t:"行内元素和块元素\r",p:`
块级元素以块状形式显示，并占据一行或多行的空间，其宽度默认为父元素的100%。块级元素可以设置宽度、高度、外边距和内边距等盒模型属性。可以容纳其他块级元素或行内元素。
行内元素则不会产生换行，宽度由 ...`,l:"audition/css/css上篇.html#行内元素和块元素",a:"行内元素和块元素"},"1.26":{t:"text\r",p:`/text-aline/
h1 {text-align:center;}  //居中
p.date {text-align:right;}  
p.main {text-align:justify;} ...`,l:"audition/css/css上篇.html#text",a:"text"},"1.27":{t:"对齐\r",p:`{
  vertical-align 属性设置一个元素的垂直对齐方式。
  align-content:center; space-between  space-around 对齐弹性盒的 &lt;d ...`,l:"audition/css/css上篇.html#对齐",a:"对齐"},"1.28":{t:"动画\r",p:`animation: name duration timing-function delay iteration-count direction fill-mode play-state;
`,l:"audition/css/css上篇.html#动画",a:"动画"},"1.29":{t:"响应式布局rem和em\r",p:`rem相对于根元素（即HTML元素）
em相对于父元素
`,l:"audition/css/css上篇.html#响应式布局rem和em",a:"响应式布局rem和em"},"1.30":{t:"css选择器排序\r",p:`
内联样式的权重为1000。
ID选择器的权重为100。
类选择器、属性选择器和伪类选择器的权重为10。
元素选择器和伪元素选择器的权重为1。

`,l:"audition/css/css上篇.html#css选择器排序",a:"css选择器排序"},"1.31":{t:"属性选择器和伪类选择器\r",p:`

属性选择器使用方括号（[]）来指定属性和属性值。


伪类选择器选择处于特定状态或特定位置的元素。它们通过在选择器后面使用冒号（:）和关键词来指定。


/* 选择已选中的复选框 不用js*/
i ...`,l:"audition/css/css上篇.html#属性选择器和伪类选择器",a:"属性选择器和伪类选择器"},"1.32":{t:"伪元素选择器\r",p:`伪元素选择器允许在元素的特定位置插入额外的内容，而无需修改HTML结构。这些内容可以用于添加装饰、修饰文本或创建特殊效果。

::before：在元素内容之前插入生成的内容。
::after：在元素内 ...`,l:"audition/css/css上篇.html#伪元素选择器",a:"伪元素选择器"},"2.0":{t:"13. 如何用 CSS 实现一个三角形\r",p:`利用盒模型的 border 属性上下左右边框交界处会呈现出平滑的斜线这个特点，通过设置不同的上下左右边框宽度或者颜色即可得到三角形或者梯形。
`,l:"audition/css/css下篇.html",a:"_13-如何用-css-实现一个三角形"},"2.1":{t:"14. 如何实现一个自适应的正方形\r",p:`
利用 CSS3 的 vw 单位，vw 会把视口的宽度平均分为 100 份
利用 margin 或者 padding 的百分比计算是参照父元素的 width 属性

`,l:"audition/css/css下篇.html#_14-如何实现一个自适应的正方形",a:"_14-如何实现一个自适应的正方形"},"2.2":{t:"15. 清除浮动的方法\r",p:`
clear 清除浮动（添加空div法）在浮动元素下方添加空div，并给该元素写css样式： {clear:both;height:0;overflow:hidden;}
给浮动元素父级设置高度
父级 ...`,l:"audition/css/css下篇.html#_15-清除浮动的方法",a:"_15-清除浮动的方法"},"2.3":{t:"盒模型\r",p:"CSS盒模型是指在HTML中，每个元素都被视为一个矩形的盒子，其包括四个部分：内容(content)、填充(padding)、边框(border)、外边距(margin)。CSS盒模型中，元素的大小由 ...",l:"audition/css/css下篇.html#盒模型",a:"盒模型"},"2.4":{t:"16. 两种盒模型以及区别\r",p:`
W3C盒模型（标准盒模型）和IE盒模型，主要区别是二者的盒子宽高是否包括元素的边框和内边距。IE盒模型中内容的宽或高将会包含内边距、外边距和边框，而W3C盒模型把内边距边框放到外面相加。
W3C盒模 ...`,l:"audition/css/css下篇.html#_16-两种盒模型以及区别",a:"_16-两种盒模型以及区别"},"2.5":{t:"指定盒模型的类型\r",p:"可以使用box-sizing属性来指定盒模型的类型，其取值为content-box和border-box。默认值为content-box，表示使用标准盒模型；而border-box表示使用IE盒模型。 ...",l:"audition/css/css下篇.html#指定盒模型的类型",a:"指定盒模型的类型"},"2.6":{t:"17. 如何触发重排和重绘，重绘)？\r",p:`
添加、删除、更新DOM节点
通过display: none隐藏一个DOM节点-触发重排和重绘
通过visibility: hidden隐藏一个DOM节点-只触发重绘，因为没有几何变化
移动或者给页面 ...`,l:"audition/css/css下篇.html#_17-如何触发重排和重绘-重绘",a:"_17-如何触发重排和重绘-重绘"},"2.7":{t:"18. 如何优化图片\r",p:`
对于很多装饰类图片，尽量不用图片，因为这类修饰图片完全可以用 CSS 去代替。
将多个图标文件整合到一张图片中（雪碧图）
WebP 格式的浏览器尽量使用 WebP 格式，因为 WebP 格式具有更好 ...`,l:"audition/css/css下篇.html#_18-如何优化图片",a:"_18-如何优化图片"},"2.8":{t:"19. CSS3 新增了那些东西？\r",p:`
选择器
盒子模型属性：border-radius、box-shadow、border-image
背景：background-size、background-origin、background-cl ...`,l:"audition/css/css下篇.html#_19-css3-新增了那些东西",a:"_19-css3-新增了那些东西"},"2.9":{t:"媒体查询\r",p:"媒体查询是CSS3中新增的一种功能，它允许开发者根据设备屏幕尺寸、分辨率、方向等条件来为不同的设备或浏览器设置不同的CSS样式。通过媒体查询，我们可以根据屏幕宽度、高度等条件来动态地调整网页的布局和样 ...",l:"audition/css/css下篇.html#媒体查询",a:"媒体查询"},"2.10":{t:"20. 实现三栏布局的7种方法\r",p:`
浮动float + calc()

div {
    height: 100px;
}
.left {
    float: left;
    width: 200px;
    backgro ...`,l:"audition/css/css下篇.html#_20-实现三栏布局的7种方法",a:"_20-实现三栏布局的7种方法"},"3.0":{t:"# ES6\r",p:"\r",l:"audition/es6/ES6.html",a:"es6"},"3.1":{t:"1. 什么是ES6模块化？\r",p:`ES6 模块化规范是浏览器端与服务器端通用的模块化开发规范。
`,l:"audition/es6/ES6.html#_1-什么是es6模块化",a:"_1-什么是es6模块化"},"3.2":{t:"定义：\r",p:`
每个 js 文件都是一个独立的模块
导入其它模块成员使用 import关键字
向外共享模块成员使用 export关键字

`,l:"audition/es6/ES6.html#定义",a:"定义"},"3.3":{t:"用法：\r",p:`
默认导出与默认导入
按需导出与按需导入
直接导入并执行模块中的代码

`,l:"audition/es6/ES6.html#用法",a:"用法"},"3.4":{t:"默认导出与默认导入注意点：\r",p:`
每个模块中，只允许使用唯一的一次export default，否则会报错
默认导入时的接收名称可以任意名称，只要是合法的成员名称即可

`,l:"audition/es6/ES6.html#默认导出与默认导入注意点",a:"默认导出与默认导入注意点"},"3.5":{t:"按需导入与按需导出注意点：\r",p:`
每个模块中可以使用多次按需导出
按需导入的成员名称必须和按需导出的名称保持一致
按需导入时，可以使用 as 关键字进行重命名
按需导入可以和默认导入一起使用

ES6新增
`,l:"audition/es6/ES6.html#按需导入与按需导出注意点",a:"按需导入与按需导出注意点"},"3.6":{t:"2. 新增了let const关键字\r",p:`
var允许重复声明，let、const不允许
var会提升变量的声明到作用域的顶部，但let和const不会
只要作用域内存在let、const，它们所声明的变量或常量就会自动“绑定”这个区域，不再 ...`,l:"audition/es6/ES6.html#_2-新增了let-const关键字",a:"_2-新增了let-const关键字"},"3.7":{t:"3. 作用域\r",p:`常见的作用域主要分为几个类型：全局作用域、函数作用域、块状作用域、动态作用域



对象
类型




global/window
全局作用域


function
函数作用域（局部作用域）


{} ...`,l:"audition/es6/ES6.html#_3-作用域",a:"_3-作用域"},"3.8":{t:"4. 新增的解构赋值\r",p:`解构赋值针对数组或者对象进行模式匹配，然后对其中的变量进行赋值。
let [a,b] = [1,2]
let {user} = obj

`,l:"audition/es6/ES6.html#_4-新增的解构赋值",a:"_4-新增的解构赋值"},"3.9":{t:"5. 新增了箭头函数\r",p:`箭头函数和普通函数的区别

普通函数存在着变量的提升，箭头函数没有
普通函数的this指向，谁调用指向谁，箭头函数是在哪定义就指向谁
普通函数可以当成构造函数，而箭头函数是不可以的
箭头函数没有arg ...`,l:"audition/es6/ES6.html#_5-新增了箭头函数",a:"_5-新增了箭头函数"},"3.10":{t:"6. js新增简单数据类型Symbol\r",p:`symbol
`,l:"audition/es6/ES6.html#_6-js新增简单数据类型symbol",a:"_6-js新增简单数据类型symbol"},"3.11":{t:"7. 新增了class关键字\r",p:`class关键字是es5构造函数+原型模式创建对象的语法糖。创建类的方式 class 类名{构造函数和方法} 通过extends关键字实现继承。
`,l:"audition/es6/ES6.html#_7-新增了class关键字",a:"_7-新增了class关键字"},"3.12":{t:"8. es6新增了模块化\r",p:`与node.js的commonjs不同,es6新增esmoudule
根据功能封装模块 通过import导入 然后通过export导出，也可以使用export default导出

export 可以 ...`,l:"audition/es6/ES6.html#_8-es6新增了模块化",a:"_8-es6新增了模块化"},"3.13":{t:"9. 新增promise\r",p:`promise
`,l:"audition/es6/ES6.html#_9-新增promise",a:"_9-新增promise"},"3.14":{t:"Generator（生成器）\r",p:`Generator（生成器）是 ES6 中引入的一种特殊函数，它可以被暂停和恢复
场景：
惰性计算（Lazy Evaluation）：Generator 函数可以实现惰性计算，只有当需要获取值时
异步 ...`,l:"audition/es6/ES6.html#generator-生成器",a:"generator-生成器"},"4.0":{t:"js新增简单数据类型Symbol\r",p:`新增简单数据类型Symbol，用于表示一个独一无二的值。
const a = Symbol(); //Symbol创建实例不需要new
console.log(a);  //Symbol()

不能在 ...`,l:"audition/es6/symbol.html",a:"js新增简单数据类型symbol"},"5.0":{t:"# DOM\r",p:"\r",l:"audition/html/DOM.html",a:"dom"},"5.1":{t:"什么是DOM，文档对象模型\r",p:`从网络传给渲染引擎的 HTML 文件字节流是无法直接被渲染引擎理解的，所以要将其转化 为渲染引擎能够理解的内部结构，这个结构就是 DOM。DOM 提供了对 HTML 文档结构 化的表述。
!dom树
 ...`,l:"audition/html/DOM.html#什么是dom-文档对象模型",a:"什么是dom-文档对象模型"},"5.2":{t:"DOM 树如何生成\r",p:"渲染引擎内部，有一个叫HTML 解析器（HTMLParser）的模块，它的职责就是负责将HTML 字节流转换为 DOM 结构。HTML 解析器并不是等整个文档加载完成之后再解析的，而是网络进程加载了多 ...",l:"audition/html/DOM.html#dom-树如何生成",a:"dom-树如何生成"},"5.3":{t:"JavaScript和css会不会影响DOM树构建和渲染\r",p:`
CSS不会阻塞DOM树的解析，但是会影响 JavaScript的运行
JavaScript 会阻止DOM树的解析
最终CSS（CSSOM）会影响DOM树的渲染，也可以说最终会影响渲染树的生成

`,l:"audition/html/DOM.html#javascript和css会不会影响dom树构建和渲染",a:"javascript和css会不会影响dom树构建和渲染"},"5.4":{t:"JavaScript对DOM树构建和渲染的影响\r",p:`
执行到 JavaScript 标签时，暂停整个 DOM 的解析，执行 JavaScript 代码，如果要下载JavaScript代码，下载过程会阻塞DOM 解析
Chrome 浏览器预解析操作，当渲 ...`,l:"audition/html/DOM.html#javascript对dom树构建和渲染的影响",a:"javascript对dom树构建和渲染的影响"},"5.5":{t:"规避JavaScript线程阻塞DOM现象\r",p:`JavaScript 脚本设置为异步加载，通过 async 或 defer 来标记代码
`,l:"audition/html/DOM.html#规避javascript线程阻塞dom现象",a:"规避javascript线程阻塞dom现象"},"5.6":{t:"CSS对DOM树构建和渲染的影响\r",p:"DOM 的过程中，如果遇到了 JavaScript 脚本，那么需要先暂停 DOM 解析去执行 JavaScript，因为 JavaScript 有可能会修改当前状态下的 DOM。不过在执行 JavaS ...",l:"audition/html/DOM.html#css对dom树构建和渲染的影响",a:"css对dom树构建和渲染的影响"},"5.7":{t:"DOMContentLoaded\r",p:`
文档解析完毕，当页面引用的所有 js 同步代码执行完毕，DOM树构建完成，触发 DOMContentLoaded 事件。
html 文档中的图片资源，js 代码中有异步加载的 css、js 、图片资 ...`,l:"audition/html/DOM.html#domcontentloaded",a:"domcontentloaded"},"5.8":{t:"DOM文档加载的步骤为：\r",p:`
解析HTML结构。
加载外部脚本和样式表文件。
解析并执行脚本代码。
DOM树构建完成。//DOMContentLoaded
加载图片等外部文件。
页面加载完毕。//load

`,l:"audition/html/DOM.html#dom文档加载的步骤为",a:"dom文档加载的步骤为"},"5.9":{t:" 网页的渲染\r",p:`
加载js然后html和css，设置defer和acync时js和html异步加载
html转换为dom，css转换为cssom
将DOM和CSSOM合并成一棵渲染render树
对渲染树进行refl ...`,l:"audition/html/DOM.html#网页的渲染",a:"网页的渲染"},"5.10":{t:"DOM树的构建是文档加载完成开始的？ \r",p:`构建 DOM 树是一个渐进过程，为达到更好的用户体验，渲染引擎会尽快将内容显示在屏幕上，它不必等到整个 HTML 文档解析完成之后才开始构建 render 树和布局。
`,l:"audition/html/DOM.html#dom树的构建是文档加载完成开始的",a:"dom树的构建是文档加载完成开始的"},"5.11":{t:"Render 树是 DOM 树和 CSS 样式表构建完毕后才开始构建的？ \r",p:`这三个过程在实际进行的时候并不是完全独立的，而是会有交叉，会一边加载，一边解析，以及一边渲染。
`,l:"audition/html/DOM.html#render-树是-dom-树和-css-样式表构建完毕后才开始构建的",a:"render-树是-dom-树和-css-样式表构建完毕后才开始构建的"},"5.12":{t:"CSS 的解析注意点？ \r",p:`CSS 的解析是从右往左逆向解析的，嵌套标签越多，解析越慢。
`,l:"audition/html/DOM.html#css-的解析注意点",a:"css-的解析注意点"},"5.13":{t:"JS 操作真实 DOM 的代价？\r",p:"原生 JS 或 JQ 操作 DOM 时，浏览器会从构建 DOM 树开始从头到尾执行一遍流程，需要更新 10 个 DOM 节点就要从头到尾执行10遍，计算 DOM 节点坐标值等都是白白浪费的性能。即使计 ...",l:"audition/html/DOM.html#js-操作真实-dom-的代价",a:"js-操作真实-dom-的代价"},"5.14":{t:"Virtual-DOM 就是一个JS对象模拟的DOM树\r",p:`参考这篇
虚拟 DOM 就是为了解决浏览器性能问题而被设计出来的。如前，若一次操作中有 10 次更新 DOM 的动作，虚拟 DOM 不会立即操作 DOM，而是将这 10 次更新的 diff 内容保存到 ...`,l:"audition/html/DOM.html#virtual-dom-就是一个js对象模拟的dom树",a:"virtual-dom-就是一个js对象模拟的dom树"},"5.15":{t:"Virtual-DOM的实现\r",p:`
用 JS 对象模拟 DOM 树
diff算法比较两棵虚拟 DOM 树的差异
将两个虚拟 DOM 对象的差异应用到真正的 DOM 树

`,l:"audition/html/DOM.html#virtual-dom的实现",a:"virtual-dom的实现"},"5.16":{t:"vue的Virtual-DOM\r",p:"",l:"audition/html/DOM.html#vue的virtual-dom",a:"vue的virtual-dom"},"5.17":{t:"VNode 模拟 DOM 树\r",p:`利用 _createElement 方法创建 VNode，它定义在 src/core/vdom/create-elemenet.js 中
`,l:"audition/html/DOM.html#vnode-模拟-dom-树",a:"vnode-模拟-dom-树"},"5.18":{t:"DOM常用接口\r",p:`
Document: 表示整个文档，提供了操作和访问文档的方法和属性。
Element: 表示一个元素节点，提供了操作和访问元素的方法和属性。
Node: 表示文档中的一个节点，可以是元素节点、文本节 ...`,l:"audition/html/DOM.html#dom常用接口",a:"dom常用接口"},"5.19":{t:"Document\r",p:`
getElementById(id): 根据元素的 id 属性获取对应的元素节点。
querySelector(selector): 根据 CSS 选择器选择匹配的第一个元素节点。
querySel ...`,l:"audition/html/DOM.html#document",a:"document"},"5.20":{t:"常用属性：\r",p:`
documentElement: 返回文档的根元素节点（通常是 &lt;html&gt;）。
head: 返回文档的头部元素节点（通常是 &lt;head&gt;）。
body: 返回文档的主体元素 ...`,l:"audition/html/DOM.html#常用属性",a:"常用属性"},"5.21":{t:"Element getAttribute(name): 获取指定属性名对应的属性值。\r",p:`
setAttribute(name, value): 设置指定属性名的属性值。
hasAttribute(name): 检查是否存在指定属性名的属性。
removeAttribute(name):  ...`,l:"audition/html/DOM.html#element-getattribute-name-获取指定属性名对应的属性值。",a:"element-getattribute-name-获取指定属性名对应的属性值。"},"5.22":{t:"DOM元素对象属性\r",p:`DOM元素对象（Element）具有许多属性，用于访问和操作元素的不同方面。下面列举一些常见的属性：

classList：返回一个DOMTokenList对象，包含了元素的类名（class）列表，可 ...`,l:"audition/html/DOM.html#dom元素对象属性",a:"dom元素对象属性"},"5.23":{t:"window\r",p:`Window 对象是浏览器中的顶级对象，提供了许多常用的方法和属性。以下是一些常见的 Window 方法和属性：
`,l:"audition/html/DOM.html#window",a:"window"},"5.24":{t:"常用方法：\r",p:`
alert(message): 显示一个带有消息和确定按钮的对话框。
confirm(message): 显示一个带有消息、确定和取消按钮的对话框，并返回用户的选择结果。
prompt(messag ...`,l:"audition/html/DOM.html#常用方法",a:"常用方法"},"5.25":{t:"常用属性：\r",p:`
document: 获取当前窗口的 Document 对象，用于访问和操作文档的内容。
location: 获取或设置当前窗口的 URL 地址信息。
navigator: 获取关于浏览器的信息，如浏 ...`,l:"audition/html/DOM.html#常用属性",a:"常用属性"},"5.26":{t:"Event\r",p:"Event 是 JavaScript 中处理事件的基本对象。它代表了在 DOM 中发生的特定事件，可以包含有关事件的信息和方法。Event 对象的属性和方法可以用于事件处理、事件传播和事件信息的获取。 ...",l:"audition/html/DOM.html#event",a:"event"},"5.27":{t:"常用属性：\r",p:`
type：事件的类型，如 &quot;click&quot;、&quot;keydown&quot; 等。
target：触发事件的元素。
currentTarget：当前正在处理事件的元素。
ev ...`,l:"audition/html/DOM.html#常用属性",a:"常用属性"},"5.28":{t:"常用方法：\r",p:`
preventDefault()：取消事件的默认行为。
stopPropagation()：停止事件的传播，阻止事件进一步冒泡或捕获。
stopImmediatePropagation()：立即停止 ...`,l:"audition/html/DOM.html#常用方法",a:"常用方法"},"6.0":{t:"# html八股文\r",p:"\r",l:"audition/html/html.html",a:"html八股文"},"6.1":{t:"1. 什么是 DOCTYPE， 有何作用？\r",p:"Doctype是HTML5的文档声明，通过它可以告诉浏览器，使用哪一个HTML版本标准解析文档。在浏览器发展的过程中，HTML出现过很多版本，不同的版本之间格式书写上略有差异。如果没有事先告诉浏览器， ...",l:"audition/html/html.html#_1-什么是-doctype-有何作用",a:"_1-什么是-doctype-有何作用"},"6.2":{t:"2. title 与 h1 的区别、b 与 strong 的区别、i 与 em 的区别？\r",p:`
title 属性表示网页的标题，h1 元素则表示层次明确的页面内容标题，对页面信息的抓取也有很大的影响
strong 是标明重点内容，有语气加强的含义，使用阅读设备阅读网络时：strong会重读，而 ...`,l:"audition/html/html.html#_2-title-与-h1-的区别、b-与-strong-的区别、i-与-em-的区别",a:"_2-title-与-h1-的区别、b-与-strong-的区别、i-与-em-的区别"},"6.3":{t:"3. 行内元素和块级元素分别有哪些？有何区别？怎样转换？\r",p:`常见的块级元素：p、div、form、ul、li、ol、table、h1、h2、h3、h4、h5、h6、dl、dt、dd
常见的行级元素：span、a、img、button、input、select
 ...`,l:"audition/html/html.html#_3-行内元素和块级元素分别有哪些-有何区别-怎样转换",a:"_3-行内元素和块级元素分别有哪些-有何区别-怎样转换"},"6.4":{t:"4. label的作用是什么？是怎么用的？\r",p:"label元素不会向用户呈现任何特殊效果，但是，它为鼠标用户改进了可用性，当我们在label元素内点击文本时就会触发此控件。也就是说，当用户选择该标签时，浏览器就会自动将焦点转到和标签相关的表单控件上 ...",l:"audition/html/html.html#_4-label的作用是什么-是怎么用的",a:"_4-label的作用是什么-是怎么用的"},"6.5":{t:"5. a元素除了用于导航外，还有什么作用？\r",p:"href属性中的url可以是浏览器支持的任何协议，所以a标签可以用来手机拨号&lt;a href=&quot;tel:110&quot;&gt;110&lt;/a&gt;，也可以用来发送短信&lt;a ...",l:"audition/html/html.html#_5-a元素除了用于导航外-还有什么作用",a:"_5-a元素除了用于导航外-还有什么作用"},"6.6":{t:"6. 你知道SEO中的TDK吗？\r",p:`在SEO中，TDK其实就是title、description、keywords这三个标签，title表示标题标签，description是描述标签，keywords是关键词标签
`,l:"audition/html/html.html#_6-你知道seo中的tdk吗",a:"_6-你知道seo中的tdk吗"},"6.7":{t:"7. 怎么处理HTML5新标签兼容问题？\r",p:`主要有两种方式：

实现标签被识别：通过document.createElement(tagName)方法可以让浏览器识别新的标签，浏览器支持新标签后。还可以为新标签添加CSS样式
用JavaScri ...`,l:"audition/html/html.html#_7-怎么处理html5新标签兼容问题",a:"_7-怎么处理html5新标签兼容问题"},"6.8":{t:"8. HTML5新增了哪些新特性？移除了哪些元素？\r",p:`HTML5主要是关于图像、位置、存储、多任务等功能的增加：

语义化标签，如：article、footer、header、nav等
视频video、音频audio
画布canvas
表单控件，cale ...`,l:"audition/html/html.html#_8-html5新增了哪些新特性-移除了哪些元素",a:"_8-html5新增了哪些新特性-移除了哪些元素"},"6.9":{t:"9. 网页的渲染\r",p:`
加载js然后html和css，设置defer和acync时js和html异步加载
html转换为dom，css转换为cssom
将DOM和CSSOM合并成一棵渲染render树
对渲染树进行refl ...`,l:"audition/html/html.html#_9-网页的渲染",a:"_9-网页的渲染"},"6.10":{t:"10. 渲染树\r",p:`
从根元素开始检查哪些元素可见，以及样式
忽略不可见的元素

display:none不占位置会忽略
visiabllity:hidden,position定位,obsity:0这三个占位置，不会忽略 ...`,l:"audition/html/html.html#_10-渲染树",a:"_10-渲染树"},"6.11":{t:"11. 重排(回流)，重绘\r",p:`
计算渲染树中的元素大小和位置
当页面中的元素的大小或位置发生变化，便会触发重排，
每次修改样式都会触发重排，重排非常耗费资源，开发尽量减少次数

`,l:"audition/html/html.html#_11-重排-回流-重绘",a:"_11-重排-回流-重绘"},"6.12":{t:"重绘\r",p:`当页面发生变化时浏览器会对页面重新绘制，不可避免
重排一定重绘，重绘不一定重排
`,l:"audition/html/html.html#重绘",a:"重绘"},"6.13":{t:"避免重排重绘\r",p:`
避免频繁使用 style，而是采用修改class的方式。
使⽤DocumentFragment
提升为合成层

合成层的位图，会交由 GPU 合成，⽐ CPU 处理要快
当需要 repaint 时， ...`,l:"audition/html/html.html#避免重排重绘",a:"避免重排重绘"},"6.14":{t:"12. 合成层\r",p:`
合成就是将页面的各个部分分成多个层，最后把它们合成为一个页面的技术
合成层拥有单独的图层，不影响其他图层，而其他不是合成层的渲染层，则和其第一个拥有图层(GraphicsLayer)的父层共用一个。 ...`,l:"audition/html/html.html#_12-合成层",a:"_12-合成层"},"6.15":{t:"触发合成层\r",p:`
使用CSS3硬件加速：将元素的属性设置为transform、opacity、filter、will-change等，浏览器会自动将这些元素创建为单独的合成层；设置 transform: transl ...`,l:"audition/html/html.html#触发合成层",a:"触发合成层"},"6.16":{t:"层压缩\r",p:`
层隐式合成的例子，可能简单的重叠就会产生大量的合成层，这样会占用很多无辜的 CPU 和 内存资源，严重影响了页面的性能。这一点浏览器也考虑到了，因此就有了层压缩（Layer Squashing）的处 ...`,l:"audition/html/html.html#层压缩",a:"层压缩"},"6.17":{t:"层爆炸\r",p:`
同合成层重叠也会使元素提升为合成层，虽然有浏览器的层压缩机制，但是也有很多无法进行压缩的情况。也就是说除了我们显式的声明的合成层，还可能由于重叠原因不经意间产生一些不在预期的合成层，极端一点可能会产 ...`,l:"audition/html/html.html#层爆炸",a:"层爆炸"},"6.18":{t:"13. 谈谈html语义化\r",p:`语义元素可以清楚地向浏览器和开发者描述其意义。即元素本身传达了关于标签所包含内容类型的一些信息。例如，当浏览器解析到标签时，它将该标签解释为包含这一块内容的最重要的标题。

非语义元素：&lt;div ...`,l:"audition/html/html.html#_13-谈谈html语义化",a:"_13-谈谈html语义化"},"6.19":{t:"为什么要语义化？\r",p:`
页面结构: 使页面没有css的情况下，也能够呈现出很好的内容结构
有利于SEO: 爬虫依赖标签来确定关键字的权重，因此可以帮助爬虫抓取更多的有效信息
提升用户体验： 例如title、alt可以用于解 ...`,l:"audition/html/html.html#为什么要语义化",a:"为什么要语义化"},"6.20":{t:"IFrame\r",p:"IFrame（Inline Frame）是HTML中的一个元素，可以在页面中嵌入另一个HTML文档或者网页。IFrame元素可以用来在当前页面中显示来自其他网站或者服务器的内容，也可以用来实现一些特殊 ...",l:"audition/html/html.html#iframe",a:"iframe"},"7.0":{t:"# SEO\r",p:"\r",l:"audition/html/SEO.html",a:"seo"},"7.1":{t:"什么是SEO\r",p:"SEO（Search Engine Optimization）:汉译为搜索引擎优化。搜索引擎优化是一种利用搜索引擎的搜索规则来提高目前网站在有关搜索引擎内的自然排名的方式。SEO是指为了从搜索引擎中获 ...",l:"audition/html/SEO.html#什么是seo",a:"什么是seo"},"7.2":{t:"优化的三要素\r",p:`
标题，言简意赅的体现出页面的主要内容
关键词，提升页面关键词密度
描述，用自然语言描述页面的主要内容

`,l:"audition/html/SEO.html#优化的三要素",a:"优化的三要素"},"7.3":{t:"TDK是搜索引擎判断页面主题内容的关键\r",p:`所以要在title里面言简意赅的体现出页面的主要内容，如果主体比较多，可以用一些符号把不同的主题词隔开，但是关键词不要太多，最多不要超过五个。
keywords里面把每个关键词用英文逗号隔开，三到五个 ...`,l:"audition/html/SEO.html#tdk是搜索引擎判断页面主题内容的关键",a:"tdk是搜索引擎判断页面主题内容的关键"},"7.4":{t:"提升页面关键词密度\r",p:"关键词密度。简单理解就是关键词在所有文字内容中出现的比例。提升关键词的密度，有利于提升搜索引擎针对对应关键词的搜索排名。通过站内的关键词链接指向网站内部的链接，通过这样的方式，还可以在不同的页面之间相 ...",l:"audition/html/SEO.html#提升页面关键词密度",a:"提升页面关键词密度"},"7.5":{t:"细枝末节但不可忽视的优化\r",p:`
页面上经常会有各种图片，对于搜索引擎来说，它是不识别图片上的内容的。你可能知道代码中img标签的alt属性是为了图片加载失败的时候，给用户看的。这个属性表明了这张图的内容。其实搜索引擎在分析页面的时 ...`,l:"audition/html/SEO.html#细枝末节但不可忽视的优化",a:"细枝末节但不可忽视的优化"},"8.0":{t:"# W3C标准\r",p:"\r",l:"audition/html/w3c.html",a:"w3c标准"},"8.1":{t:"概念\r",p:`web标准简单来说可以分为结构、表现和行为

结构，主要是有HTML标签组成
表现，即指css样式表
行为，主要是有js、dom组成

`,l:"audition/html/w3c.html#概念",a:"概念"},"8.2":{t:"体现\r",p:`
需要声明（DOCTYPE）
需要定义语言编码
JavaScript定义&lt;script&gt;
CSS定义&lt;style type=“text/css”&gt;和数量单位
不要在注释内容中使 ...`,l:"audition/html/w3c.html#体现",a:"体现"},"8.3":{t:"意义\r",p:`
标签规范可以提高搜索引擎对页面的抓取效率，对SEO（搜索引擎优化）很有帮助
尽量使用外链css样式表和js脚本：
结构、表现和行为分为三块，符合规范，同时提高页面渲染速度，提高用户的体验
样式尽量少 ...`,l:"audition/html/w3c.html#意义",a:"意义"},"9.0":{t:"# http\r",p:"\r",l:"audition/http/http协议.html",a:"http"},"9.1":{t:"HTTP概述\r",p:"HTTP ( HyperText Transfer Protocal)，全称为超文本传输协议。HTTP是一个客户端终端（用户）和服务器端（网站）请求和应答的标准。通常，由HTTP客户端发起一个请求，创 ...",l:"audition/http/http协议.html#http概述",a:"http概述"},"9.2":{t:"HTTP特点：\r",p:`
支持客户端、服务端模式
简单快速：客户向服务器请求服务时，只需要传送请求方法和路径。由于HTTP协议简单，使得通信速度比较快
灵活：HTTP允许传输任意类型的数据对象。正在传输的类型由Content ...`,l:"audition/http/http协议.html#http特点",a:"http特点"},"9.3":{t:"TCP/IP\r",p:"TCP/IP（Transmission Control Protocol/Internet Protocol，传输控制协议/网际协议）是指能够在多个不同网络间实现信息传输的协议簇。TCP/IP协议不仅 ...",l:"audition/http/http协议.html#tcp-ip",a:"tcp-ip"},"9.4":{t:"HTTP与HTTPS的区别\r",p:"HTTP协议传输的数据都是未加密的，也就是明文的，可以用抓包工具直接抓下来并且可见，而HTTPS则是利用了网景公司设计的SSL（Secure Sockets Layer）协议对HTTP协议传输的数据进 ...",l:"audition/http/http协议.html#http与https的区别",a:"http与https的区别"},"9.5":{t:"HTTP1.0与HTTP2.0的区别\r",p:`HTTP 2.0 的出现，相比于 HTTP 1.x ，大幅度的提升了 web 性能
`,l:"audition/http/http协议.html#http1-0与http2-0的区别",a:"http1-0与http2-0的区别"},"9.6":{t:"URL的组成\r",p:`协议+主机名+路径+参数
`,l:"audition/http/http协议.html#url的组成",a:"url的组成"},"9.7":{t:"HTTP请求\r",p:"",l:"audition/http/http协议.html#http请求",a:"http请求"},"9.8":{t:"请求行\r",p:`请求行包括三个方面：请求方法、请求地址、协议版本



方法名
功能




GET
向指定的资源发出“显示”请求，使用 GET 方法应该只用在读取数据上，而不应该用于产生“副作用”的操作中


PO ...`,l:"audition/http/http协议.html#请求行",a:"请求行"},"9.9":{t:"GET与POST的区别：\r",p:`
GET：一般用于信息获取，使用URL传递参数并且可见，传递参数数量有限
POST：一般用于提交数据，参数不可见，传递参数数量无限制

注意：
安全性讲，get和post都一样，没啥所谓的哪个更安全, ...`,l:"audition/http/http协议.html#get与post的区别",a:"get与post的区别"},"9.10":{t:"什么情况下使用POST请求：\r",p:`
无法使用缓存文件（更新服务器上的文件或数据库），GET能请求缓存，POST不能
向服务器发送大量数据（POST 没有数据量限制）
发送包含未知字符的用户输入时，POST 比 GET 更稳定也更可靠
 ...`,l:"audition/http/http协议.html#什么情况下使用post请求",a:"什么情况下使用post请求"},"9.11":{t:"请求头\r",p:`请求头可用于传递一些附加信息，格式为：键: 值，注意，冒号后面有一个空格：

常见的请求 Header：




名称
作用




Authorization
用于设置身份认证信息


User-A ...`,l:"audition/http/http协议.html#请求头",a:"请求头"},"9.12":{t:"请求体\r",p:"请求体（又叫请求正文）是 post 请求方式中的请求参数，以 key = value 形式进行存储，多个请求参数之间用&amp;连接，如果请求当中请求体，那么在请求头当中的 Content-Lengt ...",l:"audition/http/http协议.html#请求体",a:"请求体"},"9.13":{t:"HTTP响应\r",p:`HTTP响应报文分为三个部分：响应状态行，响应头，响应体
`,l:"audition/http/http协议.html#http响应",a:"http响应"},"9.14":{t:"响应状态行\r",p:`


状态码
对应的信息




1XX
提示信息—表示请求已接收，继续处理


2XX
用于表示请求已被成功接收、理解、接收


3XX
用于表示资源（网页等）被永久转移到其它 URL，也就是所谓的 ...`,l:"audition/http/http协议.html#响应状态行",a:"响应状态行"},"9.15":{t:"常见状态码\r",p:`
2XX 成功

200   （成功）  服务器已成功处理了请求。 通常，这表示服务器提供了请求的网页。
201   （已创建）  请求成功并且服务器创建了新的资源。
202   （已接受）  服务器 ...`,l:"audition/http/http协议.html#常见状态码",a:"常见状态码"},"9.16":{t:"响应头 响应体\r",p:"\r",l:"audition/http/http协议.html#响应头-响应体",a:"响应头-响应体"},"9.17":{t:"浏览器输入url按回车背后经历了哪些\r",p:`参考这篇博文

URL 解析
DNS 查询(获取网站的ip地址，向 DNS 服务器发送查询请求，通过网址获取ip地址)
TCP 连接
客户端向服务器发请求(http协议)
服务器处理请求，返回响应(h ...`,l:"audition/http/http协议.html#浏览器输入url按回车背后经历了哪些",a:"浏览器输入url按回车背后经历了哪些"},"9.18":{t:"URL 解析\r",p:`
地址解析,首先判断你输入的是一个合法的 URL 还是一个待搜索的关键词，并且根据你输入的内容进行自动完成、字符编码等操作。
会使用 HSTS 强制客户端使用 HTTPS 访问页面
浏览器还会进行一些 ...`,l:"audition/http/http协议.html#url-解析",a:"url-解析"},"9.19":{t:"DNS 查询\r",p:`
浏览器缓存,浏览器会先检查是否在缓存中，没有则调用系统库函数进行查询。
操作系统缓存,操作系统也有自己的 DNS缓存，但在这之前，会向检查域名是否存在本地的 Hosts 文件里，没有则向 DNS 服 ...`,l:"audition/http/http协议.html#dns-查询",a:"dns-查询"},"9.20":{t:"TCP 连接\r",p:`TCP/IP 分为四层，在发送数据时，每层都要对数据进行封装：

应用层：发送 HTTP 请求     -软件层面
传输层：TCP 传输报文       -负责对数据拆分
网络层：IP协议查询Mac地 ...`,l:"audition/http/http协议.html#tcp-连接",a:"tcp-连接"},"9.21":{t:"处理请求\r",p:`服务器处理收到的请求，将数据返回至浏览器
`,l:"audition/http/http协议.html#处理请求",a:"处理请求"},"9.22":{t:"浏览器收到HTTP响应\r",p:`浏览器解码响应，如果响应可以缓存，则存入缓存。
`,l:"audition/http/http协议.html#浏览器收到http响应",a:"浏览器收到http响应"},"9.23":{t:"渲染页面\r",p:"\r",l:"audition/http/http协议.html#渲染页面",a:"渲染页面"},"9.24":{t:"TCP 建立连接是三次握手，而断开连接是四次挥手。\r",p:"",l:"audition/http/http协议.html#tcp-建立连接是三次握手-而断开连接是四次挥手。",a:"tcp-建立连接是三次握手-而断开连接是四次挥手。"},"9.25":{t:"三次握手\r",p:"三次握手（Three-way Handshake）其实就是指建立一个TCP连接时，需要客户端和服务器总共发送3个包。进行三次握手的主要作用就是为了确认双方的接收能力和发送能力是否正常、指定自己的初始化 ...",l:"audition/http/http协议.html#三次握手",a:"三次握手"},"9.26":{t:"四次挥手\r",p:`TCP 的连接的拆除需要发送四个包，因此称为四次挥手(Four-way handshake)，客户端或服务器均可主动发起挥手动作。

第一次挥手：客户端发送一个 FIN 报文，等待服务端的确认。此时客 ...`,l:"audition/http/http协议.html#四次挥手",a:"四次挥手"},"9.27":{t:"cookie\r",p:`\r
\r`,l:"audition/http/http协议.html#cookie",a:"cookie"},"9.28":{t:"ip\r",p:`IP（Internet Protocol）是用于在网络中标识和定位设备的地址。在 IP 地址中，有内网 IP 和公网 IP，同时还有子网掩码用于定义 IP 地址的网络部分和主机部分。
`,l:"audition/http/http协议.html#ip",a:"ip"},"9.29":{t:"tcp和udp\r",p:"TCP（Transmission Control Protocol）和 UDP（User Datagram Protocol）是两种在计算机网络中常用的传输层协议，它们在数据传输方式、可靠性、连接性等 ...",l:"audition/http/http协议.html#tcp和udp",a:"tcp和udp"},"9.30":{t:"HTTP无状态的协议\r",p:`HTTP（Hypertext Transfer Protocol）是一种无状态的协议。
无状态指的是在每个独立的 HTTP 请求之间，服务器不会保留任何关于客户端的状态信息。每个请求都是独立的，服务器 ...`,l:"audition/http/http协议.html#http无状态的协议",a:"http无状态的协议"},"9.31":{t:"cookie、session、token\r",p:"Cookie：Cookie 是一种存储在客户端（通常是浏览器）的小型文本文件，由服务器通过 HTTP 响应头设置并发送给客户端。浏览器会在后续的请求中将 Cookie 自动包含在 HTTP 请求头中发 ...",l:"audition/http/http协议.html#cookie、session、token",a:"cookie、session、token"},"9.32":{t:"进程和线程\r",p:`进程和线程是操作系统中用于执行任务的两个基本概念。
进程（Process）是指正在执行的程序的实例。
线程（Thread）是进程中的执行单元。一个进程可以拥有多个线程，
`,l:"audition/http/http协议.html#进程和线程",a:"进程和线程"},"10.0":{t:"# 安全\r",p:"",l:"audition/http/web安全.html",a:"安全"},"10.1":{t:"xss\r",p:"XSS（Cross-Site Scripting）攻击是一种常见的 Web 安全漏洞，也是 OWASP Top 10 攻击中排名前三的漏洞之一。它通常利用 Web 应用程序中的安全漏洞，允许攻击者在受 ...",l:"audition/http/web安全.html#xss",a:"xss"},"10.2":{t:"web安全有哪些方面\r",p:`Web安全是指保护Web应用程序和Web服务器免受各种安全威胁的一系列措施。Web安全覆盖了很多方面，包括但不限于以下几个方面：

身份认证和授权：身份认证是验证用户身份的过程，而授权是确定用户是否有 ...`,l:"audition/http/web安全.html#web安全有哪些方面",a:"web安全有哪些方面"},"10.3":{t:"CSRF和XSS\r",p:`CSRF（Cross-Site Request Forgery）和XSS（Cross-Site Scripting）都是常见的安全漏洞，存在于 Web 应用程序中。
CSRF 是一种攻击方式，攻击者通 ...`,l:"audition/http/web安全.html#csrf和xss",a:"csrf和xss"},"10.4":{t:"防范 CSRF 攻击的措施：\r",p:`
验证来源
启用 SameSite 属性：设置 Cookie 的 SameSite 属性为 &quot;Strict&quot; 或 &quot;Lax&quot;，以限制 Cookie 的跨站请求。 ...`,l:"audition/http/web安全.html#防范-csrf-攻击的措施",a:"防范-csrf-攻击的措施"},"10.5":{t:"防范 XSS 攻击的措施：\r",p:`
输入验证和过滤：对于用户输入的数据，进行输入验证和过滤，确保只接受符合预期格式的数据
输出转义：在将用户输入的数据输出到网页时，进行合适的转义，将特殊字符转换为其对应的 HTML 实体，避免被解释为 ...`,l:"audition/http/web安全.html#防范-xss-攻击的措施",a:"防范-xss-攻击的措施"},"10.6":{t:"ssl\r",p:`SSL（Secure Sockets Layer）是一种加密协议，用于在计算机网络上保证通信安全。它通过使用对称加密和非对称加密的组合来实现数据的机密性、完整性和身份验证。
`,l:"audition/http/web安全.html#ssl",a:"ssl"},"10.7":{t:"对称加密\r",p:`对称加密是一种加密方式，使用相同的密钥对数据进行加密和解密。
`,l:"audition/http/web安全.html#对称加密",a:"对称加密"},"10.8":{t:"非对称加密\r",p:`非对称加密使用一对密钥：公钥和私钥。公钥用于加密数据，而私钥用于解密数据。
`,l:"audition/http/web安全.html#非对称加密",a:"非对称加密"},"11.0":{t:"# javascript八股文\r",p:"\r",l:"audition/js/javascript.html",a:"javascript八股文"},"11.1":{t:"1. Js的基础类型\r",p:`
基础类型有：boolean、string、number、undefined、symbol、null、  bigint。
引用数据类型：Object、function、Array

`,l:"audition/js/javascript.html#_1-js的基础类型",a:"_1-js的基础类型"},"11.2":{t:"2. typeof和instanceof的区别\r",p:`
typeof能识别所有的值类型，识别函数，能区分是否是引用类型。
instanceof用于检测构造函数的 prototype 属性是否出现在某个实例对象的原型链上。

`,l:"audition/js/javascript.html#_2-typeof和instanceof的区别",a:"_2-typeof和instanceof的区别"},"11.3":{t:"3. JS数据类型判断\r",p:`
typeof：检测基础数据类型和函数很好用

它能准确判断出的数据类型有：Number，String，Boolean，Undefined，Symbol，BigInt，Function。
它的缺点就是 ...`,l:"audition/js/javascript.html#_3-js数据类型判断",a:"_3-js数据类型判断"},"11.4":{t:"4. ``没有 defer 或 async，浏览器会立即加载并执行指定的脚本，“立即”指的是在渲染该 script 标签之下的文档元素之前，也就是说不等待后续载入的文档元素，读到就加载并执行。先执行下载js脚本然后执行然后再解析HTML。\r",p:"",l:"audition/js/javascript.html#_4-没有-defer-或-async-浏览器会立即加载并执行指定的脚本-立即-指的是在渲染该-script-标签之下的文档元素之前-也就是说不等待后续载入的文档元素-读到就加载并执行。先执行下载js脚本然后执行然后再解析html。",a:"_4-没有-defer-或-async-浏览器会立即加载并执行指定的脚本-立即-指的是在渲染该-script-标签之下的文档元素之前-也就是说不等待后续载入的文档元素-读到就加载并执行。先执行下载js脚本然后执行然后再解析html。"},"11.5":{t:"async \r",p:"``有 async，加载和渲染后续文档元素的过程将和 script.js 的加载与执行并行进行（异步）。解析HTML和下载async脚本同时进行，async脚本下载完成后立即执行，然后开始解析剩下的H ...",l:"audition/js/javascript.html#async",a:"async"},"11.6":{t:"defer\r",p:"``如果一个script加了defer属性，即使放在head里面，它也会在html页面解析完毕之后再去执行，也就是类似于把这个script放在了页面底部。下载时，解析HTML和下载defer脚本同时进 ...",l:"audition/js/javascript.html#defer",a:"defer"},"11.7":{t:"不同\r",p:`
defer是html4的async是html5新增的
执行时间不同，async是下载完后立即执行，defer是在html解析完后再执行,在DOM树构建完成，DOMContentLoaded之前执行
 ...`,l:"audition/js/javascript.html#不同",a:"不同"},"11.8":{t:"立即执行函数是闭包\r",p:`立即执行函数是闭包，因为立即执行，所以定义在return上，所以是闭包，var声明变量时在闭包里不会提升，私有属性
`,l:"audition/js/javascript.html#立即执行函数是闭包",a:"立即执行函数是闭包"},"11.9":{t:"class类的函数默认是严格模式\r",p:`class类里的函数默认是严格模式，类中的方法的this不是固定的，以方法形式调用this是当前实例，以普通函数形式调时严格模式下this指向undefined，以箭头函数调用时this指向当前实例
`,l:"audition/js/javascript.html#class类的函数默认是严格模式",a:"class类的函数默认是严格模式"},"11.10":{t:"JS 执行机制\r",p:"\r",l:"audition/js/javascript.html#js-执行机制",a:"js-执行机制"},"11.11":{t:"eventloop事件循环\r",p:"同步任务执行完，就会去任务队列中拿一个宏任务放到执行栈中执行，执行完该宏任务中的所有微任务，再到任务队列中拿宏任务，即一个宏任务、所有微任务、渲染、一个宏任务、所有微任务、渲染...(不是所有微任务之 ...",l:"audition/js/javascript.html#eventloop事件循环",a:"eventloop事件循环"},"11.12":{t:"同步异步\r",p:`
同步任务：指排队在主线程上依次执行的任务
异步任务：不进入主线程，而进入任务队列的任务，又分为宏任务和微任务

宏任务： 渲染事件、请求、script、setTimeout、setInterval、 ...`,l:"audition/js/javascript.html#同步异步",a:"同步异步"},"11.13":{t:"宏任务和微任务\r",p:`
事件循环由宏任务和在执行宏任务期间产生的所有微任务组成。完成当下的宏任务后，会立刻执行所有在此期间入队的微任务。
这种设计是为了给高优先级任务一个插队的机会，微任务比宏任务有更高优先级。否则新入队的 ...`,l:"audition/js/javascript.html#宏任务和微任务",a:"宏任务和微任务"},"11.14":{t:"setTimeout的误区\r",p:`
setTimeout的回调不一定在指定时间后能执行。而是在指定时间后，将回调函数放入事件循环的队列中。
如果时间到了，JS引擎还在执行同步任务，这个回调函数需要等待；如果当前事件循环的队列里还有其他 ...`,l:"audition/js/javascript.html#settimeout的误区",a:"settimeout的误区"},"11.15":{t:"nextTick 永远大于 promise.then \r",p:`process.nextTick()将函数插入到tick队列，promise.then 将函数插入到微任务队列，tick队列比微任务队列先执行
`,l:"audition/js/javascript.html#nexttick-永远大于-promise-then",a:"nexttick-永远大于-promise-then"},"11.16":{t:"队列执行顺序\r",p:`调用栈 --&gt; tick队列 --&gt; 微任务队列 --&gt; 宏任务队列
`,l:"audition/js/javascript.html#队列执行顺序",a:"队列执行顺序"},"11.17":{t:"深拷贝浅拷贝\r",p:"",l:"audition/js/javascript.html#深拷贝浅拷贝",a:"深拷贝浅拷贝"},"11.18":{t:"深拷贝\r",p:"深拷贝是将一个对象从内存中完整的拷贝一份出来,从堆内存中开辟一个新的区域存放新对象（新旧对象不共享同一块内存）,且修改新对象不会影响原对象（深拷贝采用了在堆内存中申请新的空间来存储数据，这样每个可以避 ...",l:"audition/js/javascript.html#深拷贝",a:"深拷贝"},"11.19":{t:"浅拷贝\r",p:"如果属性是基本类型，拷贝的就是基本类型的值，如果属性是引用类型，拷贝的就是内存地址（新旧对象共享同一块内存），所以如果其中一个对象改变了这个地址，就会影响到另一个对象（只是拷贝了指针，使得两个指针指向 ...",l:"audition/js/javascript.html#浅拷贝",a:"浅拷贝"},"11.20":{t:"赋值和浅拷贝的区别\r",p:`
赋值：新对象改变会影响原对象，赋值后原对象改变也会影响新对象，就像是一个整体
浅拷贝：新对象改变不会影响原对象，拷贝后原对象改变也不会影响新对象，就像地址一样的两个不同的个体

`,l:"audition/js/javascript.html#赋值和浅拷贝的区别",a:"赋值和浅拷贝的区别"},"11.21":{t:"闭包\r",p:"在JavaScript中，闭包（Closure）是指能够访问外部函数作用域中变量的函数。当一个内部函数引用了其外部函数的变量时，就形成了一个闭包。闭包使得函数可以保留对其定义时作用域内的变量和参数的引 ...",l:"audition/js/javascript.html#闭包",a:"闭包"},"11.22":{t:"内存泄漏\r",p:`比如：意外的全局变量，给全局变量赋值
`,l:"audition/js/javascript.html#内存泄漏",a:"内存泄漏"},"11.23":{t:"内存的生命周期\r",p:`
分配内存，
在内存中进行操作
垃圾清除，释放内存

`,l:"audition/js/javascript.html#内存的生命周期",a:"内存的生命周期"},"11.24":{t:"垃圾回收机制\r",p:`
从全局对象 window 开始，顺着引用表能找到的都不是内存垃圾，不会被回收掉。只有那些找不到的对象才是内存垃圾，才会在适当的时机被 gc 回收
回收那些不再使用的内存，本质上是找到内存中可以释放的 ...`,l:"audition/js/javascript.html#垃圾回收机制",a:"垃圾回收机制"},"11.25":{t:"执行上下文\r",p:"函数在执行时，JS 引擎会创建执行上下文，该执行上下文会包含函数的作用域链，其次包含函数内部定义的变量、参数等。在执行时，会首先查找当前作用域下的变量，如果找不到，就会沿着作用域链中查找，一直到全局作 ...",l:"audition/js/javascript.html#执行上下文",a:"执行上下文"},"11.26":{t:"isNaN 与 Number.isNaN的区别？\r",p:`
isNaN：除了判断NaN为true，还会把不能转成数字的判断为true，例如字符串'xxx'
Number.isNaN：只有判断NaN时为true，其余情况都为false

console.log ...`,l:"audition/js/javascript.html#isnan-与-number-isnan的区别",a:"isnan-与-number-isnan的区别"},"11.27":{t:"hasOwnProperty\r",p:`找到静态方法定义在实例对象上的属性，找不到实例方法定义在原型对象上的属性
function Person(name) {
  this.name = name
}
Person.prototype.a ...`,l:"audition/js/javascript.html#hasownproperty",a:"hasownproperty"},"11.28":{t:"&& ||\r",p:`a &amp;&amp; b :a为真时执行b，a为假时执行a
a || b :a为假时执行b，a为真时执行a
`,l:"audition/js/javascript.html#",a:""},"11.29":{t:"valueOf 与 toString\r",p:`valueOf()方法用于返回指定对象的原始值，若对象没有原始值，则将返回对象本身。toString()返回一个代表该对象的字符串。

valueOf偏向于运算，toString偏向于显示
对象转换时 ...`,l:"audition/js/javascript.html#valueof-与-tostring",a:"valueof-与-tostring"},"11.30":{t:"JavaScript变量在内存中具体存储形式？\r",p:`
基本数据类型：存在栈内存里
引用数据类型：指针存栈内存，指向堆内存中一块地址，内容存在堆内存中

`,l:"audition/js/javascript.html#javascript变量在内存中具体存储形式",a:"javascript变量在内存中具体存储形式"},"11.31":{t:"JavaScript的装箱和拆箱？\r",p:"",l:"audition/js/javascript.html#javascript的装箱和拆箱",a:"javascript的装箱和拆箱"},"11.32":{t:"装箱：把基本数据类型转化为对应的引用数据类型的操作\r",p:"\r",l:"audition/js/javascript.html#装箱-把基本数据类型转化为对应的引用数据类型的操作",a:"装箱-把基本数据类型转化为对应的引用数据类型的操作"},"11.33":{t:"拆箱：将引用数据类型转化为对应的基本数据类型的操作\r",p:`通过valueOf或者toString方法实现拆箱操作
var objNum = new Number(123);  
var objStr =new String(&quot;123&quot;); ...`,l:"audition/js/javascript.html#拆箱-将引用数据类型转化为对应的基本数据类型的操作",a:"拆箱-将引用数据类型转化为对应的基本数据类型的操作"},"11.34":{t:"null和undefined的异同点有哪些？\r",p:`
都是空变量
都是假值，转布尔值都是false
null == undefined 为 true
不同点
typeof判断null为object，判断undefined为undefined null转 ...`,l:"audition/js/javascript.html#null和undefined的异同点有哪些",a:"null和undefined的异同点有哪些"},"11.35":{t:"为什么typeof null 是object？\r",p:`不同的数据类型在底层都是通过二进制表示的，二进制前三位为000则会被判断为object类型，而null底层的二进制全都是0，那前三位肯定也是000，所以被判断为object
`,l:"audition/js/javascript.html#为什么typeof-null-是object",a:"为什么typeof-null-是object"},"11.36":{t:"== 与 === 的区别？\r",p:`
==：在比较过程中会存在隐式转换
===：需要类型相同，值相同，才能为true

`,l:"audition/js/javascript.html#与-的区别",a:"与-的区别"},"11.37":{t:"JavaScript的隐式转换规则？\r",p:`
转成string类型： +（字符串连接符）
转成number类型：++/--(自增自减运算符) + - * / %(算术运算符) &gt; &lt; &gt;= &lt;= == != === != ...`,l:"audition/js/javascript.html#javascript的隐式转换规则",a:"javascript的隐式转换规则"},"11.38":{t:"双等号左右两边的转换规则？\r",p:`
null == undefined 为 true
如果有一个操作数是布尔值，则在比较相等性之前先将其转换为数值——false转换为0，而true转换为1；
如果一个操作数是字符串，另一个操作数是数值 ...`,l:"audition/js/javascript.html#双等号左右两边的转换规则",a:"双等号左右两边的转换规则"},"11.39":{t:"undefined >= undefined 为什么是 false ？\r",p:`按照隐式转换规则，可转换成NaN &gt;= NaN，NaN 不等于 NaN，也不大于，所以是false
`,l:"audition/js/javascript.html#undefined-undefined-为什么是-false",a:"undefined-undefined-为什么是-false"},"11.40":{t:"null >= null 为什么是 true？\r",p:`按照隐式转换规则，可转换成0 &gt;= 0，0 等于 0，所以是true
`,l:"audition/js/javascript.html#null-null-为什么是-true",a:"null-null-为什么是-true"},"11.41":{t:"[] == ![] 为什么是 true ？\r",p:`按照双等号左右两边的转换规则

! 优先级高于 ==，[]不是假值，所以先转换成 [] == false
右边为布尔值，false先转数字0，所以可转换为[] == 0
左边为对象，[]调用toStr ...`,l:"audition/js/javascript.html#为什么是-true",a:"为什么是-true"},"11.42":{t:"0.1 + 0.2 === 0.3，对吗？\r",p:`不对，JavaScript的计算存在精度丢失问题

原因：JavaScript中小数是浮点数，需转二进制进行运算，有些小数无法用二进制表示，所以只能取近似值，所以造成误差
解决方法：
先变成整数运算， ...`,l:"audition/js/javascript.html#_0-1-0-2-0-3-对吗",a:"_0-1-0-2-0-3-对吗"},"11.43":{t:"什么是匿名函数？\r",p:`匿名函数：就是没有函数名的函数
`,l:"audition/js/javascript.html#什么是匿名函数",a:"什么是匿名函数"},"11.44":{t:"绑定点击事件有几种方式？\r",p:`三种
xxx.onclick = function (){}
&lt;xxx onclick=&quot;&quot;&gt;&lt;/xxx&gt;
xxx.addEventListener('cl ...`,l:"audition/js/javascript.html#绑定点击事件有几种方式",a:"绑定点击事件有几种方式"},"11.45":{t:"addEventListener的第三个参数是干嘛的？\r",p:`第三个变量传一个布尔值，需不需要阻止冒泡，默认是false，不阻止冒泡,决定事件是在捕获（true）或冒泡阶段(false)执行
`,l:"audition/js/javascript.html#addeventlistener的第三个参数是干嘛的",a:"addeventlistener的第三个参数是干嘛的"},"11.46":{t:"函数声明和函数表达式的区别？\r",p:`
函数声明：享受函数提升
函数表达式：归类于变量声明，享受变量提升
函数提升优先级 &gt; 变量提升优先级

console.log(fun) // fun () {}
// 函数表达式
var f ...`,l:"audition/js/javascript.html#函数声明和函数表达式的区别",a:"函数声明和函数表达式的区别"},"11.47":{t:"JavaScript的事件流模型有哪些？\r",p:`
事件冒泡：由最具体的元素接收，并往上传播
事件捕获：由最不具体的元素接收，并往下传播
DOM事件流：事件捕获 -&gt; 目标阶段 -&gt; 事件冒泡

`,l:"audition/js/javascript.html#javascript的事件流模型有哪些",a:"javascript的事件流模型有哪些"},"11.48":{t:"Ajax、Axios、Fetch有啥区别？\r",p:`
Ajax：是对XMLHttpRequest对象（XHR）的封装
Axios：是基于Promise对XHR对象的封装
Fetch：是window的一个方法，也是基于Promise，但是与XHR无关，不 ...`,l:"audition/js/javascript.html#ajax、axios、fetch有啥区别",a:"ajax、axios、fetch有啥区别"},"11.49":{t:"load、$(document).ready、DOMContentLoaded的区别？\r",p:`DOM文档加载的步骤为：

解析HTML结构。
加载外部脚本和样式表文件。
解析并执行脚本代码。
DOM树构建完成。// DOMContentLoaded触发、$(document).ready触发
 ...`,l:"audition/js/javascript.html#load、-document-ready、domcontentloaded的区别",a:"load、-document-ready、domcontentloaded的区别"},"11.50":{t:"如何阻止事件冒泡？\r",p:`function stopBubble(e) {
  if (e.stopPropagation) {
    e.stopPropagation()
  } else {
    window.ev ...`,l:"audition/js/javascript.html#如何阻止事件冒泡",a:"如何阻止事件冒泡"},"11.51":{t:"如何阻止事件默认行为？\r",p:`function stopDefault(e) {
  if (e.preventDefault) {
    e.preventDefault();
  } else {
    window.ev ...`,l:"audition/js/javascript.html#如何阻止事件默认行为",a:"如何阻止事件默认行为"},"11.52":{t:"什么是事件委托？\r",p:`当所有子元素都需要绑定相同的事件的时候，可以把事件绑定在父元素上，这就是事件委托，优点有：

绑定在父元素上只需要绑定一次，节省性能
子元素不需要每个都去绑定同一事件
如果后续又有新的子元素添加，会由 ...`,l:"audition/js/javascript.html#什么是事件委托",a:"什么是事件委托"},"11.53":{t:"如何实现数组去重？\r",p:`
使用 Map 去重

function quchong1(arr) {
  const newArr = []; // 创建一个空数组存储去重后的元素
  arr.reduce((pre, next ...`,l:"audition/js/javascript.html#如何实现数组去重",a:"如何实现数组去重"},"11.54":{t:"NaN是什么？有什么特点？\r",p:`NaN不等于自身，也就是 NaN === NaN 为 false NaN为假值，转布尔值为false

NaN本质是一个number，typeof NaN === number

`,l:"audition/js/javascript.html#nan是什么-有什么特点",a:"nan是什么-有什么特点"},"11.55":{t:"JavaScript继承方式有几种？ \r",p:`参考
`,l:"audition/js/javascript.html#javascript继承方式有几种",a:"javascript继承方式有几种"},"11.56":{t:"class继承super \r",p:`super 关键字用于在子类中访问和调用父类的构造函数、静态方法和原型方法
`,l:"audition/js/javascript.html#class继承super",a:"class继承super"},"11.57":{t:"数组常用方法（否影响原数组）\r",p:`array



方法
作用
是否影响原数组




push
在数组后添加元素，返回数组长度
✅


pop
删除数组最后一项，返回被删除项
✅


shift
删除数组第一项，并返回被删除项
✅
 ...`,l:"audition/js/javascript.html#数组常用方法-否影响原数组",a:"数组常用方法-否影响原数组"},"11.58":{t:"Math的常用方法有哪些？\r",p:`


方法
作用




Math.max(...arr)
取arr中的最大值


Math.min(...arr)
取arr中的最小值


Math.ceil(小数)
小数向上取整


Math.f ...`,l:"audition/js/javascript.html#math的常用方法有哪些",a:"math的常用方法有哪些"},"11.59":{t:"JS中有哪些不同类型的弹出框？\r",p:`在JS中有三种类型的弹出框可用，分别是：
Alert Confirm

Prompt

`,l:"audition/js/javascript.html#js中有哪些不同类型的弹出框",a:"js中有哪些不同类型的弹出框"},"11.60":{t:"如何将 JS 日期转换为ISO标准\r",p:`toISOString() 方法用于将js日期转换为ISO标准。 它使用ISO标准将js Date对象转换为字符串。如：
var date = new Date();
var n = date.toI ...`,l:"audition/js/javascript.html#如何将-js-日期转换为iso标准",a:"如何将-js-日期转换为iso标准"},"11.61":{t:"如何在JS中编码和解码 URL\r",p:`encodeURI() 函数用于在JS中对URL进行编码。它将url字符串作为参数并返回编码的字符串。
注意： encodeURI()不会编码类似这样字符： / ? : @ &amp; = + $ # ...`,l:"audition/js/javascript.html#如何在js中编码和解码-url",a:"如何在js中编码和解码-url"},"11.62":{t:"什么是BOM？有哪些api？\r",p:`BOM就是browser object model，浏览器对象模型



api
作用
代表方法或属性




window.history
操纵浏览器的记录
history.back()  hist ...`,l:"audition/js/javascript.html#什么是bom-有哪些api",a:"什么是bom-有哪些api"},"11.63":{t:"BOM 和 DOM 的关系\r",p:`
BOM全称Browser Object Model，即浏览器对象模型，主要处理浏览器窗口和框架，没有统一遵循的标准
DOM全称Document Object Model，即文档对象模型，是 HTML ...`,l:"audition/js/javascript.html#bom-和-dom-的关系",a:"bom-和-dom-的关系"},"11.64":{t:"JS中的substr()和substring()函数有什么区别\r",p:"",l:"audition/js/javascript.html#js中的substr-和substring-函数有什么区别",a:"js中的substr-和substring-函数有什么区别"},"11.65":{t:"substr()\r",p:`substr() 函数的形式为substr(startIndex,length)。 它从startIndex返回子字符串并返回'length'个字符数。
var s = &quot;hello&quo ...`,l:"audition/js/javascript.html#substr",a:"substr"},"11.66":{t:"substring() \r",p:`substring() 函数的形式为substring(startIndex,endIndex)。 它返回从startIndex到endIndex - 1的子字符串。
var s = &quot;he ...`,l:"audition/js/javascript.html#substring",a:"substring"},"11.67":{t:'解释一下 "use strict" ?\r',p:"“use strict”是Es5中引入的js指令。 使用“use strict”指令的目的是强制执行严格模式下的代码。 在严格模式下，咱们不能在不声明变量的情况下使用变量。 早期版本的js忽略了“us ...",l:"audition/js/javascript.html#解释一下-use-strict",a:"解释一下-use-strict"},"11.68":{t:"input标签\r",p:`
&lt;input&gt; 标签规定了用户可以在其中输入数据的输入字段。
&lt;input&gt; 元素在&lt;form&gt;元素中使用，用来声明允许用户输入数据的 input 控件。输入字段 ...`,l:"audition/js/javascript.html#input标签",a:"input标签"},"11.69":{t:"属性\r",p:`参考
`,l:"audition/js/javascript.html#属性",a:"属性"},"11.70":{t:"arguements\r",p:`类数组，arguments 是一个特殊的对象，表示函数调用时传入的参数列表。它是一个类数组对象，可以通过数字索引获取其中的参数。
arguments 对象可以在函数内部访问，无需像其他参数一样在函数定 ...`,l:"audition/js/javascript.html#arguements",a:"arguements"},"11.71":{t:"类数组转数组方法\r",p:`
Array.from()

var arr = Array.from(arguments);


Array.prototype.slice.call()

var arr = Array.prot ...`,l:"audition/js/javascript.html#类数组转数组方法",a:"类数组转数组方法"},"11.72":{t:"for...in和for...of\r",p:`for...in用key遍历，用于遍历对象的可枚举属性，遍历的顺序不保证与对象属性的添加顺序一致
for...of用值遍历，用于遍历可迭代对象（Iterable）的元素，遍历的顺序不保证与对象属性的添 ...`,l:"audition/js/javascript.html#for-in和for-of",a:"for-in和for-of"},"11.73":{t:"可迭代对象（Iterable）有哪些\r",p:`
使用 for...of 循环来遍历其元素
要成为可迭代对象，对象必须实现 Symbol.iterator 方法，该方法返回一个迭代器对象。迭代器对象必须包含一个 next() 方法，用于提供下一个值 ...`,l:"audition/js/javascript.html#可迭代对象-iterable-有哪些",a:"可迭代对象-iterable-有哪些"},"11.74":{t:"new的过程\r",p:`
创建一个空对象：new 关键字会创建一个空对象，作为即将创建的对象实例。
将空对象绑定到构造函数的原型链上：new 关键字会将空对象的原型链指向构造函数的原型对象。这样，新创建的对象就可以访问构造函 ...`,l:"audition/js/javascript.html#new的过程",a:"new的过程"},"11.75":{t:"事件处理函数event\r",p:`
event.target：表示事件的目标元素，即触发事件的具体元素。
event.currentTarget：表示事件的当前目标元素，即当前正在处理事件的元素。(冒泡时当前目标元素会变)
event ...`,l:"audition/js/javascript.html#事件处理函数event",a:"事件处理函数event"},"12.0":{t:"# Object.prototype\r",p:"\r",l:"audition/js/objectprototype.html",a:"object-prototype"},"12.1":{t:"object\r",p:`在 JavaScript 中，几乎所有的对象都是 Object 类型的实例，它们都会从 Object.prototype 继承属性和方法
`,l:"audition/js/objectprototype.html#object",a:"object"},"12.2":{t:"Object()\r",p:`创建一个新的 Object 对象。该对象将会包裹（wrapper）传入的参数
`,l:"audition/js/objectprototype.html#object",a:"object"},"12.3":{t:"Object.assign()\r",p:`
通过复制一个或多个对象来创建一个新的对象。浅拷贝
Object.assign()方法将所有可枚举属性从一个或多个源对象复制到目标对象，返回修改后的对象。

const target = { a: 1 ...`,l:"audition/js/objectprototype.html#object-assign",a:"object-assign"},"12.4":{t:"Object.create()\r",p:`
Object.create() 方法用于创建一个新的实例对象，使用现有的对象来作为新创建实例对象的原型对象（prototype）。
新创建实例对象.__proto__ === 传入的对象

cons ...`,l:"audition/js/objectprototype.html#object-create",a:"object-create"},"12.5":{t:"Object.defineProperty()\r",p:`Object.defineProperty() 方法会直接在一个对象上定义一个新属性，或者修改一个对象的现有属性，并返回此对象。
`,l:"audition/js/objectprototype.html#object-defineproperty",a:"object-defineproperty"},"12.6":{t:"语法\r",p:`Object.defineProperty(obj, prop, descriptor)

obj要定义属性的对象。
prop要定义或修改的属性的名称或 Symbol 。
descriptor要定义或 ...`,l:"audition/js/objectprototype.html#语法",a:"语法"},"12.7":{t:"Object.defineProperties()\r",p:`给对象添加多个属性并分别指定它们的配置。
var obj = {};
Object.defineProperties(obj, {
  'property1': {
    value: true,
 ...`,l:"audition/js/objectprototype.html#object-defineproperties",a:"object-defineproperties"},"12.8":{t:"Object.entries()\r",p:"Object.entries() 方法返回一个给定对象自身可枚举属性的键值对数组，其排列与使用 for...in 循环遍历该对象时返回的顺序一致（区别在于 for-in 循环还会枚举原型链中的属性）。 ...",l:"audition/js/objectprototype.html#object-entries",a:"object-entries"},"12.9":{t:"Object.freeze()\r",p:"Object.freeze() 方法可以冻结一个对象。一个被冻结的对象再也不能被修改；冻结了一个对象则不能向这个对象添加新的属性，不能删除已有属性，不能修改该对象已有属性的可枚举性、可配置性、可写性， ...",l:"audition/js/objectprototype.html#object-freeze",a:"object-freeze"},"12.10":{t:"Object.fromEntries() \r",p:`Object.fromEntries() 方法把键值对列表转换为一个对象。
const entries = new Map([
  ['foo', 'bar'],
  ['baz', 42]
]);
 ...`,l:"audition/js/objectprototype.html#object-fromentries",a:"object-fromentries"},"12.11":{t:"Object.getPrototypeOf()\r",p:`Object.getPrototypeOf() 方法返回指定对象的原型（内部[[Prototype]]属性的值）。
`,l:"audition/js/objectprototype.html#object-getprototypeof",a:"object-getprototypeof"},"12.12":{t:"语法\r",p:`Object.getPrototypeOf(object)

object:要返回其原型的对象。
返回值:给定对象的原型。如果没有继承属性，则返回 null 。

const prototype1 = ...`,l:"audition/js/objectprototype.html#语法",a:"语法"},"12.13":{t:"Object.setPrototypeOf()\r",p:`Object.setPrototypeOf() 方法设置一个指定的对象的原型（即，内部[[Prototype]] 属性）到另一个对象或 null。
Object.setPrototypeOf(obj, ...`,l:"audition/js/objectprototype.html#object-setprototypeof",a:"object-setprototypeof"},"12.14":{t:"Object.prototype.isPrototypeOf()\r",p:`isPrototypeOf() 方法用于测试一个对象是否存在于另一个对象的原型链上。针对对象本身，不是对象.prototype
prototypeObj.isPrototypeOf(object)

 ...`,l:"audition/js/objectprototype.html#object-prototype-isprototypeof",a:"object-prototype-isprototypeof"},"12.15":{t:"instanceof\r",p:"instanceof 运算符用于检测构造函数的 prototype 属性是否出现在某个实例对象的原型链上。在表达式 &quot;object instanceof AFunction&quot;中，o ...",l:"audition/js/objectprototype.html#instanceof",a:"instanceof"},"12.16":{t:"Object.getOwnPropertyDescriptor()\r",p:`Object.getOwnPropertyDescriptor() 方法返回指定对象上一个自有属性对应的属性描述符。（自有属性指的是直接赋予该对象的属性，不需要从原型链上进行查找的属性）
const  ...`,l:"audition/js/objectprototype.html#object-getownpropertydescriptor",a:"object-getownpropertydescriptor"},"12.17":{t:"Object.getOwnPropertyNames()\r",p:`
Object.getOwnPropertyNames() 方法返回一个由指定对象的所有自身属性的属性名（包括不可枚举属性但不包括 Symbol 值作为名称的属性）组成的数组。
返回一个数组，该数组对 ...`,l:"audition/js/objectprototype.html#object-getownpropertynames",a:"object-getownpropertynames"},"12.18":{t:"Object.getOwnPropertySymbols()\r",p:`Object.getOwnPropertySymbols() 方法返回一个给定对象自身的所有 Symbol 属性的数组。
var obj = {};
var a = Symbol(&quot;a&qu ...`,l:"audition/js/objectprototype.html#object-getownpropertysymbols",a:"object-getownpropertysymbols"},"12.19":{t:"Object.hasOwn()\r",p:`如果指定的对象自身有指定的属性，则静态方法 Object.hasOwn() 返回 true。如果属性是继承的或者不存在，该方法返回 false。
const object1 = {
  prop: ' ...`,l:"audition/js/objectprototype.html#object-hasown",a:"object-hasown"},"12.20":{t:"Object.prototype.hasOwnProperty()\r",p:`hasOwnProperty() 方法会返回一个布尔值，指示对象自身属性中是否具有指定的属性（也就是，是否有指定的键）。

属性值为null或undefind时也会返回true，有值就会返回true
 ...`,l:"audition/js/objectprototype.html#object-prototype-hasownproperty",a:"object-prototype-hasownproperty"},"12.21":{t:"Object.is() \r",p:`Object.is() 方法判断两个值是否为同一个值。返回一个布尔值
Object.is(value1, value2);
Object.is() 方法判断两个值是否为同一个值，如果满足以下任意条件则 ...`,l:"audition/js/objectprototype.html#object-is",a:"object-is"},"12.22":{t:"Object.is() 与 ==和===\r",p:`
Object.is() 与 == 不同。== 运算符在判断相等前对两边的变量（如果它们不是同一类型）进行强制转换（这种行为将 &quot;&quot; == false 判断为 true），而 Ob ...`,l:"audition/js/objectprototype.html#object-is-与-和",a:"object-is-与-和"},"12.23":{t:"Object.isExtensible()\r",p:`Object.isExtensible() 方法判断一个对象是否是可扩展的（是否可以在它上面添加新的属性）。
`,l:"audition/js/objectprototype.html#object-isextensible",a:"object-isextensible"},"12.24":{t:"Object.isFrozen(obj)\r",p:`Object.isFrozen() 方法判断一个对象是否被冻结。
`,l:"audition/js/objectprototype.html#object-isfrozen-obj",a:"object-isfrozen-obj"},"12.25":{t:"Object.keys()\r",p:`Object.keys() 方法会返回一个由一个给定对象的自身可枚举属性组成的数组，数组中属性名的排列顺序和正常循环遍历该对象时返回的顺序一致。
const object1 = {
  a: 'som ...`,l:"audition/js/objectprototype.html#object-keys",a:"object-keys"},"12.26":{t:"Object.values()\r",p:`Object.values() 方法返回一个给定对象自身的所有可枚举属性值的数组，值的顺序与使用 for...in 循环的顺序相同（区别在于 for-in 循环枚举原型链中的属性）。
var obj  ...`,l:"audition/js/objectprototype.html#object-values",a:"object-values"},"12.27":{t:"Object.preventExtensions()\r",p:`Object.preventExtensions() 方法让一个对象变的不可扩展，也就是永远不能再添加新的属性。
`,l:"audition/js/objectprototype.html#object-preventextensions",a:"object-preventextensions"},"12.28":{t:"Object.prototype.propertyIsEnumerable()\r",p:`propertyIsEnumerable() 方法返回一个布尔值，表示指定的属性是否可枚举。
`,l:"audition/js/objectprototype.html#object-prototype-propertyisenumerable",a:"object-prototype-propertyisenumerable"},"12.29":{t:"Object.seal()\r",p:`Object.seal()方法封闭一个对象，阻止添加新属性并将所有现有属性标记为不可配置。当前属性的值只要原来是可写的就可以改变。
`,l:"audition/js/objectprototype.html#object-seal",a:"object-seal"},"12.30":{t:"Object.prototype.toString()\r",p:`toString() 方法返回一个表示该对象的字符串。该方法旨在重写（自定义）派生类对象的类型转换的逻辑。

默认情况下，toString() 不接受任何参数。然而，继承自 Object 的对象可能用 ...`,l:"audition/js/objectprototype.html#object-prototype-tostring",a:"object-prototype-tostring"},"12.31":{t:"Object.prototype.valueOf()\r",p:`Object 的 valueOf() 方法将 this 值转换为一个对象。此方法旨在用于自定义类型转换的逻辑时，重写派生类对象。
function MyNumberType(n) {
  this.n ...`,l:"audition/js/objectprototype.html#object-prototype-valueof",a:"object-prototype-valueof"},"12.32":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"12.33":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"12.34":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"12.35":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"12.36":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"12.37":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"12.38":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"12.39":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"12.40":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"12.41":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"12.42":{t:"\r",p:"\r",l:"audition/js/objectprototype.html#",a:""},"12.43":{t:"\r",p:`
`,l:"audition/js/objectprototype.html#",a:""},"13.0":{t:"# promise\r",p:`
promise是es6处理异步的一种方式，它的本质是一个对象,
当我们new一个promise，此时我们需要传递一个回调函数，这个函数为立即执行的，称之为（executor）
回调有两个参数 res ...`,l:"audition/js/promise.html",a:"promise"},"13.1":{t:"reject和catch\r",p:`// 一、
promise.then((res) =&gt; {
    console.log('then:', res);
}).catch((err) =&gt; {
    console.l ...`,l:"audition/js/promise.html#reject和catch",a:"reject和catch"},"13.2":{t:"promise的状态\r",p:`
它有三种状态分别为 初始状态pending 已完成fulfilled 已失败rejected。

pending(待定)，执行了executor，状态还在等待中，没有被兑现，也没有被拒绝
fulfi ...`,l:"audition/js/promise.html#promise的状态",a:"promise的状态"},"13.3":{t:"resolve不同值的区别\r",p:`
如果resolve传入一个普通的值或者对象，只能传递接受一个参数，那么这个值会作为then回调的参数

const promise = new Promise((resolve, reject) = ...`,l:"audition/js/promise.html#resolve不同值的区别",a:"resolve不同值的区别"},"13.4":{t:"Promise的实例方法\r",p:`
实例方法，存放在Promise.prototype上的方法，也就是Promise的原型对象上，当我new Promise的时候，会把返回的该对象的 promise[[prototype]]（对象原型 ...`,l:"audition/js/promise.html#promise的实例方法",a:"promise的实例方法"},"13.5":{t:"then方法\r",p:`
then方法可以接受参数，一个参数为成功的回调，另一个参数为失败的回调。

const promise = new Promise((resolve,reject)=&gt;{
   resolve ...`,l:"audition/js/promise.html#then方法",a:"then方法"},"13.6":{t:"catch方法\r",p:`
catch的多次调用

const promise = new Promise((resolve, reject) =&gt; {
  reject('ice error')
})

promise ...`,l:"audition/js/promise.html#catch方法",a:"catch方法"},"13.7":{t:"finally方法\r",p:`无论promise状态是fulfilled还是rejected都会执行一次finally方法
const promise = new Promise((resolve, reject) =&gt; { ...`,l:"audition/js/promise.html#finally方法",a:"finally方法"},"13.8":{t:"Promise中的类方法/静态方法\r",p:`
Promise.resolve

Promise.resolve('ice')
//等价于
new Promise((resolve, reject) =&gt; resolve('ice'))

 ...`,l:"audition/js/promise.html#promise中的类方法-静态方法",a:"promise中的类方法-静态方法"},"13.9":{t:"promise其他\r",p:`resolve里储存异步数据，外部则还是同步的
function fn() {
    return new Promise((res) =&gt; {
        console.log(&qu ...`,l:"audition/js/promise.html#promise其他",a:"promise其他"},"13.10":{t:"acync await\r",p:`
acync里面没有await则不起作用相当于还是同步的
await调用函数后，当前函数后的所有代码会被放进微任务队列

async function fn2(){
    console.log(& ...`,l:"audition/js/promise.html#acync-await",a:"acync-await"},"14.0":{t:"# SET&MAP\r",p:"",l:"audition/js/SET&MAP.html",a:"set-map"},"14.1":{t:"Set(集合)\r",p:`Set 是一种叫做集合的数据结构

向 Set 加入值的时候，不会发生类型转换，所以5和&quot;5&quot;是两个不同的值。Set 内部判断两个值是否不同，使用的算法叫做“Same-value- ...`,l:"audition/js/SET&MAP.html#set-集合",a:"set-集合"},"14.2":{t:"Set 实例属性\r",p:`
constructor： 构造函数
size：元素数量

let set = new Set([1, 2, 3, 2, 1])

console.log(set.length)    // unde ...`,l:"audition/js/SET&MAP.html#set-实例属性",a:"set-实例属性"},"14.3":{t:"Set 实例方法\r",p:`
delete(value)：存在即删除集合中value
has(value)：判断集合中是否存在 value
clear()：清空集合
keys()：返回一个包含集合中所有键的迭代器
values( ...`,l:"audition/js/SET&MAP.html#set-实例方法",a:"set-实例方法"},"14.4":{t:"转为数组\r",p:`Array.from方法可以将 Set 结构转为数组
const items = new Set([1, 2, 3, 2])
const array = Array.from(items)
conso ...`,l:"audition/js/SET&MAP.html#转为数组",a:"转为数组"},"14.5":{t:"所以Set可以使用数组里的 map、filter 方法\r",p:`let set = new Set([1, 2, 3])
set = new Set([...set].map(item =&gt; item * 2))
console.log([...set])  ...`,l:"audition/js/SET&MAP.html#所以set可以使用数组里的-map、filter-方法",a:"所以set可以使用数组里的-map、filter-方法"},"14.6":{t:"因此，Set 很容易实现交集（Intersect）、并集（Union）、差集（Difference）\r",p:`let set1 = new Set([1, 2, 3])
let set2 = new Set([1, 3, 4])
let intersect = new Set([...set1].filter ...`,l:"audition/js/SET&MAP.html#因此-set-很容易实现交集-intersect-、并集-union-、差集-difference",a:"因此-set-很容易实现交集-intersect-、并集-union-、差集-difference"},"14.7":{t:"Map(字典) \r",p:`参考
集合 与 字典 的区别：

共同点：集合、字典 可以储存不重复的值
不同点：集合 是以 [value, value]的形式储存元素，字典 是以 [key, value] 的形式储存

const ...`,l:"audition/js/SET&MAP.html#map-字典",a:"map-字典"},"14.8":{t:"属性方法\r",p:`
constructor：构造函数
size：返回字典中所包含的元素个数
set(key, value)：向字典中添加新元素
get(key)：通过键查找特定的数值并返回
has(key)：判断字典中 ...`,l:"audition/js/SET&MAP.html#属性方法",a:"属性方法"},"14.9":{t:"Map 转 Object\r",p:`function map2obj (map){
    let obj = Object.creat(null)
    for (let [key,value] of maps){
         ...`,l:"audition/js/SET&MAP.html#map-转-object",a:"map-转-object"},"14.10":{t:"Object 转 Map\r",p:`function obj2map (obj){
    let map = new Map()
    for (let key of Object.keys[obj]){
        map.s ...`,l:"audition/js/SET&MAP.html#object-转-map",a:"object-转-map"},"15.0":{t:"# this\r",p:"\r",l:"audition/js/this.html",a:"this"},"15.1":{t:"node环境和浏览器环境\r",p:`

在 Node.js 环境下，全局的 this 指向的是一个空对象 {}，也就是说，如果在 Node.js 环境下，直接访问 this，得到的是一个空对象。在 Node.js 模块中，每个模块都有自 ...`,l:"audition/js/this.html#node环境和浏览器环境",a:"node环境和浏览器环境"},"15.2":{t:"this方法\r",p:`在 JavaScript 中，this 的值一般有以下几种情况：


全局作用域中的 this：在全局作用域中调用 this 时，它的值指向全局对象，即在浏览器中指向 window 对象，在 Node ...`,l:"audition/js/this.html#this方法",a:"this方法"},"15.3":{t:"this指向的四种情况？\r",p:`
new操作符创建实例

function Person(name) {
  this.name = name
  console.log(this)
}
// this指向当前person实例对象
 ...`,l:"audition/js/this.html#this指向的四种情况",a:"this指向的四种情况"},"16.0":{t:"# 运算符\r",p:"",l:"audition/js/yunsuanfu.html",a:"运算符"},"16.1":{t:"==\r",p:`相等运算符（==）检查其两个操作数是否相等，返回一个布尔值结果。与严格相等运算符（===）不同，它会比较不同类型的操作数，并尝试强制类型转换。
`,l:"audition/js/yunsuanfu.html#",a:""},"16.2":{t:"隐式转换\r",p:`相等运算符（==）最终转换为数字进行比较
&quot;a&quot; -&gt; NaN
{} -&gt; NaN
undefined -&gt; NaN
NaN -&gt; NaN
[] -&gt; ...`,l:"audition/js/yunsuanfu.html#隐式转换",a:"隐式转换"},"16.3":{t:"优先级\r",p:`JavaScript 中一些常见运算符的优先级
从高到低：

括号：()
成员访问：.、[]
函数调用：()
后缀运算符：++、--
前缀运算符：+、-、!、typeof、void、await
乘法运 ...`,l:"audition/js/yunsuanfu.html#优先级",a:"优先级"},"17.0":{t:"# 数组\r",p:"\r",l:"audition/js/数组方法.html",a:"数组"},"17.1":{t:"数组的方法\r",p:`
静态方法：

Array.from() 从可迭代或者类数组对象创建一个浅拷贝的数组实例
Array.of()  创建一个数组，参数是数组的值
Array()  创建一个数组，参数是数组的长度，值为0 ...`,l:"audition/js/数组方法.html#数组的方法",a:"数组的方法"},"17.2":{t:"数组去重\r",p:"\r",l:"audition/js/数组方法.html#数组去重",a:"数组去重"},"17.3":{t:"数组找一个值的方法\r",p:"\r",l:"audition/js/数组方法.html#数组找一个值的方法",a:"数组找一个值的方法"},"17.4":{t:"entries\r",p:`通过使用迭代器和解构赋值把索引和值一起返回
const words = [&quot;apple&quot;, &quot;banana&quot;, &quot;orange&quot;];
for ...`,l:"audition/js/数组方法.html#entries",a:"entries"},"18.0":{t:"JavaScript中的正则表达式（Regular Expression，简称RegExp）是一种强大的文本匹配工具，它可以用来查找、替换、分割文本等。\r",p:`下面是一些基本的正则表达式语法和用法：

创建正则表达式对象
您可以使用RegExp构造函数来创建正则表达式对象：

var regex = new RegExp(pattern, flags);

 ...`,l:"audition/js/正则表达式.html",a:"javascript中的正则表达式-regular-expression-简称regexp-是一种强大的文本匹配工具-它可以用来查找、替换、分割文本等。"},"19.0":{t:"# 项目\r",p:"",l:"audition/js/项目.html",a:"项目"},"19.1":{t:"组件时怎么封装的\r",p:`
先把组件样式写好，然后为每个组件配置一个公共代码，定义一个方法组建作为参数传入，内部为组件添加install函数，并且通过app.component注册组件，在通过export导出
创建一个声明文件 ...`,l:"audition/js/项目.html#组件时怎么封装的",a:"组件时怎么封装的"},"19.2":{t:"表单样式\r",p:`表单输入框，常规，禁用，尺寸，一键清空，密码显示隐藏，带icon图标，文本域自适应宽高，复合型输入框

Input组件的核心功能:双向数据绑定,原生input的v-model其实就是:value @i ...`,l:"audition/js/项目.html#表单样式",a:"表单样式"},"19.3":{t:"glup打包样式文件\r",p:`因为vite打包样式文件是会把所有的组件的样式合并到一个css文件中，每次都要全部引入所有的样式文件，做不到按需加载，样式文件将使用 gulp 进行打包
`,l:"audition/js/项目.html#glup打包样式文件",a:"glup打包样式文件"},"19.4":{t:"为什么选择gulp\r",p:"gulp很方便，不仅仅是打包css文件，经常用的一个series和parallel定义执行任务顺序执行并行执行，比如说打包时先删除之前的打包文件再打包，可以用series规定执行顺序，样式打包和组件打 ...",l:"audition/js/项目.html#为什么选择gulp",a:"为什么选择gulp"},"19.5":{t:"ts用在哪些方面\r",p:`在组件库上ts主要用来写打包的配置文件，执行命令的函数，删除之前的打包文件函数，获取路径的函数，在js的基础上声明了变量
`,l:"audition/js/项目.html#ts用在哪些方面",a:"ts用在哪些方面"},"19.6":{t:"axios怎么进行二次封装的\r",p:`把api放在一个文件，把请求的地址放在一个文件，写了一个配置文件，在里面重新定义了各种请求错误信息，和一个timeout，和一个获取数据之前的拦截器
`,l:"audition/js/项目.html#axios怎么进行二次封装的",a:"axios怎么进行二次封装的"},"19.7":{t:"怎么用的pinia\r",p:"pinia里存放了一个data是一个空数组，用来存放从服务器拿到的数据，在pinia的配置文件里写项目要用到的actions（方法）和getters（获取器），actions写一些复杂的逻辑和异步逻辑 ...",l:"audition/js/项目.html#怎么用的pinia",a:"怎么用的pinia"},"19.8":{t:"Node.js构建的后端服务器怎么写的\r",p:`用的express写的一些get、post等请求，通过中间件设置了querystring模块来解析请求体，设置了允许跨域的响应头
`,l:"audition/js/项目.html#node-js构建的后端服务器怎么写的",a:"node-js构建的后端服务器怎么写的"},"19.9":{t:"前后端分离\r",p:`
并行开发：前后端分离允许前端和后端团队并行开发，不受彼此的依赖关系限制。这可以显著加快整个开发过程，提高团队的效率。
更好的扩展性：由于前后端分离的松耦合性，您可以更容易地扩展和升级应用程序的不同部 ...`,l:"audition/js/项目.html#前后端分离",a:"前后端分离"},"19.10":{t:"http23\r",p:`HTTP/2：

HTTP/2是HTTP/1.1的升级版本，于2015年发布。它引入了一些重要的改进，其中最显著的是多路复用（multiplexing）功能。
多路复用允许在单个TCP连接上同时发送多 ...`,l:"audition/js/项目.html#http23",a:"http23"},"19.11":{t:"https mitm\r",p:`在HTTPS通信中，中间人攻击（Man-in-the-Middle Attack，缩写为MITM攻击）是一种攻击方式，攻击者试图在通信双方之间插入自己以截获、篡改或窃取通信内容。
正常的HTTPS通信 ...`,l:"audition/js/项目.html#https-mitm",a:"https-mitm"},"19.12":{t:"静态资源缓存\r",p:`配置资源文件的缓存可以通过使用HTTP响应头中的Cache-Control和Expires字段来实现。这些字段可以告诉客户端（浏览器）如何缓存和重新获取资源文件。
使用Cache-Control字段： ...`,l:"audition/js/项目.html#静态资源缓存",a:"静态资源缓存"},"19.13":{t:"layout shift 布局偏移\r",p:"布局偏移（Layout Shift）是指在网页加载过程中，元素的位置发生了突然而意外的变化，可能会导致用户体验的不良影响。这种突然的变化可能会使用户点击错位或产生其他交互问题，影响网页的可用性和可读性 ...",l:"audition/js/项目.html#layout-shift-布局偏移",a:"layout-shift-布局偏移"},"19.14":{t:"优化跨端应用性能\r",p:`代码优化：

选择高效的框架和库：选择经过优化和性能良好的框架和库，以确保代码执行效率和响应速度。
减少重绘和回流：避免频繁的DOM操作，合并多个操作，减少页面重绘和回流，提高性能。
优化网络请求：减 ...`,l:"audition/js/项目.html#优化跨端应用性能",a:"优化跨端应用性能"},"19.15":{t:"webgpu\r",p:`WebGPU是一种新兴的Web标准，旨在为Web开发者提供直接访问图形硬件的低级别图形编程接口。它是WebGL的继任者，旨在提供更高效、更可编程和更现代化的图形处理能力。
`,l:"audition/js/项目.html#webgpu",a:"webgpu"},"19.16":{t:"pnpm和npm\r",p:`而pnpm使用硬链接技术，跳过了解压的过程

速度
空间占用
并发安装
pnpm使用一种称为&quot;锁定文件链接&quot;的机制，将项目的依赖版本信息存储在单独的pnpm-lock.yaml文件 ...`,l:"audition/js/项目.html#pnpm和npm",a:"pnpm和npm"},"19.17":{t:"monorepo\r",p:`Monorepo（单一代码仓库）是一种软件开发模式，它将多个相关的项目或组件放置在同一个代码仓库中管理

Lerna
Yarn Workspaces

`,l:"audition/js/项目.html#monorepo",a:"monorepo"},"20.0":{t:"# Node.js\r",p:"\r",l:"audition/node/nodejs.html",a:"node-js"},"20.1":{t:"Node.js 如何处理 ES6 模块\r",p:`学习 JavaScript 语言，你会发现它有两种格式的模块。&lt;br&gt;
一种是 ES6 模块，简称 ESM；另一种是 Node.js 专用的 CommonJS 模块，简称 CJS。这两种模 ...`,l:"audition/node/nodejs.html#node-js-如何处理-es6-模块",a:"node-js-如何处理-es6-模块"},"20.2":{t:"两种模块的差异\r",p:"语法上面，CommonJS 模块使用require()加载一个模块对象和module.exports输出一个模块对象，ES6 模块使用import引入具体数据和export导出指定数据。&lt;br& ...",l:"audition/node/nodejs.html#两种模块的差异",a:"两种模块的差异"},"20.3":{t:"两种模块的区分\r",p:"Node.js 要求 ES6 模块采用.mjs后缀文件名。也就是说，只要脚本文件里面使用import或者export命令，那么就必须采用.mjs后缀名。Node.js 遇到.mjs文件，就认为它是 E ...",l:"audition/node/nodejs.html#两种模块的区分",a:"两种模块的区分"},"20.4":{t:"加载 \r",p:`ES6 模块import命令可以加载 CommonJS 模块，但是只能整体加载，不能只加载单一的输出项，但是可以这样写：
import packageMain from 'commonjs-packa ...`,l:"audition/node/nodejs.html#加载",a:"加载"},"20.5":{t:"同时支持两种格式的模块\r",p:`是在package.json文件的exports字段，指明两种格式模块各自的加载入口。
&quot;exports&quot;：{ 
    &quot;require&quot;: &quot;./ ...`,l:"audition/node/nodejs.html#同时支持两种格式的模块",a:"同时支持两种格式的模块"},"20.6":{t:"nodejs的内置模块\r",p:`可以直接在node中使用
`,l:"audition/node/nodejs.html#nodejs的内置模块",a:"nodejs的内置模块"},"20.7":{t:"process\r",p:`process表示控制当前node进程

process.exit()结束进程
process.nextTick(()=&gt;{})将函数插入到tick队列
process.nextTick的优先级 ...`,l:"audition/node/nodejs.html#process",a:"process"},"20.8":{t:"Path\r",p:`获取文件夹路径

path.resolve([...path]) 绝对路径，如果是相对路径则自动转为绝对路径
path.resolve(__dirname, path)

`,l:"audition/node/nodejs.html#path",a:"path"},"20.9":{t:"Fs\r",p:`读取磁盘中的文件

fs.readFile
fs.appendFile
fs.mkdir
fs.rmdir

`,l:"audition/node/nodejs.html#fs",a:"fs"},"20.10":{t:"",p:"\r",l:"audition/node/nodejs.html#",a:""},"20.11":{t:"\r",p:"\r",l:"audition/node/nodejs.html#",a:""},"20.12":{t:"",p:`
`,l:"audition/node/nodejs.html#",a:""},"21.0":{t:"1. 存储\r",p:`cookie、localstorage和sessionStorage三者都是在开发中用到的临时存储客户端会话信息或者数据的方法
`,l:"audition/node/node的存储.html",a:"_1-存储"},"21.1":{t:"存储的时间有效期不同\r",p:`
cookie的有效期是可以设置的，默认的情况下是关闭浏览器后失效
sessionStorage的有效期是仅保持在当前页面，关闭当前会话页或者浏览器后就会失效
localStorage的有效期是在不进 ...`,l:"audition/node/node的存储.html#存储的时间有效期不同",a:"存储的时间有效期不同"},"21.2":{t:"存储的大小不同\r",p:`
cookie的存储是4kb左右，存储量较小，一般页面最多存储20条左右信息
localStorage和sessionStorage的存储容量是5Mb(官方介绍，可能和浏览器有部分差异性)

`,l:"audition/node/node的存储.html#存储的大小不同",a:"存储的大小不同"},"21.3":{t:"与服务端的通信\r",p:`
cookie会参与到与服务端的通信中，一般会携带在http请求的头部中，例如一些关键密匙验证等。
localStorage和sessionStorage是单纯的前端存储，不参与与服务端的通信

`,l:"audition/node/node的存储.html#与服务端的通信",a:"与服务端的通信"},"21.4":{t:"操作\r",p:`
cookie

cookie的创建（修改和创建相同，创建同样名称会覆盖之前的）document.cookie=&quot;username=John Doe&quot;
cookie的读取 var  ...`,l:"audition/node/node的存储.html#操作",a:"操作"},"21.5":{t:"对于浏览器的支持\r",p:`
cookie出现的时间较早，目前见到的浏览器都支持
localStorage和sessionStorage出现的时间较晚，对于版本较低的浏览器不支持(比如IE8版本以下的都不支持)

`,l:"audition/node/node的存储.html#对于浏览器的支持",a:"对于浏览器的支持"},"21.6":{t:"2. 什么是token？token是用来干嘛的 \r",p:"\r",l:"audition/node/node的存储.html#_2-什么是token-token是用来干嘛的",a:"_2-什么是token-token是用来干嘛的"},"21.7":{t:"token\r",p:"是“令牌”的意思。Token是服务端生成的一串字符串，以作客户端进行请求的一个令牌，当第一次登录后，服务器生成一个Token便将此Token返回给客户端，以后客户端只需带上这个Token前来请求数据即 ...",l:"audition/node/node的存储.html#token",a:"token"},"21.8":{t:"是用来干嘛的\r",p:`使用token机制的身份验证方法

客户端使用用户名和密码请求登录  客户端 --&gt; 服务端
服务端收到请求，验证用户名和密码   **服务端验证 --&gt; 生成token
验证成功后，服务 ...`,l:"audition/node/node的存储.html#是用来干嘛的",a:"是用来干嘛的"},"21.9":{t:"token存在哪里\r",p:`
存localStorage里，后期每次请求接口都需要把他当做一个字段传给后台，会有xss攻击
存cookie里，会自动发送，缺点不能跨域，会有csrf攻击

`,l:"audition/node/node的存储.html#token存在哪里",a:"token存在哪里"},"21.10":{t:"cookie\r",p:`Cookie是一种在客户端（浏览器）存储数据的机制，它允许服务器在浏览器中存储少量的数据，并在需要时读取这些数据。常见的使用场景包括用户认证、购物车、网站偏好设置等。
Cookie是由服务器发送给浏览 ...`,l:"audition/node/node的存储.html#cookie",a:"cookie"},"22.0":{t:"# vite\r",p:`相较于webpack，vite采用不同方式

开发时，并不对代码打包，直接用ESM方式来运行项目
在项目部署再打包

`,l:"audition/pack/vite.html",a:"vite"},"22.1":{t:"命令\r",p:`&quot;scripts&quot;: 
{
&quot;dev&quot;: &quot;vite&quot;,
&quot;build&quot;: &quot;vite build&quot; ...`,l:"audition/pack/vite.html#命令",a:"命令"},"22.2":{t:"vite脚手架\r",p:`pnpm create vite
`,l:"audition/pack/vite.html#vite脚手架",a:"vite脚手架"},"22.3":{t:"vite.config.js\r",p:`配置文件采用ES6模块化规范
可以使用 defineConfig 工具函数，可以获取类型提示
`,l:"audition/pack/vite.html#vite-config-js",a:"vite-config-js"},"23.0":{t:"# webpack\r",p:`使用步骤：

初始化项目 pnpm init
安装webpack，webpackcil
在项目中创建src目录，写代码默认(index.js)
在终端执行pnpm webpack 默认在dist的ma ...`,l:"audition/pack/webpack.html",a:"webpack"},"23.1":{t:"webpack.config.js\r",p:`配置文件采用commonjs模块化规范
`,l:"audition/pack/webpack.html#webpack-config-js",a:"webpack-config-js"},"23.2":{t:"mode\r",p:`mode：production生产模式，development开发模式
`,l:"audition/pack/webpack.html#mode",a:"mode"},"23.3":{t:"entry\r",p:`entry:

单一入口，打包成一个文件
[]数组形式里写多个入口，打包成一个文件

entry:['./src/file_1.js', './src/file_2.js']


{}对象里写多个入口 ...`,l:"audition/pack/webpack.html#entry",a:"entry"},"23.4":{t:"output\r",p:`output:

{filename:&quot;boundle.js&quot;}
文件名不一样之前打包的不会删除，{filename:&quot;boundle.js&quot;,clean:tr ...`,l:"audition/pack/webpack.html#output",a:"output"},"23.5":{t:"loader\r",p:"webpack 只能理解 JavaScript 和 JSON 文件，这是 webpack 开箱可用的自带能力。loader 让 webpack 能够去处理其他类型的文件，并将它们转换为有效 模块，以供 ...",l:"audition/pack/webpack.html#loader",a:"loader"},"23.6":{t:"bable\r",p:`兼容问题，将新代码转为旧代码，提高兼容性
配置
rules:[
   {
    test: /\\.m?js$/,
    exclude: /(node_modules|bower_componen ...`,l:"audition/pack/webpack.html#bable",a:"bable"},"23.7":{t:"plugin\r",p:`插件 是 webpack 的 支柱 功能。Webpack 自身也是构建于你在 webpack 配置中用到的 相同的插件系统 之上！
插件目的在于解决 loader 无法实现的其他事。
plugins: ...`,l:"audition/pack/webpack.html#plugin",a:"plugin"},"23.8":{t:"webpack-dev-server\r",p:`开发服务器，把代码部署到服务器上，实时自动刷新
`,l:"audition/pack/webpack.html#webpack-dev-server",a:"webpack-dev-server"},"23.9":{t:"devtool&sourcemap\r",p:`devtool:&quot;inline-source-map&quot;,此选项控制是否生成，以及如何生成 source map。
代码经过打包后会被压缩，让调试和错误定位边的非常困难，Source ...`,l:"audition/pack/webpack.html#devtool-sourcemap",a:"devtool-sourcemap"},"24.0":{t:"最全前端八股文\r",p:`这里是 html 的面试题

这里是 css 的面试题

这里是 jvavscript 的面试题

这里是 ES6 的面试题

这里是 vue 的面试题

这里是 TypeScript 的面试题

这 ...`,l:"audition/question.html",a:"最全前端八股文"},"25.0":{t:"# TypeScript\r",p:`参考
`,l:"audition/ts/ts.html",a:"typescript"},"25.1":{t:"数组\r",p:`let arr : string[] = [&quot;a&quot;,&quot;b&quot;]
let arr2：Array&lt;string&gt; = [&quot;a&quot;,&qu ...`,l:"audition/ts/ts.html#数组",a:"数组"},"25.2":{t:"函数\r",p:`//函数声明
function sun(x:number,y:number):number{
    return x+y
}
//函数表达式
let mySum:(x:number,y:number ...`,l:"audition/ts/ts.html#函数",a:"函数"},"25.3":{t:"参数\r",p:`//可选参数
function buildNmae(firstName: string, lastName?: string){
    if(lastName){
        return fi ...`,l:"audition/ts/ts.html#参数",a:"参数"},"25.4":{t:"函数重载\r",p:`函数重载或方法重载是使用相同名称和不同参数数量或类型创建多个方法的一种能力。 方法就是为同一个函数提供多个函数类型定义来进行函数重载，编译器会根据这个列表去处理函数的调用
type Combinabl ...`,l:"audition/ts/ts.html#函数重载",a:"函数重载"},"25.5":{t:"元组\r",p:`元组是 TypeScript 中特有的类型，元组最重要的特性是可以限制数组元素的个数和类型，它特别适合用来实现多值返回。
let x: [string, number]; 
// 类型必须匹配且个数必 ...`,l:"audition/ts/ts.html#元组",a:"元组"},"25.6":{t:"元祖类型的解构赋值\r",p:`let employee: [number, string?] = [1, &quot;Semlinker&quot;];
let [id, username] = employee;
console ...`,l:"audition/ts/ts.html#元祖类型的解构赋值",a:"元祖类型的解构赋值"},"25.7":{t:"void\r",p:`void表示没有任何类型，和其他类型是平等关系，不能直接赋值:
let a: void; 
let b: number = a; // Error

你只能为它赋予null和undefined（在st ...`,l:"audition/ts/ts.html#void",a:"void"},"25.8":{t:"never\r",p:`never类型表示的是那些永不存在的值的类型。
值会永不存在的两种情况：

如果一个函数执行时抛出了异常，那么这个函数永远不存在返回值（因为抛出异常会直接中断程序运行，这使得程序运行不到返回值那一步， ...`,l:"audition/ts/ts.html#never",a:"never"},"25.9":{t:"any\r",p:`在 TypeScript 中，任何类型都可以被归为 any 类型。这让 any 类型成为了类型系统的顶级类型.
`,l:"audition/ts/ts.html#any",a:"any"},"25.10":{t:"unknown\r",p:"unknown与any一样，所有类型都可以分配给unknown unknown与any的最大区别是： 任何类型的值可以赋值给any，同时any类型的值也可以赋值给任何类型。unknown 任何类型的值 ...",l:"audition/ts/ts.html#unknown",a:"unknown"},"25.11":{t:"object、Object 和 \r",p:`
小 object 代表的是所有非原始类型，也就是说我们不能把 number、string、boolean、symbol等 原始类型赋值给 object。在严格模式下，null 和 undefined ...`,l:"audition/ts/ts.html#",a:""},"25.12":{t:"类型推断\r",p:`我们把 TypeScript 这种基于赋值表达式推断类型的能力称之为类型推断
在 TypeScript 中，具有初始化值的变量、有默认值的函数参数、函数返回的类型都可以根据上下文推断出来。比如我们能根 ...`,l:"audition/ts/ts.html#类型推断",a:"类型推断"},"25.13":{t:"类型断言\r",p:`// 尖括号 语法
let someValue: any = &quot;this is a string&quot;;
let strLength: number = (&lt;string&gt; ...`,l:"audition/ts/ts.html#类型断言",a:"类型断言"},"25.14":{t:"非空断言\r",p:"在上下文中当类型检查器无法断定类型时，一个新的后缀表达式操作符 ! 可以用于断言操作对象是非 null 和非 undefined 类型。具体而言，x! 将从 x 值域中排除 null 和 undefi ...",l:"audition/ts/ts.html#非空断言",a:"非空断言"},"25.15":{t:"确定赋值断言\r",p:`允许在实例属性和变量声明后面放置一个 ! 号，从而告诉 TypeScript 该属性会被明确地赋值。为了更好地理解它的作用，我们来看个具体的例子：
let x!: number;
initialize ...`,l:"audition/ts/ts.html#确定赋值断言",a:"确定赋值断言"},"25.16":{t:"字面量类型\r",p:`TypeScript 支持 3 种字面量类型：字符串字面量类型、数字字面量类型、布尔字面量类型，对应的字符串字面量、数字字面量、布尔字面量分别拥有与其值一样的字面量类型
{
  let specifi ...`,l:"audition/ts/ts.html#字面量类型",a:"字面量类型"},"25.17":{t:"let和const分析\r",p:`将 const 定义为一个不可变更的常量，在缺省类型注解的情况下，TypeScript 推断出它的类型直接由赋值字面量的类型决定
{
  const str = 'this is string'; / ...`,l:"audition/ts/ts.html#let和const分析",a:"let和const分析"},"25.18":{t:"接口\r",p:`在面向对象语言中，接口（Interfaces）是一个很重要的概念，它是对行为的抽象，而具体如何行动需要由类（classes）去实现（implement）。
TypeScript 中的接口是一个非常灵活 ...`,l:"audition/ts/ts.html#接口",a:"接口"},"25.19":{t:"可选 | 只读属性\r",p:`interface Person {
  readonly name: string;
  age?: number;
}

只读属性用于限制只能在对象刚刚创建的时候修改其值。此外 TypeScrip ...`,l:"audition/ts/ts.html#可选-只读属性",a:"可选-只读属性"},"25.20":{t:"任意属性\r",p:`有时候我们希望一个接口中除了包含必选和可选属性之外，还允许有其他的任意属性，这时我们可以使用 索引签名 的形式来满足上述要求。
interface Person {
    name: string; ...`,l:"audition/ts/ts.html#任意属性",a:"任意属性"},"25.21":{t:"鸭式辨型法\r",p:`所谓的鸭式辨型法就是像鸭子一样走路并且嘎嘎叫的就叫鸭子，即具有鸭子特征的认为它就是鸭子，也就是通过制定规则来判定对象是否实现这个接口。
interface LabeledValue {
  label ...`,l:"audition/ts/ts.html#鸭式辨型法",a:"鸭式辨型法"},"25.22":{t:"绕开额外属性检查的方式\r",p:`
鸭式辨型法
类型断言
索引签名

`,l:"audition/ts/ts.html#绕开额外属性检查的方式",a:"绕开额外属性检查的方式"},"25.23":{t:"索引签名\r",p:`interface Props { 
  name: string; 
  age: number; 
  money?: number;
  [key: string]: any;
}

let p ...`,l:"audition/ts/ts.html#索引签名",a:"索引签名"},"25.24":{t:"interface 和 type\r",p:`
TypeScript 的核心原则之一是对值所具有的结构进行类型检查。 而接口的作用就是为这些类型命名和为你的代码或第三方代码定义数据模型。
type(类型别名)会给一个类型起个新名字。 type 有 ...`,l:"audition/ts/ts.html#interface-和-type",a:"interface-和-type"},"25.25":{t:"Objects / Functions\r",p:`两者都可以用来描述对象或函数的类型，但是语法不同
//interface
interface Point {
  x: number;
  y: number;
}

interface SetPoi ...`,l:"audition/ts/ts.html#objects-functions",a:"objects-functions"},"25.26":{t:"Other Types\r",p:`与接口不同，类型别名还可以用于其他类型，如基本类型（原始值）、联合类型、元组。
// primitive
type Name = string;

// object
type PartialPoin ...`,l:"audition/ts/ts.html#other-types",a:"other-types"},"25.27":{t:"接口可以定义多次,类型别名不可以\r",p:`与类型别名不同，接口可以定义多次，会被自动合并为单个接口。
interface Point { x: number; }
interface Point { y: number; }
const po ...`,l:"audition/ts/ts.html#接口可以定义多次-类型别名不可以",a:"接口可以定义多次-类型别名不可以"},"25.28":{t:"扩展\r",p:`两者的扩展方式不同，但并不互斥。接口可以扩展类型别名，同理，类型别名也可以扩展接口。

接口的扩展就是继承，通过 extends 来实现。类型别名的扩展就是交叉类型，通过 &amp; 来实现。

接口 ...`,l:"audition/ts/ts.html#扩展",a:"扩展"},"25.29":{t:"泛型\r",p:`用了一个 类型 T，这个 T 是一个抽象类型，只有在调用的时候才确定它的值，这就不用我们复制粘贴无数份代码了。
function identity&lt;T&gt;(arg: T): T {
  re ...`,l:"audition/ts/ts.html#泛型",a:"泛型"},"25.30":{t:"泛型约束\r",p:`类型约束使用 extends 关键字。简单来说就是你定义一个类型，然后让 T 实现这个接口即可
interface Sizeable {
  size: number;
}
function trac ...`,l:"audition/ts/ts.html#泛型约束",a:"泛型约束"},"25.31":{t:" ",p:"",l:"audition/ts/ts.html#",a:""},"25.32":{t:"泛型工具\r",p:`

typeof
typeof 的主要用途是在类型上下文中获取变量或者属性的类型


keyof
keyof 操作符是在 TypeScript 2.1 版本引入的，该操作符可以用于获取某种类型的所有键 ...`,l:"audition/ts/ts.html#泛型工具",a:"泛型工具"},"26.0":{t:"# vue-router\r",p:`官方文档
`,l:"audition/vue/vue-router.html",a:"vue-router"},"26.1":{t:"vue-router\r",p:"",l:"audition/vue/vue-router.html#vue-router",a:"vue-router"},"26.2":{t:"vue-router是什么，描述一下它的原理？\r",p:`Vue Router是Vue官方的路由管理器，有hash和history两种模式

hash模式是通过监听hashchange事件来实现更新页面部分内容的操作，url后面会带有#号
history模式 ...`,l:"audition/vue/vue-router.html#vue-router是什么-描述一下它的原理",a:"vue-router是什么-描述一下它的原理"},"26.3":{t:"如何实现\r",p:"vue-router中有个监听器，用来监听History的变化（浏览器地址改变、点击前进后退按钮）。当监听到History变化之后，vue-router就会依据路由表当中声明了的路由对应匹配的组件，然 ...",l:"audition/vue/vue-router.html#如何实现",a:"如何实现"},"26.4":{t:"hash模式\r",p:"即url中的#以及后面部分，#相当于一个锚点，#后面的内容就是锚点值，当监听锚点值的变化就会改变局部的页面数据。当浏览器向服务器发送请求时，只会把#前面部分发送给服务器，一般前面部分的是不变的，所以h ...",l:"audition/vue/vue-router.html#hash模式",a:"hash模式"},"26.5":{t:"history模式\r",p:"HTML5 Mode是html5新增 history模式，所以也称为history 模式。history 模式改变 url 的方式会导致浏览器向服务器发送请求，但是history 模式可以传输复杂一些 ...",l:"audition/vue/vue-router.html#history模式",a:"history模式"},"26.6":{t:"路由跳转方式有哪些？\r",p:`
内置组件跳转
router.push({ path: '/home' }),
router.replace({ path: '/home' })
router.go()
redirect() 在路由 ...`,l:"audition/vue/vue-router.html#路由跳转方式有哪些",a:"路由跳转方式有哪些"},"26.7":{t:"说一下路由守卫？\r",p:`
为什么：如果需要用户登陆，我们来守卫页面，强制用户跳转到登录页面

路由守卫分为全局路由守卫，路由独享守卫，组件路由守卫

全局路由守卫

全局前置守卫beforeEach,接收to、from、ne ...`,l:"audition/vue/vue-router.html#说一下路由守卫",a:"说一下路由守卫"},"26.8":{t:"完整的导航解析流程\r",p:`
导航被触发。
在失活的组件里调用 beforeRouteLeave 守卫。
调用全局的 beforeEach 守卫。
在渲染该组件的路由被确认前访问组件实例 beforeRouteEnter。
在路 ...`,l:"audition/vue/vue-router.html#完整的导航解析流程",a:"完整的导航解析流程"},"26.9":{t:"懒加载\r",p:`为给客户更好的客户体验，首屏组件加载速度更快一些，解决白屏问题，懒加载简单来说就是延迟加载或按需加载，即在需要的时候的时候进行加载。
也就是，组件现在路由里注册但不进行组件的加载与执行，等到需要访问组 ...`,l:"audition/vue/vue-router.html#懒加载",a:"懒加载"},"26.10":{t:"懒加载实现\r",p:`
懒加载实现的前提：ES6的动态加载模块 - import（），调用import（）之处，被作为分离的模块起点，意思是，被请求的模块和它引用的所有子模块，会分离到一个单独的 chunk 中。

`,l:"audition/vue/vue-router.html#懒加载实现",a:"懒加载实现"},"26.11":{t:"Vue-router路由懒加载的方式\r",p:`
vue-router配置路由，使用vue的异步组件技术，可以实现懒加载，此时一个组件会生成一个js文件。
component: resolve =&gt; require(['放入需要加载的路由地址 ...`,l:"audition/vue/vue-router.html#vue-router路由懒加载的方式",a:"vue-router路由懒加载的方式"},"26.12":{t:"路由元信息\r",p:`将任意信息附加到路由上，如过渡名称、谁可以访问路由等。这些事情可以通过接收属性对象的meta属性来实现，并且它可以在路由地址和导航守卫上都被访问到。
`,l:"audition/vue/vue-router.html#路由元信息",a:"路由元信息"},"26.13":{t:"数据获取\r",p:`有时候，进入某个路由后，需要从服务器获取数据。例如，在渲染用户信息时，你需要从服务器获取用户的数据。我们可以通过两种方式来实现：

导航完成之后获取：先完成导航，然后在接下来的组件生命周期钩子中获取数 ...`,l:"audition/vue/vue-router.html#数据获取",a:"数据获取"},"26.14":{t:"vue路由的传参方式\r",p:`
动态路由参数：可以在路由定义中使用冒号（:）来定义动态的路由参数。
查询参数：查询参数是通过 URL 的查询字符串传递的键值对
路由对象参数：可以通过在编程式导航中传递query一个包含参数的路由对 ...`,l:"audition/vue/vue-router.html#vue路由的传参方式",a:"vue路由的传参方式"},"26.15":{t:"params和query\r",p:`params：
动态路由参数,传递方式：params 是通过路由的路径进行传递的，参数直接嵌入在路由路径中。在路由组件中可以通过 $route.params 来获取传递的参数。
query：
查询参数 ...`,l:"audition/vue/vue-router.html#params和query",a:"params和query"},"27.0":{t:"# vue\r",p:"\r",l:"audition/vue/vue.html",a:"vue"},"27.1":{t:"对vue的理解\r",p:`
他是一个流行的前端框架
提供组件化开发
响应式数据绑定
指令和插值表达式
路由
状态管理
过渡和动画：Vue支持在组件间添加过渡效果和动画

`,l:"audition/vue/vue.html#对vue的理解",a:"对vue的理解"},"27.2":{t:"单页面应用\r",p:`单页应用(SPA - single page application)

只在第一次加载页面时，返回唯一的html页面和它的公共静态资源，后续的页面跳转都不会从服务端拿html文件。（hash和his ...`,l:"audition/vue/vue.html#单页面应用",a:"单页面应用"},"27.3":{t:"vue生命周期\r",p:`


Vue2(选项式API)
Vue3(setup)
描述




beforeCreate
setup
实例创建前


created
setup
实例创建后


beforeMount
onBe ...`,l:"audition/vue/vue.html#vue生命周期",a:"vue生命周期"},"27.4":{t:"setup\r",p:"setup函数是组件中的一个特殊函数，用于在组件实例创建之前进行一些初始化操作。你可以使用onBeforeMount和onMounted这两个函数来模拟beforeCreate和created的行为。 ...",l:"audition/vue/vue.html#setup",a:"setup"},"27.5":{t:"各自生命周期的事情\r",p:`beforeCreate   setup
created        setup              常用于数据请求、事件监听、定时器开启等
beforeMount    onBeforeMo ...`,l:"audition/vue/vue.html#各自生命周期的事情",a:"各自生命周期的事情"},"27.6":{t:"vue父子组件生命周期\r",p:`
渲染过程
父beforeCreate -&gt; 父created -&gt; 父beforeMount -&gt; 子beforeCreate -&gt; 子created -&gt; 子befo ...`,l:"audition/vue/vue.html#vue父子组件生命周期",a:"vue父子组件生命周期"},"27.7":{t:"注意\r",p:`如果子组件是异步组件的话它们的执行顺序会发生改变，会先执行完父组件的生命周期然后再执行子组件的生命周期
`,l:"audition/vue/vue.html#注意",a:"注意"},"27.8":{t:"v-if和v-show\r",p:`
v-if表示一个dom元素是否被创建，而v-show则是控制这个dom元素的display属性是否为none
一般在频繁切换状态的地方使用v-show,v-if则更适合条件不经常改变的场景，因为它切 ...`,l:"audition/vue/vue.html#v-if和v-show",a:"v-if和v-show"},"27.9":{t:"v-for和v-if优先级\r",p:`
开发过程中一般不建议同时将v-for和v-if放在一个标签中使用
Vue2中v-for的优先级会更高，所以会先执行循环，再进行v-if判断，所以这样就会导致无论需不需展示这个元素，都会先遍历整个列表 ...`,l:"audition/vue/vue.html#v-for和v-if优先级",a:"v-for和v-if优先级"},"27.10":{t:"说一下computed和watch\r",p:`
computed是计算属性,当一个属性受一个或者多个属性影响的时候可以使用.watch是侦听器,当我们需要根据一个属性的变化而做出一些处理的时候,可以使用watch来对这个属性进行监听
comput ...`,l:"audition/vue/vue.html#说一下computed和watch",a:"说一下computed和watch"},"27.11":{t:"computed和methods的区别？\r",p:`computed和methods的差异是它具备缓存性，如果依赖项不变时不会重新计算。
`,l:"audition/vue/vue.html#computed和methods的区别",a:"computed和methods的区别"},"27.12":{t:"computed和watch使用场景\r",p:`
计算属性computed常用场景是简化在template模板中的复杂表达式，模板中出现太多逻辑判断会造成模板不易维护。
computed不支持异步
都是以 Vue 的依赖追踪机制为基础，当某个依赖数 ...`,l:"audition/vue/vue.html#computed和watch使用场景",a:"computed和watch使用场景"},"27.13":{t:"computed的原理\r",p:`computed 的实现是基于 Watcher 实例对象(被观察者)的
`,l:"audition/vue/vue.html#computed的原理",a:"computed的原理"},"27.14":{t:"computed的两种定义方式\r",p:`一种是方法，另一种是 get，set 属性。而且，其内部监听的对象必须是已经定义响应式的属性，比如 data 的属性、vuex 的属性。
`,l:"audition/vue/vue.html#computed的两种定义方式",a:"computed的两种定义方式"},"27.15":{t:"computed属性的初始化\r",p:`
vue 在创建 computed 属性时候，遍历computed属性，为每个computed属性都创建一个watcher,对每个computed属性进行get劫持
get劫持是最关键的步骤

将co ...`,l:"audition/vue/vue.html#computed属性的初始化",a:"computed属性的初始化"},"27.16":{t:"computed 属性\r",p:"vue 在创建 computed 属性时候，会循环所有计算属性，每一个计算属性会创建一个 watcher，(并且在通过 defineProperty(vue2),proxy(vue3) 定义监听)，在 ...",l:"audition/vue/vue.html#computed-属性",a:"computed-属性"},"27.17":{t:"依赖收集的时机\r",p:`computed 收集时机和 data 一样，是在组件挂载前，但是其收集对象是自己属性对应的 watch，而 data 本身所有数据对应一个 watch。
`,l:"audition/vue/vue.html#依赖收集的时机",a:"依赖收集的时机"},"27.18":{t:"watch和watchEffect区别和用法\r",p:`
watch 那样接收一个明确的数据源,watchEffect 也是一个监听器,它只接收一个回调函数。而在这个回调函数当中，它会自动监听响应数据，当回调函数里面的响应数据发生变化，回调函数就会立即执行 ...`,l:"audition/vue/vue.html#watch和watcheffect区别和用法",a:"watch和watcheffect区别和用法"},"27.19":{t:"vue2和vue3区别\r",p:`
写法上的区别:vue2使用的是options(选项)Api,vue3的是composition Api(当然vue3也兼容composition api)。options Api中methods，c ...`,l:"audition/vue/vue.html#vue2和vue3区别",a:"vue2和vue3区别"},"27.20":{t:"VUE初始化阶段\r",p:`
解析组件配置：Vue首先会解析组件的配置对象，包括模板(template)、数据(data)、计算属性(computed)、方法(methods)等。
初始化数据响应式：Vue会对数据对象进行响应式 ...`,l:"audition/vue/vue.html#vue初始化阶段",a:"vue初始化阶段"},"27.21":{t:"Vue2 实现响应式的核心是通过「数据劫持」和「观察者模式」来实现的。\r",p:`
数据劫持：Vue 使用 Object.defineProperty() 方法来劫持对象的属性，为其添加 getter 和 setter。当访问或修改这些属性时，Vue 可以捕捉到，并执行相应的逻辑。 ...`,l:"audition/vue/vue.html#vue2-实现响应式的核心是通过「数据劫持」和「观察者模式」来实现的。",a:"vue2-实现响应式的核心是通过「数据劫持」和「观察者模式」来实现的。"},"27.22":{t:"数组的改进\r",p:`
响应式数组，vue3数组可以直接使用
reactive和readonly
watchEffect的数组侦听
v-for的key属性
Array.prototype方法的修改：Vue 3对一些数组方法 ...`,l:"audition/vue/vue.html#数组的改进",a:"数组的改进"},"27.23":{t:"vue插件使用\r",p:`将组件实例挂载到全局，
vue实例会有一个use函数,它接受的是一个带有install函数的对象和一个可选的选项对象,当我们使用 vue.use(plugin)或者app.use(plugin)会调用 ...`,l:"audition/vue/vue.html#vue插件使用",a:"vue插件使用"},"27.24":{t:"vue插槽\r",p:`插槽slot可以理解为占坑，当使用一个组件的时候，在组件标签里的对应的内容就会替换掉这个组件中的slot标签。

插槽分为默认插槽，具名插槽，作用域插槽。
默认插槽 子组件中用slot标签来确定渲染位 ...`,l:"audition/vue/vue.html#vue插槽",a:"vue插槽"},"27.25":{t:"组件通信\r",p:`


方式
Vue2
Vue3




父传子
props
props


父传子
$attrs
attrs


父传子孙
provide/inject
provide/inject


子传父
$e ...`,l:"audition/vue/vue.html#组件通信",a:"组件通信"},"27.26":{t:"prosps\r",p:`props定义在子组件里，父组件通过v-bind给子组件传值，子组件渲染出来
`,l:"audition/vue/vue.html#prosps",a:"prosps"},"27.27":{t:"emit\r",p:`
子组件通过自定义事件往父组件里传值，父组件调用子组件通过v-on接收，
父组件里给子组件自定义事件@xxx=func，func是写在父组件中的函数，子组件通过某种方式比如@click=$emit(' ...`,l:"audition/vue/vue.html#emit",a:"emit"},"27.28":{t:"attrs\r",p:`:=attrs
const attrs = useAttrs()
`,l:"audition/vue/vue.html#attrs",a:"attrs"},"27.29":{t:"ref\r",p:`在Vue中，使用ref可以在组件中引用子组件或DOM元素

子组件的ref：当在父组件中使用ref引用子组件时，ref会被赋值为子组件实例。这意味着通过ref可以直接访问子组件的属性和方法，并在父组件 ...`,l:"audition/vue/vue.html#ref",a:"ref"},"27.30":{t:"slot\r",p:`作用域插槽：可以传递数据的插槽，子组件可以将数据传给父组件，父组件在自己的模板中使用该数据。
父接收一个参数slotProps，它是一个包含了插槽数据的对象。
//子
&lt;div &gt;
    ...`,l:"audition/vue/vue.html#slot",a:"slot"},"27.31":{t:"vuex\r",p:`
Vuex是Vue中的全局状态管理框架，它可以管理应用的所有组件的状态。并不是每个项目都需要引入Vuex的，当我们的项目有很多个页面，并且这些页面共享着多个数据状态，此时我们可以引入Vuex。
Vue ...`,l:"audition/vue/vue.html#vuex",a:"vuex"},"27.32":{t:"pinia\r",p:`
创建Store，import {defineStore} from 'pinia',

import {defineStore} from 'pinia'
exporet default mySto ...`,l:"audition/vue/vue.html#pinia",a:"pinia"},"27.33":{t:"调用其他store\r",p:`在 action 里调用其他 store 里的 action 也比较简单，引入对应的 store 后即可访问其内部的方法了。
// src/store/app.ts

export const use ...`,l:"audition/vue/vue.html#调用其他store",a:"调用其他store"},"27.34":{t:"vue自定义指令\r",p:`vue自定义指令
`,l:"audition/vue/vue.html#vue自定义指令",a:"vue自定义指令"},"27.35":{t:"keep-alive\r",p:`&lt;KeepAlive&gt; 是一个内置组件，它的功能是在多个组件间动态切换时缓存被移除的组件实例。

通常我们切换组件的时候，上一个组件就会被销毁，而当我们使用&lt;KeepAlive&gt ...`,l:"audition/vue/vue.html#keep-alive",a:"keep-alive"},"27.36":{t:"activated\r",p:`
首次执行执行顺序：created =&gt; mounted =&gt; activated ...
第二次或以后使用组件时触发activated， beforeCreate created bef ...`,l:"audition/vue/vue.html#activated",a:"activated"},"27.37":{t:"deactivated\r",p:`
使用了keep-alive就不会调用beforeDestroy(组件销毁前钩子)和destroyed(组件销毁)，因为组件没被销毁，被缓存起来了。

`,l:"audition/vue/vue.html#deactivated",a:"deactivated"},"27.38":{t:"vue2混入-Mixin\r",p:`混入 (mixin) 提供了一种非常灵活的方式，来分发 Vue 组件中的可复用功能。一个混入对象可以包含任意组件选项。当组件使用混入对象时，所有混入对象的选项将被“混合”进入该组件本身的选项。

Mi ...`,l:"audition/vue/vue.html#vue2混入-mixin",a:"vue2混入-mixin"},"27.39":{t:"`Object.defineProperty`和`proxy`区别\r",p:`
Object.defineProperty 只能代理属性，Proxy 代理的是对象。
对象上新增属性，Proxy可以监听到，Object.defineProperty不能。
Object.defin ...`,l:"audition/vue/vue.html#object-defineproperty-和-proxy-区别",a:"object-defineproperty-和-proxy-区别"},"27.40":{t:"vue3内置组件\r",p:`vue3新增了两个内置组件分别是Teleport和Suspense。
`,l:"audition/vue/vue.html#vue3内置组件",a:"vue3内置组件"},"27.41":{t:"teleport\r",p:`可以称之为传送门，作用将其插槽内容渲染到 DOM 中的另一个位置，接收两个参数to（要去的位置）和disabled（是否留在原位置）。接收比如下面代码
&lt;teleport to=&quot;#p ...`,l:"audition/vue/vue.html#teleport",a:"teleport"},"27.42":{t:"Suspense组件\r",p:`
&lt;Suspense&gt; 组件用于协调对组件树中嵌套的异步依赖的处理。
它一般用于包裹多个异步组件处理多个异步组件加载前与完成后的统一状态
&lt;Suspense&gt; 组件有两个插槽： ...`,l:"audition/vue/vue.html#suspense组件",a:"suspense组件"},"27.43":{t:"nextTick及原理\r",p:"",l:"audition/vue/vue.html#nexttick及原理",a:"nexttick及原理"},"27.44":{t:"vue中的nextTick是干什么用的?\r",p:`在下次 DOM 更新循环结束之后执行延迟回调。在修改数据之后立即使用这个方法，获取更新后的 DOM。
这是什么意思呢,其实vue中修改data不会立刻触发dom更新;而是把需要更新的Watcher加入 ...`,l:"audition/vue/vue.html#vue中的nexttick是干什么用的",a:"vue中的nexttick是干什么用的"},"27.45":{t:"vue虚拟dom,diff算法\r",p:"",l:"audition/vue/vue.html#vue虚拟dom-diff算法",a:"vue虚拟dom-diff算法"},"27.46":{t:"什么是虚拟dom？\r",p:`每当我们用原生JS或者JQ操作DOM时，浏览器会从头开始进行DOM树的构建，频繁的操作DOM开销是很大的。
而虚拟DOM就是为了减少这些操作的，虚拟DOM首先会通过状态生成一个虚拟节点树（js对象）， ...`,l:"audition/vue/vue.html#什么是虚拟dom",a:"什么是虚拟dom"},"27.47":{t:"说一下diff算法（对比两棵vdom 树，找到有差异的部分）\r",p:`在vue中是当状态发生改变，用来计算改变后的虚拟DOM与改变前的虚拟DOM之间的差异的算法。
diff算法的本质是找出两个对象之间的差异，目的是尽可能复用节点，也就是通过移动代替新增。
两棵树的 di ...`,l:"audition/vue/vue.html#说一下diff算法-对比两棵vdom-树-找到有差异的部分",a:"说一下diff算法-对比两棵vdom-树-找到有差异的部分"},"27.48":{t:"vue的diff流程\r",p:`
生成新的虚拟DOM树：在每次数据更新时，Vue.js会重新构建一棵新的虚拟DOM树，表示新的UI结构。
比较新旧虚拟DOM树的根节点：Vue.js会比较新旧虚拟DOM树的根节点，判断它们是否相同类型 ...`,l:"audition/vue/vue.html#vue的diff流程",a:"vue的diff流程"},"27.49":{t:"props使用，透传\r",p:`
props 父传子 在父组件里引用的子组件上使用v-bind或：传给子组件，子组件用const props = defineProps([&quot;isShow&quot;])接收
可透传：在上级 ...`,l:"audition/vue/vue.html#props使用-透传",a:"props使用-透传"},"27.50":{t:"emit\r",p:`
定义一个方法,将参数hide传递给父组件，父组件通过@hide监听并接收参数。
可透传

子组件children.vue
const emit = defineEmit([&quot;hide&qu ...`,l:"audition/vue/vue.html#emit",a:"emit"},"27.51":{t:"Vue.nextTick、this.$nextTick（vue2），nextTick（vue3）\r",p:`
组件的更新是异步执行的，这意味着当您修改组件的数据或状态时，Vue并不会立即对DOM进行更新。相反，Vue会将更新操作推入一个更新队列，并等待下一次DOM更新循环（也称为&quot;事件循环&quo ...`,l:"audition/vue/vue.html#vue-nexttick、this-nexttick-vue2-nexttick-vue3",a:"vue-nexttick、this-nexttick-vue2-nexttick-vue3"},"27.52":{t:"v-for的key\r",p:"为了配合diff算法更加高效，key是为了让diff算法更精准的识别到新旧dom的差异的节点，v-for不写key默认是index，index的效率低，如果在列表中添加一个数据后面的index就要重新 ...",l:"audition/vue/vue.html#v-for的key",a:"v-for的key"},"27.53":{t:"suspense\r",p:"Suspense是一种用于在异步组件加载期间显示占位符内容的特性。有两个插槽#default和#fallback，#default是显示具体内容，#fallback是占位符，当异步组件一些耗时的任务是 ...",l:"audition/vue/vue.html#suspense",a:"suspense"},"27.54":{t:"ref和reactive区别\r",p:`
ref适合基础类型的值将其包装为响应式对象，储存在value中
reactive适合复杂数据类型的对象将其包装成响应式对象，追踪更新对象的多个属性
ref需要用value读取更新值，reactive ...`,l:"audition/vue/vue.html#ref和reactive区别",a:"ref和reactive区别"},"27.55":{t:"slot\r",p:`具名插槽
//父
&lt;template&gt;
  &lt;div&gt;
    &lt;child-component&gt;
      &lt;template v-slot:header ...`,l:"audition/vue/vue.html#slot",a:"slot"},"28.0":{t:"# vue 的响应式\r",p:"\r",l:"audition/vue/vue响应式原理.html",a:"vue-的响应式"},"28.1":{t:"观察者模式和发布订阅模式\r",p:"\r",l:"audition/vue/vue响应式原理.html#观察者模式和发布订阅模式",a:"观察者模式和发布订阅模式"},"28.2":{t:"什么是观察者模式\r",p:"当对象之间存在一对多的依赖关系时，其中一个对象的状态发生改变，所有依赖它的对象都会收到通知，这就是观察者模式。在观察者模式中，只有两种主体：目标对象 (Object) 和 观察者 (Observer) ...",l:"audition/vue/vue响应式原理.html#什么是观察者模式",a:"什么是观察者模式"},"28.3":{t:"什么是发布订阅模式\r",p:"基于一个事件（主题）通道，希望接收通知的对象 Subscriber 通过自定义事件订阅主题，被激活事件的对象 Publisher 通过发布主题事件的方式通知各个订阅该主题的 Subscriber 对象 ...",l:"audition/vue/vue响应式原理.html#什么是发布订阅模式",a:"什么是发布订阅模式"},"28.4":{t:"vue2的响应式原理\r",p:"大意：通过observe里的defineReactive方法里面的Object.defineProperty方法的get（读取数据触发，收集依赖）和set（修改数据触发，派发更新依赖）进行响应式的绑定 ...",l:"audition/vue/vue响应式原理.html#vue2的响应式原理",a:"vue2的响应式原理"},"28.5":{t:"Vue2 响应系统\r",p:`其核心有三点：observe（响应式）、watcher(依赖)、dep（依赖管理）
在 vue2 初始化数据 data 和 computed 数据过程中。会涉及到以下几个对象：

Observe （响 ...`,l:"audition/vue/vue响应式原理.html#vue2-响应系统",a:"vue2-响应系统"},"28.6":{t:"Vue2 observe（响应式）\r",p:"\r",l:"audition/vue/vue响应式原理.html#vue2-observe-响应式",a:"vue2-observe-响应式"},"28.7":{t:"Object.defineProperty 数据劫持、数据代理\r",p:`被Object.defineProperty绑定过的对象，会变成「响应式」化。也就是改变这个对象的时候会触发get和set事件。进而触发一些视图更新。
const obj = {}

let val  ...`,l:"audition/vue/vue响应式原理.html#object-defineproperty-数据劫持、数据代理",a:"object-defineproperty-数据劫持、数据代理"},"28.8":{t:"defineReactive\r",p:`我们需要一个全局的变量来保存这个属性的值
// value使用了参数默认值
function defineReactive(data, key, value = data[key]) {
  cons ...`,l:"audition/vue/vue响应式原理.html#definereactive",a:"definereactive"},"28.9":{t:"observe\r",p:`如果obj有多个属性呢？我们可以新建一个类Observer来遍历该对象，Vue中用Observer类来管理上述响应式化Object.defineProperty的过程。
class Observer  ...`,l:"audition/vue/vue响应式原理.html#observe",a:"observe"},"28.10":{t:"数组是怎么做到响应式的\r",p:"改写了Array.prototype叫arraymothods，以Array.prototype为原型，创建了arraymothods的对象以object.setPrototypeOf强制让vue的数 ...",l:"audition/vue/vue响应式原理.html#数组是怎么做到响应式的",a:"数组是怎么做到响应式的"},"28.11":{t:"Vue2 watcher\r",p:`
dep收集的依赖就是watcher

2. observe中在数据被读的时候，触发getter方法，执行Dep来收集watcher（依赖），此时watcher在dep集合里
3. Dep使用发布订阅 ...`,l:"audition/vue/vue响应式原理.html#vue2-watcher",a:"vue2-watcher"},"28.12":{t:"watcher和数据之间的关系\r",p:`watcher订阅一个或多个数据，数据称为wacther的依赖，数据变化时（setter方法）通知watcher，watcher收到后执行回调，通知组件,通过虚拟dom和diff算法进行页面更新
!w ...`,l:"audition/vue/vue响应式原理.html#watcher和数据之间的关系",a:"watcher和数据之间的关系"},"28.13":{t:"watcher依赖的数据改变方式有\r",p:`
直接渲染render，
有通过computed计算属性改变

常见的场景有下面这几个：

数据变 → 使用数据的视图变
数据变 → 使用数据的计算属性变 → 使用计算属性的视图变
数据变 → 开发者 ...`,l:"audition/vue/vue响应式原理.html#watcher依赖的数据改变方式有",a:"watcher依赖的数据改变方式有"},"28.14":{t:"Vue2 dep\r",p:`使用发布订阅者模式

每个属性拥有自己的消息订阅器 dep，dep类里的this.subs=[],数组里存放所有订阅了该属性的观察者对象watcher,
我们通过defineReactive方法将da ...`,l:"audition/vue/vue响应式原理.html#vue2-dep",a:"vue2-dep"},"28.15":{t:"DEP怎么收集依赖的\r",p:`我们如何知道data中的某个属性被使用了，答案就是Object.defineProperty，因为读取某个属性就会触发get方法。可以将代码进行如下改造：
function defineReactiv ...`,l:"audition/vue/vue响应式原理.html#dep怎么收集依赖的",a:"dep怎么收集依赖的"},"28.16":{t:"vue3 的响应式原理\r",p:`因为 Object.definePorperty 只能对 对象的已知属性 进行操作，所有才会导致 没有在 data 中进行声明的对象属性直接赋值时无法触发视图更新

碍于 Object.defineP ...`,l:"audition/vue/vue响应式原理.html#vue3-的响应式原理",a:"vue3-的响应式原理"},"28.17":{t:"vue3 proxy\r",p:`Vue3 的响应式原理依赖了 Proxy 这个核心 API，通过 Proxy 可以劫持对象的某些操作。
const obj = { a: 1 };
const p = new Proxy(obj, { ...`,l:"audition/vue/vue响应式原理.html#vue3-proxy",a:"vue3-proxy"},"28.18":{t:"vue3的收集依赖\r",p:`get时，收集不同代理对象不同属性所依赖的副作用函数
set时，取出当前属性所依赖的所有副作用函数，重新执行
!内部的执行过程

调用 reactive() 返回一个 Proxy 代理对象，并劫持对象 ...`,l:"audition/vue/vue响应式原理.html#vue3的收集依赖",a:"vue3的收集依赖"},"28.19":{t:"vue3 reactive\r",p:`reactive 会返回如下一个 Proxy 对象
const reactive = (target) =&gt; {
  return new Proxy(target, {
    get(tar ...`,l:"audition/vue/vue响应式原理.html#vue3-reactive",a:"vue3-reactive"},"28.20":{t:"vue3 effect\r",p:"首先定义全局的 activeEffect，它永远指向当前正在执行的 effect 副作用函数。effect 为 fn 创建一个内部的副作用函数，然后立即执行，此时会触发对象的 get 操作，调用 tr ...",l:"audition/vue/vue响应式原理.html#vue3-effect",a:"vue3-effect"},"28.21":{t:"vue3 track\r",p:`track 会建立一个 对象（state） =&gt; 属性（counter） =&gt; effect 的一个依赖关系
const targetMap = new WeakMap();
functi ...`,l:"audition/vue/vue响应式原理.html#vue3-track",a:"vue3-track"},"28.22":{t:"vue3 trigger\r",p:`数据变化的时候就会触发代理对象的 set 操作，从而调用 trigger 方法
function trigger(target, key) {
  const depsMap = targetMap. ...`,l:"audition/vue/vue响应式原理.html#vue3-trigger",a:"vue3-trigger"},"28.23":{t:"副作用函数\r",p:"如果函数依赖于外部的状态，无法保证输出相同，就会带来副作用。Vue 通过一个副作用（effect）函数来跟踪当前正在运行的函数。副作用是一个函数包裹器，在函数被调用前就启动跟踪，而 Vue 在派发更新 ...",l:"audition/vue/vue响应式原理.html#副作用函数",a:"副作用函数"},"28.24":{t:"vue2/3的响应式原理比较\r",p:`
在 Vue 中体现最为明显的一点就是：Proxy 代理对象之后不仅可以拦截对象属性的读取、更新、方法调用之外，对整个对象的新增、删除、枚举等也能直接拦截，而 Object.definePropert ...`,l:"audition/vue/vue响应式原理.html#vue2-3的响应式原理比较",a:"vue2-3的响应式原理比较"},"28.25":{t:"vue3响应式核心方法\r",p:`响应式数据声明的核心API，ref,shallowRef,reactive,shallowReactive,readonly,shallowReadonly

shallow浅层作用形式,整个定义 类 ...`,l:"audition/vue/vue响应式原理.html#vue3响应式核心方法",a:"vue3响应式核心方法"},"28.26":{t:"核心方法注意\r",p:`
ref 虽然常常有文章说一般只用来 声明基础数据的响应式，但是其实所有的数据类型声明响应式时都可以使用ref，只是内部为了同时实现基础数据的响应式处理，封装成了一个具有 value 属性的对象，所以 ...`,l:"audition/vue/vue响应式原理.html#核心方法注意",a:"核心方法注意"},"28.27":{t:"activeEffect和effect\r",p:`
activeEffect自动把effect函数收集起来放进对应的dep里
effect副作用函数，函数收集起来放进dep里

let activeEffect
function effect(fn) ...`,l:"audition/vue/vue响应式原理.html#activeeffect和effect",a:"activeeffect和effect"},"28.28":{t:"track函数\r",p:"track函数用来把effect函数收集起来放进dep里，dep为什么用Set呢？因为Set可以自动去重。搜集起来之后，以后只要变量一改变，就执行trigger函数通知dep里所有依赖money变量的 ...",l:"audition/vue/vue响应式原理.html#track函数",a:"track函数"},"28.29":{t:"trigger\r",p:`function trigger(target,key){
    let depsMap = targetMAP.get(target)
    if(depsMap){
        let d ...`,l:"audition/vue/vue响应式原理.html#trigger",a:"trigger"},"28.30":{t:"Map\r",p:`对象里每一个属性都有一个dep，用Map用来存储dep
`,l:"audition/vue/vue响应式原理.html#map",a:"map"},"28.31":{t:"WeakMap\r",p:`来存储每个对象对应的Map
`,l:"audition/vue/vue响应式原理.html#weakmap",a:"weakmap"},"28.32":{t:"reactive\r",p:`receiver相当于proxy代理的对象，替代原对象target，在receiver上访问和修改
function reactive(target){
    const handler = {
  ...`,l:"audition/vue/vue响应式原理.html#reactive",a:"reactive"},"28.33":{t:"Reflect\r",p:`
get(target, key, receiver)：个人理解就是，访问target的key属性，但是this是指向receiver，所以实际是访问的值是receiver的key的值，但是这可不是直 ...`,l:"audition/vue/vue响应式原理.html#reflect",a:"reflect"},"28.34":{t:"proxy和Reflect\r",p:`
Proxy和Reflect的方法都是一一对应的，在Proxy里使用Reflect会提高语义化
Proxy的get对应Reflect.get
Proxy的set对应Reflect.set

`,l:"audition/vue/vue响应式原理.html#proxy和reflect",a:"proxy和reflect"},"29.0":{t:"# vue自定义指令\r",p:`vue 官方提供了v-text、v-for、v-model、v-if 等常用的指令。除此之外vue 还允许开发者自定义指令。面试经常会问什么是自定义指令?你用自定义指令做过哪些功能?
`,l:"audition/vue/vue自定义指令/vue自定义指令.html",a:"vue自定义指令"},"29.1":{t:"什么是自定义指令?\r",p:`vue 允许开发者自定义指令
`,l:"audition/vue/vue自定义指令/vue自定义指令.html#什么是自定义指令",a:"什么是自定义指令"},"29.2":{t:"自定义组件注册\r",p:"vue中指令的注册和组件的注册一样，提供了全局注册和局部注册两种方式，全局注册就是指我们定义的指令可以在项目中任意地方都可以使用，局部注册则意味着只能在注册的当前组件中使用。接下来我们就来学习这两种注 ...",l:"audition/vue/vue自定义指令/vue自定义指令.html#自定义组件注册",a:"自定义组件注册"},"29.3":{t:"钩子函数\r",p:`
directive的第二个参数是钩子函数对象

const myDirective = {
  // 在绑定元素的 attribute 前 或事件监听器应用前调用
  created(el, bin ...`,l:"audition/vue/vue自定义指令/vue自定义指令.html#钩子函数",a:"钩子函数"},"29.4":{t:"注意\r",p:`
当在组件上使用自定义指令时，它会始终应用于组件的根节点，和透传 attributes 类似。
在vue3中如果组件有多个根结点，则指令将会被忽略且抛出一个警告。
组件的一个根结点就是在一个&lt;d ...`,l:"audition/vue/vue自定义指令/vue自定义指令.html#注意",a:"注意"},"29.5":{t:"指令的使用\r",p:"\r",l:"audition/vue/vue自定义指令/vue自定义指令.html#指令的使用",a:"指令的使用"},"29.6":{t:"在`main.js`中引入指令文件\r",p:`全局挂载
import { createApp } from 'vue'
import App from './App.vue'
import vDebounce from '指令地址.js';
co ...`,l:"audition/vue/vue自定义指令/vue自定义指令.html#在-main-js-中引入指令文件",a:"在-main-js-中引入指令文件"},"29.7":{t:"常用自定义指令",p:"",l:"audition/vue/vue自定义指令/vue自定义指令.html#常用自定义指令",a:"常用自定义指令"},"30.0":{t:"# v-copy\r",p:`const vCopy = {
    beforeMount(el, binding) {
        el.copyContent = binding.value
        el.add ...`,l:"audition/vue/vue自定义指令/常用自定义指令/一键复制.html",a:"v-copy"},"31.0":{t:"# v-debounce\r",p:`

`,l:"audition/vue/vue自定义指令/常用自定义指令/防抖.html",a:"v-debounce"},"33.0":{t:"项目\r",p:`组件库，你认为一个组件都需要具备什么

丰富的组件集合，这包括但不限于按钮、表单输入、模态框、导航栏、表格、图表、轮播图等等
一致的设计语言
灵活的可定制性: 好的组件库应该提供灵活的可定制性选项，允 ...`,l:"audition/面试/b站.html",a:"项目"},"33.1":{t:"npm包管理器，你是怎么管理的\r",p:`
版本控制:
发布日志:
文档维护
持续集成和测试

`,l:"audition/面试/b站.html#npm包管理器-你是怎么管理的",a:"npm包管理器-你是怎么管理的"},"33.2":{t:"git\r",p:`git 回滚

git.rest 完全回退，放弃目标版本之后的提交
git.revert 创建一个新的提交，反做目标版本

`,l:"audition/面试/b站.html#git",a:"git"},"33.3":{t:"vue2和vue3的区别\r",p:`
写法上的区别:vue2使用的是options(选项)Api,vue3的是composition Api(当然vue3也兼容composition api)。options Api中methods，c ...`,l:"audition/面试/b站.html#vue2和vue3的区别",a:"vue2和vue3的区别"},"33.4":{t:"vite 和 wabpack区别\r",p:`
vite是es6模块
webpack是commonjs

`,l:"audition/面试/b站.html#vite-和-wabpack区别",a:"vite-和-wabpack区别"},"33.5":{t:"vite的优势在哪\r",p:`
vite是es6模块，利用了浏览器原生支持的 ES 模块，Webpack 需要使用自己的模块系统和构建过程，对模块进行打包和转换，导致构建速度较慢。
Vite 采用了按需编译的策略，只在需要时编译单 ...`,l:"audition/面试/b站.html#vite的优势在哪",a:"vite的优势在哪"},"33.6":{t:"请求可以取消吗\r",p:"axios的请求可以通过创建了一个 CancelToken.source 实例并将其 token 属性传给Axios 请求的选项中的 cancelToken 字段，我们可以调用 cancel() 方法 ...",l:"audition/面试/b站.html#请求可以取消吗",a:"请求可以取消吗"},"33.7":{t:"代码题\r",p:`
数组转树结构

function ArrayToTree(arr,pid=0){
    if(!Array.isArray(arr) || !arr.length) return
    let  ...`,l:"audition/面试/b站.html#代码题",a:"代码题"},"34.0":{t:"vue的生命周期\r",p:`


Vue2(选项式API)
Vue3(setup)(选项式API)
描述




beforeCreate
-
实例创建前


created
-
实例创建后


beforeMount
onBe ...`,l:"audition/面试/天正.html",a:"vue的生命周期"},"34.1":{t:"vue数据挂载在哪个生命周期\r",p:`看实际情况，一般在created(或者BeforeRouter)里面就可以，如果涉及到需要页面加载完成之后的话用mounted
在created时，视图中的html并没有渲染出来，此时如果直接操作do ...`,l:"audition/面试/天正.html#vue数据挂载在哪个生命周期",a:"vue数据挂载在哪个生命周期"},"34.2":{t:"vue的data为什么要return\r",p:`其实就是一个作用域的问题，在自己的组件中可以访问，别的组件访问不到。
在vue中，data必须是一个函数且返回一个对象，这是因为在vue中每一个组件都是一个单独的实例，如果data是一个对象那么所有的 ...`,l:"audition/面试/天正.html#vue的data为什么要return",a:"vue的data为什么要return"},"34.3":{t:"axios的拦截响应怎么做\r",p:`拦截：
axios.interceptors.response.use(
    function(response){
        //拦截操作
        return response
 ...`,l:"audition/面试/天正.html#axios的拦截响应怎么做",a:"axios的拦截响应怎么做"},"34.4":{t:"组件通讯的方式\r",p:`


方式
Vue2
Vue3




父传子
props
props


子传父
$emit
emits


父传子
$attrs
attrs


子传父
$listeners
无(合并到 attr ...`,l:"audition/面试/天正.html#组件通讯的方式",a:"组件通讯的方式"},"34.5":{t:"vuex的五大部分\r",p:`
State（状态）：State 是应用程序的中央数据存储库，代表了应用程序的整体状态。
Mutation（变更）：Mutation 是修改 State 的唯一途径。
Action（动作）：Actio ...`,l:"audition/面试/天正.html#vuex的五大部分",a:"vuex的五大部分"},"34.6":{t:"pinia\r",p:`
store
State（状态）
Actions（动作）
Getters（获取器）
Mutations没有了，用this获取数据

在 Pinia 中，this.$patch 是一个用于修改状态的特殊 ...`,l:"audition/面试/天正.html#pinia",a:"pinia"},"34.7":{t:"computed和watch区别\r",p:`Watch适用于需要在属性变化时执行异步或开销较大的操作的场景。你可以监视一个或多个属性，并在属性变化时执行特定的操作
Computed属性是基于它们的依赖进行缓存的，只有当依赖发生变化时，才会重新计 ...`,l:"audition/面试/天正.html#computed和watch区别",a:"computed和watch区别"},"34.8":{t:"组件的技术选型你应该怎么考虑\r",p:"\r",l:"audition/面试/天正.html#组件的技术选型你应该怎么考虑",a:"组件的技术选型你应该怎么考虑"},"34.9":{t:"data是个什么格式的\r",p:"\r",l:"audition/面试/天正.html#data是个什么格式的",a:"data是个什么格式的"},"34.10":{t:"你的前端是怎么学的 系统学过吗",p:"",l:"audition/面试/天正.html#你的前端是怎么学的-系统学过吗",a:"你的前端是怎么学的-系统学过吗"},"35.0":{t:"项目都有那些组件\r",p:`组件库还需再加
`,l:"audition/面试/星环.html",a:"项目都有那些组件"},"35.1":{t:"垂直居中\r",p:"\r",l:"audition/面试/星环.html#垂直居中",a:"垂直居中"},"35.2":{t:"选择器\r",p:"\r",l:"audition/面试/星环.html#选择器",a:"选择器"},"35.3":{t:"dom的接口\r",p:"\r",l:"audition/面试/星环.html#dom的接口",a:"dom的接口"},"35.4":{t:"组件通讯方式\r",p:"\r",l:"audition/面试/星环.html#组件通讯方式",a:"组件通讯方式"},"35.5":{t:"vue通信方式",p:"",l:"audition/面试/星环.html#vue通信方式",a:"vue通信方式"},"36.0":{t:"数组去重\r",p:`
使用Set数据结构：

const newarr = [...new Set(arr)]


使用filter()方法和indexOf()方法

const newarr = arr.filter( ...`,l:"audition/面试/萌泰.html",a:"数组去重"},"36.1":{t:"数组有那些属性\r",p:"\r",l:"audition/面试/萌泰.html#数组有那些属性",a:"数组有那些属性"},"36.2":{t:"computed和watch区别\r",p:`
用途不同：watch用于监听数据的变化并执行相应的操作，而computed用于根据数据的变化动态计算衍生出的属性值。
触发时机不同：watch是在数据变化时立即执行相应的操作，而computed是在 ...`,l:"audition/面试/萌泰.html#computed和watch区别",a:"computed和watch区别"},"36.3":{t:"那些地方可以用到watch\r",p:`watch可以在以下几个方面使用：

数据监听：watch最常见的用途是监听数据的变化。当数据发生变化时，可以执行相应的操作，如发送网络请求、更新其他数据、触发其他函数等。这对于需要在数据变化时执行一 ...`,l:"audition/面试/萌泰.html#那些地方可以用到watch",a:"那些地方可以用到watch"},"36.4":{t:"vue3的生命周期\r",p:"\r",l:"audition/面试/萌泰.html#vue3的生命周期",a:"vue3的生命周期"},"36.5":{t:"在哪个生命周期拿数据\r",p:`vue2在created中vue3在onmounted中
`,l:"audition/面试/萌泰.html#在哪个生命周期拿数据",a:"在哪个生命周期拿数据"},"36.6":{t:"css flex布局\r",p:`flex弹性布局，通过在父设置display：flex或inline-flex设置，常用属性flex-direction,justify-content,align-items,flex
`,l:"audition/面试/萌泰.html#css-flex布局",a:"css-flex布局"},"36.7":{t:"flex布局的常用属性\r",p:"\r",l:"audition/面试/萌泰.html#flex布局的常用属性",a:"flex布局的常用属性"},"36.8":{t:"垂直居中的方式\r",p:`三种
`,l:"audition/面试/萌泰.html#垂直居中的方式",a:"垂直居中的方式"},"36.9":{t:"vue的通讯方式\r",p:"\r",l:"audition/面试/萌泰.html#vue的通讯方式",a:"vue的通讯方式"},"36.10":{t:"position的属性\r",p:`
static（默认值）元素按照其在文档流中的顺序进行布局，不进行任何特殊的定位。此时 top、right、bottom、left 和 z-index 属性无效。
relative：元素的定位相对于其 ...`,l:"audition/面试/萌泰.html#position的属性",a:"position的属性"},"36.11":{t:"vue的单向数据流\r",p:"Vue 的单向数据流是指数据在 Vue 组件中的传递是单向的，从父组件向子组件传递。这意味着父组件可以通过 props 将数据传递给子组件，但子组件不能直接修改父组件的数据。任何修改都必须通过向父组件 ...",l:"audition/面试/萌泰.html#vue的单向数据流",a:"vue的单向数据流"},"36.12":{t:"为什么要用异步任务\r",p:`
避免阻塞：代码在执行这些操作期间将无法进行其他任务，导致程序停滞。通过使用异步操作，可以在等待这些操作完成的同时，继续执行其他任务，从而避免阻塞。
提升性能和响应性：在网络请求中，异步操作允许在等待 ...`,l:"audition/面试/萌泰.html#为什么要用异步任务",a:"为什么要用异步任务"},"36.13":{t:"为什么要用promise\r",p:"在JavaScript中，Promise（承诺）是一种用于处理异步操作的对象。它被广泛用于处理网络请求、文件读写、数据库操作等需要等待一段时间才能获取结果的任务。使用Promise可以更好地组织和控制 ...",l:"audition/面试/萌泰.html#为什么要用promise",a:"为什么要用promise"},"36.14":{t:"同步任务异步任务任务队列是一个什么样的关系\r",p:`
同步任务：是按照代码顺序依次执行的任务，会阻塞主线程的执行，直到任务完成
异步任务：是在特定条件下触发并在后台执行的任务，触发和执行是非阻塞的，通常是一些比较耗时的任务，它们的执行通常由底层的操作系 ...`,l:"audition/面试/萌泰.html#同步任务异步任务任务队列是一个什么样的关系",a:"同步任务异步任务任务队列是一个什么样的关系"},"36.15":{t:"事件循环\r",p:`事件循环：负责协调同步任务和异步任务和任务队列之间的关系的机制，不断地从任务队列中取出任务，按照一定顺序执行，一定事件循环周期内，先处理微任务队列中的任务在处理宏任务
`,l:"audition/面试/萌泰.html#事件循环",a:"事件循环"},"36.16":{t:"css选择器排序\r",p:`
内联样式的权重为1000。
ID选择器的权重为100。
类选择器、属性选择器和伪类选择器的权重为10。
元素选择器和伪元素选择器的权重为1。

`,l:"audition/面试/萌泰.html#css选择器排序",a:"css选择器排序"},"37.0":{t:"# 最全前端代码",p:"",l:"code/introductor.html",a:"最全前端代码"},"38.0":{t:"# code\r",p:"",l:"code/js/code.html",a:"code"},"38.1":{t:"防抖\r",p:`有事件触发就清空定时器，开始下一个定时
function debounce(fn, delay) {
    let timmer = null;
    return function () {
  ...`,l:"code/js/code.html#防抖",a:"防抖"},"38.2":{t:"节流\r",p:`在一定时间内执行一次
function throottle(fn,delay){
    let temmer = null;
    return function () {
        let ...`,l:"code/js/code.html#节流",a:"节流"},"38.3":{t:"深拷贝\r",p:"",l:"code/js/code.html#深拷贝",a:"深拷贝"},"38.4":{t:"递归实现深拷贝\r",p:`function deepcopy(obj) {
    if (typeof obj !== 'object' || obj === null) return obj;
    let copy
  ...`,l:"code/js/code.html#递归实现深拷贝",a:"递归实现深拷贝"},"38.5":{t:"JSON实现简单的\r",p:`function deepCopy(obj) {
  return JSON.parse(JSON.stringify(obj));
}


注意：

不能拷贝包含函数、正则表达式、undefined ...`,l:"code/js/code.html#json实现简单的",a:"json实现简单的"},"39.0":{t:"# promise\r",p:`class Mypromise {
    #value
    #reason
    #state = 0
    #rescallbacks = []
    #rejcallbacks = [ ...`,l:"code/promise/promise.html",a:"promise"},"40.0":{t:"# promiseall\r",p:`function promiseAll(promises) {
   return new Promise((resolve, reject) =&gt; {
       let result =  ...`,l:"code/promise/promiseall.html",a:"promiseall"},"40.1":{t:"promise.race\r",p:`function promiseRace(promises) {
  return new Promise((resolve, reject) =&gt; {
    for (let promise ...`,l:"code/promise/promiseall.html#promise-race",a:"promise-race"},"41.0":{t:"# vue3响应式proxy\r",p:`let activeEffect
function effect(fn){
    activeEffect = fn
    activeEffect()
    activeEffect=null ...`,l:"code/vue3响应式/vue3响应式.html",a:"vue3响应式proxy"},"42.0":{t:"# v-copy\r",p:`const vCopy = {
    beforeMount(el, binding) {
        el.copyContent = binding.value
        el.add ...`,l:"code/vue的自定义指令/一键复制.html",a:"v-copy"},"43.0":{t:"# v-debounce\r",p:`

`,l:"code/vue的自定义指令/防抖.html",a:"v-debounce"},"44.0":{t:"# 创建对象\r",p:"\r",l:"code/创建对象/creatobj.html",a:"创建对象"},"44.1":{t:"直接创建\r",p:`let current = {
    name: 'John',
    age: 20
}
console.log(current)

`,l:"code/创建对象/creatobj.html#直接创建",a:"直接创建"},"44.2":{t:"new object()创建\r",p:`let obj = new Object()
obj.name = 'John'
obj.age = 20

console.log(obj)

`,l:"code/创建对象/creatobj.html#new-object-创建",a:"new-object-创建"},"44.3":{t:"工厂方法1\r",p:`function createPerson(name, age) {
    // let o = new Object()
    return {
        name,
        ag ...`,l:"code/创建对象/creatobj.html#工厂方法1",a:"工厂方法1"},"44.4":{t:"工厂方法2\r",p:`function createPerson2(name, age) {
    let o = new Object()
    o.name = name
    o.age = age
    r ...`,l:"code/创建对象/creatobj.html#工厂方法2",a:"工厂方法2"},"44.5":{t:"构造函数\r",p:`function Person(name, age) {
    this.name = name
    this.age = age
}

let john3 = new Person('John ...`,l:"code/创建对象/creatobj.html#构造函数",a:"构造函数"},"44.6":{t:"原型（待定）\r",p:`function Person2() {
    
}
Person2.prototype.name = &quot;John&quot;
Person2.prototype.age = 28

le ...`,l:"code/创建对象/creatobj.html#原型-待定",a:"原型-待定"},"45.0":{t:"# 排序算法\r",p:"\r",l:"code/排序/排序.html",a:"排序算法"},"45.1":{t:"冒泡\r",p:`不多说闭着眼也写得出来
function bubblesort(arr) {
    for (var i = 0; i &lt; arr.length; i++) {
        for (va ...`,l:"code/排序/排序.html#冒泡",a:"冒泡"},"45.2":{t:"选择排序\r",p:`从i = 0开始从后面挑一个比a[i]小的且是最小的数与a[i]交换位置
function selectsort(arr) {
    for (var i = 0; i &lt; arr.lengt ...`,l:"code/排序/排序.html#选择排序",a:"选择排序"},"45.3":{t:"插入排序\r",p:`默认第一个元素被排好序，从第二个元素开始依次与之前的元素比较，指到比较到如果大于当前的的元素则退出循环，插入到当前的的元素的下一位
function insertsort(arr){
    for( ...`,l:"code/排序/排序.html#插入排序",a:"插入排序"},"45.4":{t:"希尔排序\r",p:"取一个增量gap，然后将所有距离为gap的元素分在同一组，并对每一组的元素进行直接插入排序。然后再取一个比第一增量小的整数作为第二增量，重复上述操作…,当增量的大小减到1时，就相当于整个序列被分到一组 ...",l:"code/排序/排序.html#希尔排序",a:"希尔排序"},"45.5":{t:"快速排序\r",p:`找到一个主元pivot的key和value，一般是中间的，让数组形成左边是小于key右边是大于key，然后左边的和右边的递归继续排序
function quicksort (arr){
    let ...`,l:"code/排序/排序.html#快速排序",a:"快速排序"},"46.0":{t:"# 哈希表\r",p:"\r",l:"code/数据结构/哈希/hash.html",a:"哈希表"},"46.1":{t:"哈希函数\r",p:`function hashFunc(str, size) {
    let hash = 0
    for (let i = 0; i &lt; str.length; i++) {
       ...`,l:"code/数据结构/哈希/hash.html#哈希函数",a:"哈希函数"},"46.2":{t:"put\r",p:`hashTable.prototype.put = function (key, value) {
    let index = hashFunc(key, this.limit)
    let  ...`,l:"code/数据结构/哈希/hash.html#put",a:"put"},"46.3":{t:"get\r",p:`hashTable.prototype.get = function (key) {
    let index = hashFunc(key, this.limit)
    let bucket  ...`,l:"code/数据结构/哈希/hash.html#get",a:"get"},"46.4":{t:"remove\r",p:`hashTable.prototype.remove = function (key) {
    let index = hashFunc(key, this.limit)
    let buck ...`,l:"code/数据结构/哈希/hash.html#remove",a:"remove"},"46.5":{t:"判断质数\r",p:`//判断质数
hashTable.prototype.isPrime= function(num) {
    let temp = parseInt(Math.sqrt(num));
    for ...`,l:"code/数据结构/哈希/hash.html#判断质数",a:"判断质数"},"46.6":{t:"得到质数\r",p:`hashTable.prototype.getPrime= function(num) {
    while(!this.isPrime(num)){
        num++
    }
    ...`,l:"code/数据结构/哈希/hash.html#得到质数",a:"得到质数"},"46.7":{t:"其他\r",p:`hashTable.prototype.isEmpty = function () {
    return this.count == 0
}

hashTable.prototype.size = ...`,l:"code/数据结构/哈希/hash.html#其他",a:"其他"},"47.0":{t:"# 栈\r",p:`普通构造函数封装
function Stack() {
    this.arr = [];

}

Stack.prototype.push = function(element) {
    th ...`,l:"code/数据结构/栈/栈.html",a:"栈"},"47.1":{t:"例子\r",p:`十进制转二进制
function dec2bin (number){
    const stack = new Stack()
    while (number &gt; 0) {
        ...`,l:"code/数据结构/栈/栈.html#例子",a:"例子"},"48.0":{t:"# 二叉搜索树\r",p:"",l:"code/数据结构/树/二叉搜索树.html",a:"二叉搜索树"},"48.1":{t:"什么是二叉搜索树?\r",p:`

二叉搜索树（BST，Binary Search Tree），也称二叉排序树或二叉查找树


二叉搜索树是一颗二叉树, 可以为空；如果不为空，满足以下性质：

非空左子树的所有键值小于其根结点的键值 ...`,l:"code/数据结构/树/二叉搜索树.html#什么是二叉搜索树",a:"什么是二叉搜索树"},"48.2":{t:"二叉搜索树的特点:\r",p:`
二叉搜索树的特点就是相对较小的值总是保存在左结点上, 相对较大的值总是保存在右结点上.
那么利用这个特点, 我们可以做什么事情呢?
查找效率非常高, 这也是二叉搜索树中, 搜索的来源.

`,l:"code/数据结构/树/二叉搜索树.html#二叉搜索树的特点",a:"二叉搜索树的特点"},"48.3":{t:"二叉搜索树常见的操作\r",p:`
insert(key)：向树中插入一个新的键。
search(key)：在树中查找一个键，如果结点存在，则返回true；如果不存在，则返回false。
inOrderTraverse：通过中序遍历方 ...`,l:"code/数据结构/树/二叉搜索树.html#二叉搜索树常见的操作",a:"二叉搜索树常见的操作"},"48.4":{t:"创建二叉搜索树\r",p:`
封装binarySerachTree的构造函数.
还需要封装一个用于保存每一个结点的类Node

该类包含三个属性: 结点对应的key, 指向的左子树, 指向的右子树


对于binarySerac ...`,l:"code/数据结构/树/二叉搜索树.html#创建二叉搜索树",a:"创建二叉搜索树"},"48.5":{t:"insert(key)\r",p:`插入叶子结点
    binarySerachTree.prototype.insert = function (key) {
        let newNode = new Node(key); ...`,l:"code/数据结构/树/二叉搜索树.html#insert-key",a:"insert-key"},"48.6":{t:"遍历二叉搜索树\r",p:`遍历二叉搜索树
`,l:"code/数据结构/树/二叉搜索树.html#遍历二叉搜索树",a:"遍历二叉搜索树"},"48.7":{t:"先序遍历\r",p:`先序遍历,从根节点开始
    binarySerachTree.prototype.preOrderTraversal = function (handler) {
        return t ...`,l:"code/数据结构/树/二叉搜索树.html#先序遍历",a:"先序遍历"},"48.8":{t:"中序遍历\r",p:`中序遍历，从左子树开始，根节点在中间
    binarySerachTree.prototype.inOrderTraversal = function (handler) {
        re ...`,l:"code/数据结构/树/二叉搜索树.html#中序遍历",a:"中序遍历"},"48.9":{t:"后序遍历\r",p:`根节点在最后
    binarySerachTree.prototype.postOrderTraversal = function (handler) {
        return this. ...`,l:"code/数据结构/树/二叉搜索树.html#后序遍历",a:"后序遍历"},"48.10":{t:"最大最小值\r",p:`    binarySerachTree.prototype.min = function () {
        let node = this.root
        while (node. ...`,l:"code/数据结构/树/二叉搜索树.html#最大最小值",a:"最大最小值"},"48.11":{t:"查找特定值 search(key)\r",p:`
查找特定值-递归法

    binarySerachTree.prototype.search = function (key) {
        return this.searchNode( ...`,l:"code/数据结构/树/二叉搜索树.html#查找特定值-search-key",a:"查找特定值-search-key"},"48.12":{t:"二叉搜索树的删除\r",p:`删除节点要从查找要删的节点开始, 找到节点后, 需要考虑三种情况:

该节点是也结点(没有子节点, 比较简单)
该节点有一个子节点(也相对简单)
该节点有两个子节点.(情况比较复杂)

查找删除的节点 ...`,l:"code/数据结构/树/二叉搜索树.html#二叉搜索树的删除",a:"二叉搜索树的删除"},"48.13":{t:"情况一: 没有子节点\r",p:`
这种情况相对比较简单, 我们需要检测current的left以及right是否都为null.
都为null之后还要检测一个东西, 就是是否current就是根, 都为null, 并且为跟根, 那么相 ...`,l:"code/数据结构/树/二叉搜索树.html#情况一-没有子节点",a:"情况一-没有子节点"},"48.14":{t:"情况二: 一个子节点\r",p:`::: warning caution
tip warning danger
:::
这种情况也不是很难.

要删除的current结点, 只有2个连接(如果有两个子结点, 就是三个连接了), 一个连 ...`,l:"code/数据结构/树/二叉搜索树.html#情况二-一个子节点",a:"情况二-一个子节点"},"48.15":{t:"情况三: 两个子节点\r",p:`&lt;!-- 又分三种情况 --&gt;

如果我们要删除的节点有两个子节点, 甚至子节点还有子节点, 这种情况下我们需要从下面的子节点中找到一个节点, 来替换当前的节点.


但是找到的这个节点有 ...`,l:"code/数据结构/树/二叉搜索树.html#情况三-两个子节点",a:"情况三-两个子节点"},"48.16":{t:"删除节点完整代码\r",p:`//删除
binarySerachTree.prototype.remove = function (key) {
    let current = this.root
    let parent ...`,l:"code/数据结构/树/二叉搜索树.html#删除节点完整代码",a:"删除节点完整代码"},"49.0":{t:"# 链表\r",p:"\r",l:"code/数据结构/链表/链表.html",a:"链表"},"49.1":{t:"js普通构造函数\r",p:`function linkedList() {
    function node(data) {
        this.data = data;
        this.next = null ...`,l:"code/数据结构/链表/链表.html#js普通构造函数",a:"js普通构造函数"},"49.2":{t:"增 append\r",p:`    linkedList.prototype.append = function (data) {
        var newNode = new node(data);
        // ...`,l:"code/数据结构/链表/链表.html#增-append",a:"增-append"},"49.3":{t:"tostring\r",p:`    linkedList.prototype.tostring = function () {
        var str = &quot;&quot;;
        var curren ...`,l:"code/数据结构/链表/链表.html#tostring",a:"tostring"},"49.4":{t:"insert\r",p:`    linkedList.prototype.insert = function (position, data) {
        var newNode = new node(data)
  ...`,l:"code/数据结构/链表/链表.html#insert",a:"insert"},"49.5":{t:"get\r",p:`    linkedList.prototype.get = function (position) {
        if (position &lt; 0 || position &gt;= t ...`,l:"code/数据结构/链表/链表.html#get",a:"get"},"49.6":{t:"indexOf\r",p:`    linkedList.prototype.indexOf = function (data) {
        let current = this.head
        let ind ...`,l:"code/数据结构/链表/链表.html#indexof",a:"indexof"},"49.7":{t:"update\r",p:`    linkedList.prototype.update = function (position, data) {
        if (position &lt; 0 || positio ...`,l:"code/数据结构/链表/链表.html#update",a:"update"},"49.8":{t:"remove\r",p:`    linkedList.prototype.remove = function (position) {
        if (position &lt; 0 || position &gt; ...`,l:"code/数据结构/链表/链表.html#remove",a:"remove"},"49.9":{t:"removedata\r",p:`    linkedList.prototype.removedata = function (data) {
        let current = this.head
        let  ...`,l:"code/数据结构/链表/链表.html#removedata",a:"removedata"},"49.10":{t:"isEmpty、size、clear\r",p:`    linkedList.prototype.isEmpty = function () {
        return this.length === 0
    }

    linkedL ...`,l:"code/数据结构/链表/链表.html#isempty、size、clear",a:"isempty、size、clear"},"49.11":{t:"js普通构造函数版本code\r",p:`:::details 完整代码
function linkedList() {
    function node(data) {
        this.data = data;
         ...`,l:"code/数据结构/链表/链表.html#js普通构造函数版本code",a:"js普通构造函数版本code"},"49.12":{t:"class语法糖版本code\r",p:`:::details 全部代码
class linkedList {
    // function node(data) {
    //     this.data = data;
    //  ...`,l:"code/数据结构/链表/链表.html#class语法糖版本code",a:"class语法糖版本code"},"50.0":{t:"# 优先级队列\r",p:"\r",l:"code/数据结构/队列/优先级队列.html",a:"优先级队列"},"50.1":{t:"普通构造函数封装\r",p:`
function Queue() {
    this.arr = [];

    
    Queue.prototype.dequeue = function () {
        ret ...`,l:"code/数据结构/队列/优先级队列.html#普通构造函数封装",a:"普通构造函数封装"},"50.2":{t:"class语法糖封装\r",p:`class Queue {
    constructor() {
        this.arr = [];
    }
    enqueue(value) {
        this.arr ...`,l:"code/数据结构/队列/优先级队列.html#class语法糖封装",a:"class语法糖封装"},"51.0":{t:"# 队列\r",p:"\r",l:"code/数据结构/队列/队列.html",a:"队列"},"51.1":{t:"普通构造函数封装\r",p:`function Queue() {
    this.arr = [];
    Queue.prototype.enqueue = function (element) {
        thi ...`,l:"code/数据结构/队列/队列.html#普通构造函数封装",a:"普通构造函数封装"},"51.2":{t:"例子\r",p:`function myQueue(numlist, num) {
    const queue = new Queue();
    for (let i = 0; i &lt; numlist.l ...`,l:"code/数据结构/队列/队列.html#例子",a:"例子"},"52.0":{t:"# 数组\r",p:`\r
\r`,l:"code/数组/array.html",a:"数组"},"52.1":{t:"Array.prototype.every() \r",p:`判断是否符合条件，有一个不符合就不行,返回true或false
let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
let result6 = arr.every((i ...`,l:"code/数组/array.html#array-prototype-every",a:"array-prototype-every"},"52.2":{t:"Array.prototype.some() \r",p:`判断是否符合条件，有一个符合就行,返回true或false
let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
let result7 = arr.some((item ...`,l:"code/数组/array.html#array-prototype-some",a:"array-prototype-some"},"52.3":{t:"Array.prototype.find()\r",p:`找到符合条件的第一个数,不改变原数组
let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
let result8 = arr.find((item, index) =& ...`,l:"code/数组/array.html#array-prototype-find",a:"array-prototype-find"},"52.4":{t:"Array.prototype.findLast()\r",p:`反方向查找，找到符合条件的第一个数,不改变原数组
let result99 = arr.findLast((item, index) =&gt; {
    return item &gt; 5
}) ...`,l:"code/数组/array.html#array-prototype-findlast",a:"array-prototype-findlast"},"52.5":{t:"Array.prototype.findIndex()\r",p:`找到符合条件的第一个数的索引,里面为回调函数,不改变原数组
let result9 = arr.findIndex((item, index) =&gt; {
    return item &gt; ...`,l:"code/数组/array.html#array-prototype-findindex",a:"array-prototype-findindex"},"52.6":{t:"Array.prototype.indexOf()\r",p:`返回某个元素的第一个索引，里面是一个值,不改变原数组
let result11 = arr.indexOf(6)
console.log('result11:', result11) //result ...`,l:"code/数组/array.html#array-prototype-indexof",a:"array-prototype-indexof"},"52.7":{t:"Array.prototype.lastIndexOf()\r",p:`方法返回指定元素在数组中的最后一个的索引
let result12 = arr.lastIndexOf(10)
console.log('result12:', result12) //result1 ...`,l:"code/数组/array.html#array-prototype-lastindexof",a:"array-prototype-lastindexof"},"52.8":{t:"Array.prototype.includes()\r",p:`判断是否包含某个元素,返回true或false
let result10 = arr.includes(10)

console.log('result10:', result10)

`,l:"code/数组/array.html#array-prototype-includes",a:"array-prototype-includes"},"52.9":{t:"Array.prototype.map()\r",p:`将数组中的每个元素映射到另一个数组中，不改变原数组,产生一个新的数组
let result14 = arr.map((item, index) =&gt; {
    return item * 2
 ...`,l:"code/数组/array.html#array-prototype-map",a:"array-prototype-map"},"52.10":{t:"Array.prototype.forEach()\r",p:`方法对数组的每个元素执行一次给定的函数，不产生数组，对原数组也没影响。
let arr8 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
let result27 = arr8.f ...`,l:"code/数组/array.html#array-prototype-foreach",a:"array-prototype-foreach"},"52.11":{t:"Array.prototype.flat()\r",p:`flat() 方法创建一个新的数组，并根据指定深度递归地将所有子数组元素拼接到新的数组中。
let arr = [1, [2, 3],[ 4, [5, [6, 7], 8], 9], 10]
let  ...`,l:"code/数组/array.html#array-prototype-flat",a:"array-prototype-flat"},"52.12":{t:"Array.prototype.flatMap()\r",p:`
flatMap() 方法对数组中的每个元素应用给定的回调函数，然后将结果展开一级，返回一个新数组。* 它等价于在调用 map() 方法后再调用深度为 1 的 flat() 方法（arr.map(.. ...`,l:"code/数组/array.html#array-prototype-flatmap",a:"array-prototype-flatmap"},"52.13":{t:"Array.prototype.fill ()\r",p:`用一个固定值填充一个数组中从起始索引（默认为 0）到终止索引（默认为 array.length）内的全部元素。它返回修改后的数组，改变原数组
//填充一个数到最后
let result15 = arr ...`,l:"code/数组/array.html#array-prototype-fill",a:"array-prototype-fill"},"52.14":{t:"Array.prototype.filter ()\r",p:`返回一个过滤后的新数组,不改变原数组
let result13 = arr.filter((item, index) =&gt; {
    return item &gt; 5
})

consol ...`,l:"code/数组/array.html#array-prototype-filter",a:"array-prototype-filter"},"52.15":{t:"Array.from()\r",p:`静态方法从可迭代或类数组对象创建一个新的浅拷贝的数组实例。
let arrfrom = 'foobar'
let result16 = Array.from(arrfrom)

console.log ...`,l:"code/数组/array.html#array-from",a:"array-from"},"52.16":{t:"Array.of() \r",p:`方法通过可变数量的参数创建一个新的 Array 实例，而不考虑参数的数量或类型。
Array.of() 和 Array() 构造函数之间的区别在于对单个参数的处理：Array.of(7) 创建一个具有 ...`,l:"code/数组/array.html#array-of",a:"array-of"},"52.17":{t:"Array.prototype.join() \r",p:`方法用于将数组中的元素连接成字符串。
let result18 = arr.join(',')

console.log('result18:', result18) //result18: '1,2 ...`,l:"code/数组/array.html#array-prototype-join",a:"array-prototype-join"},"52.18":{t:"Array.prototype.pop() \r",p:`方法用于删除数组中的最后一个元素,返回删除后的元素,改变原数组
let arr4 = [1, 2, 3, 4, 5, 6, 7, 8]
let result19 = arr4.pop()

conso ...`,l:"code/数组/array.html#array-prototype-pop",a:"array-prototype-pop"},"52.19":{t:"Array.prototype.push() \r",p:`方法用于添加一个或多个元素到数组的末尾。并返回该数组的新长度,改变原数组
let arr5 = [1, 2, 3, 4, 5, 6, 7, 8]
let result20 = arr5.push(9) ...`,l:"code/数组/array.html#array-prototype-push",a:"array-prototype-push"},"52.20":{t:"Array.prototype.shift()\r",p:`
方法从数组中删除第一个元素，并返回该元素的值。改变原数组
Array.prototype.pop() 有着和 shift相似的行为，但是是作用在数组的最后一个元素上的。

let arr11 = [ ...`,l:"code/数组/array.html#array-prototype-shift",a:"array-prototype-shift"},"52.21":{t:"Array.prototype.unshift()\r",p:`方法将一个或多个元素添加到数组的开头，并返回该数组的新长度,改变原数组。
let arr15 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
let result34 = arr1 ...`,l:"code/数组/array.html#array-prototype-unshift",a:"array-prototype-unshift"},"52.22":{t:"Array.prototype.keys()\r",p:`keys() 方法返回一个包含数组中每个索引键的 Array Iterator 对象。
let result21 = arr5.keys()

console.log('result21:', res ...`,l:"code/数组/array.html#array-prototype-keys",a:"array-prototype-keys"},"52.23":{t:"Array.prototype.values()\r",p:`values() 方法返回一个新的 Array Iterator 对象，该对象包含数组每个索引的值。
let result23 = arr5.values()

console.log('result ...`,l:"code/数组/array.html#array-prototype-values",a:"array-prototype-values"},"52.24":{t:"Array.prototype.entries()\r",p:`返回一个新的数组迭代器对象,类似generater函数
let arr6 = [&quot;a&quot;, &quot;b&quot;, &quot;c&quot;, &quot;d&quot;,  ...`,l:"code/数组/array.html#array-prototype-entries",a:"array-prototype-entries"},"52.25":{t:"Array.prototype.reduce()\r",p:`累加
`,l:"code/数组/array.html#array-prototype-reduce",a:"array-prototype-reduce"},"52.26":{t:"Array.prototype.reduceRight()\r",p:`reduceRight() 方法接受一个函数作为累加器（accumulator）和数组的每个值（从右到左）将其减少为单个值。
let arr9 = [[1, 2],[ 3, 4], [5, 6], [ ...`,l:"code/数组/array.html#array-prototype-reduceright",a:"array-prototype-reduceright"},"52.27":{t:"Array.prototype.reverse()\r",p:`方法将数组中元素的位置颠倒，并返回该数组。数组的第一个元素会变成最后一个，数组的最后一个元素变成第一个。该方法会改变原数组。
let arr10 = [1, 2, 3, 4, 5, 6, 7, 8,  ...`,l:"code/数组/array.html#array-prototype-reverse",a:"array-prototype-reverse"},"52.28":{t:"Array.prototype.slice()\r",p:`slice() 方法返回一个新的数组对象，这一对象是一个由 begin 和 end 决定的原数组的浅拷贝（包括 begin，不包括end）。原始数组不会被改变。
let arr12 = [1, 2,  ...`,l:"code/数组/array.html#array-prototype-slice",a:"array-prototype-slice"},"52.29":{t:"Array.prototype.sort()\r",p:`sort() 方法用原地算法对数组的元素进行排序，并返回数组。默认排序顺序是在将元素转换为字符串，然后比较它们的 UTF-16 代码单元值序列时构建的
let arr13 = [1, 2, 3, 4, ...`,l:"code/数组/array.html#array-prototype-sort",a:"array-prototype-sort"},"52.30":{t:"Array.prototype.splice()\r",p:`splice() 方法通过删除或替换现有元素或者原地添加新的元素来修改数组，并以数组形式返回被修改的内容。此方法会改变原数组。
let arr14 = [1, 2, 3, 4, 5, 6, 7, 8, ...`,l:"code/数组/array.html#array-prototype-splice",a:"array-prototype-splice"},"52.31":{t:"Array.prototype.toLocaleString()\r",p:`返回一个字符串表示数组中的元素。数组中的元素将使用各自的 toLocaleString 方法转成字符串，这些字符串将使用一个特定语言环境的字符串（例如一个逗号 &quot;,&quot;）隔开。
le ...`,l:"code/数组/array.html#array-prototype-tolocalestring",a:"array-prototype-tolocalestring"},"52.32":{t:"Array.prototype.toString()\r",p:`方法返回一个字符串，表示指定的数组及其元素。
let arr17 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
let result36 = arr17.toString()

 ...`,l:"code/数组/array.html#array-prototype-tostring",a:"array-prototype-tostring"},"53.0":{t:"# 数组扁平化\r",p:`let arr3 = [1, 2, [3, 4, 5, 6, [7, 8, [9]]]]

`,l:"code/数组/array2one.html",a:"数组扁平化"},"53.1":{t:"1. flat\r",p:`let result16 = arr3.flat(Infinity)
console.log('result16:', result16)

`,l:"code/数组/array2one.html#_1-flat",a:"_1-flat"},"53.2":{t:"2. tostring\r",p:`function flatten(arr) {
    return arr.toString().split(',').map((item, index) =&gt; parseFloat(item ...`,l:"code/数组/array2one.html#_2-tostring",a:"_2-tostring"},"53.3":{t:"3. 递归\r",p:"",l:"code/数组/array2one.html#_3-递归",a:"_3-递归"},"53.4":{t:"一层\r",p:`let arr = [1, 2, 3, [6, 5, 4]]
let result = []
for (let i = 0; i &lt; arr.length; i++) {
    result  ...`,l:"code/数组/array2one.html#一层",a:"一层"},"53.5":{t:"多层\r",p:`function flatten2(arr) {
    let result = []
    for (let i = 0; i &lt; arr.length; i++) {
        i ...`,l:"code/数组/array2one.html#多层",a:"多层"},"53.6":{t:"forEach递归\r",p:`const eachFlatten = (arr = [], deep = 1) =&gt; {
    const result = [];
        (function flat(arr,d ...`,l:"code/数组/array2one.html#foreach递归",a:"foreach递归"},"53.7":{t:"reduce递归\r",p:`const reduceflat = (arr = [], deep = 1) =&gt; {
    if(deep&lt;=0) return arr;
    return arr.reduce ...`,l:"code/数组/array2one.html#reduce递归",a:"reduce递归"},"54.0":{t:"# reduce function\r",p:`let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

`,l:"code/数组/reduce.html",a:"reduce-function"},"54.1":{t:"累加\r",p:`let result1 = arr.reduce((pre,cur)=&gt;{
    return pre + cur
},0)
console.log('result:', result1)

`,l:"code/数组/reduce.html#累加",a:"累加"},"54.2":{t:"最大值\r",p:`let result2 = arr.reduce((pre,cur)=&gt;{
    return Math.max(pre,cur)})

console.log('result2:', res ...`,l:"code/数组/reduce.html#最大值",a:"最大值"},"54.3":{t:"数组去重\r",p:`let result3 = arr.reduce((pre,cur)=&gt;{
    if(pre.indexOf(cur) == -1){
        pre.push(cur)
    } ...`,l:"code/数组/reduce.html#数组去重",a:"数组去重"},"54.4":{t:"分类\r",p:`const arr2 = [1,1,2,3,3,5,6,6]

let result4 = arr2.reduce((pre,cur)=&gt;{
    if(pre[cur]){
         ...`,l:"code/数组/reduce.html#分类",a:"分类"},"54.5":{t:"翻转字符串\r",p:"let str = 'result,wolder'\nlet result5 = Array.from(str).reduce((pre,cur)=&gt;{ \n    return `${cur}${ ...",l:"code/数组/reduce.html#翻转字符串",a:"翻转字符串"},"55.0":{t:"# 流光按钮\r",p:"\r",l:"components/button/flowingbutton.html",a:"流光按钮"},"55.1":{t:"展示效果\r",p:`&lt;Flowing-button&gt;流光按钮&lt;/Flowing-button&gt;
`,l:"components/button/flowingbutton.html#展示效果",a:"展示效果"},"55.2":{t:"全局挂载\r",p:`import { createApp } from 'vue'
import App from './App.vue'
import  LJT  from 'ljt-btn'
const app =  ...`,l:"components/button/flowingbutton.html#全局挂载",a:"全局挂载"},"55.3":{t:"局部挂载\r",p:`import {Button} from 'ljt-btn'

在组件内挂载之后只需要引用下面这行代码，你就可以看到流光按钮啦！
&lt;Button&gt;流光按钮&lt;/Button&gt;

`,l:"components/button/flowingbutton.html#局部挂载",a:"局部挂载"},"55.4":{t:"禁用\r",p:`使用disabled给按钮添加禁用功能
&lt;Flowing-button disabled=&quot;true&quot;&gt;流光按钮&lt;/Flowing-button&gt;
&lt; ...`,l:"components/button/flowingbutton.html#禁用",a:"禁用"},"56.0":{t:"Button 按钮\r",p:"\r",l:"components/button/normal.html",a:"button-按钮"},"56.1":{t:"效果展示\r",p:`普通按钮
&lt;L-button &gt;默认&lt;/L-button&gt;
&lt;L-button type=&quot;primary&quot;&gt;primary&lt;/L-but ...`,l:"components/button/normal.html#效果展示",a:"效果展示"},"56.2":{t:"全局挂载\r",p:`import { createApp } from 'vue'
import App from './App.vue'
import  LJT  from 'ljt-btn'
const app =  ...`,l:"components/button/normal.html#全局挂载",a:"全局挂载"},"56.3":{t:"局部挂载\r",p:`import {LButton} from 'ljt-btn'

在组件内挂载之后只需要引用下面这行代码，你就可以看到按钮啦！
&lt;L-button type=&quot;success&quot ...`,l:"components/button/normal.html#局部挂载",a:"局部挂载"},"56.4":{t:"类型\r",p:`可以选择想要的类型，例如：
type = 'primary'|'success'
//事例
&lt;L-button type=&quot;primary&quot;&gt;primary&lt;/L ...`,l:"components/button/normal.html#类型",a:"类型"},"56.5":{t:"朴素按钮\r",p:`给按钮添加plain变为朴素按钮,例如：
&lt;L-button type=&quot;primary&quot; plain&gt;primary&lt;/L-button&gt;
&lt;L-b ...`,l:"components/button/normal.html#朴素按钮",a:"朴素按钮"},"56.6":{t:"圆角\r",p:`给按钮添加round变为圆角按钮,例如：
&lt;L-button type=&quot;primary&quot; round&gt;primary&lt;/L-button&gt;
&lt;L-b ...`,l:"components/button/normal.html#圆角",a:"圆角"},"56.7":{t:"禁用\r",p:`给按钮添加disabled变为不可选中状态,例如：
&lt;L-button type=&quot;primary&quot; disabled&gt;primary&lt;/L-button&gt; ...`,l:"components/button/normal.html#禁用",a:"禁用"},"56.8":{t:"给按钮添加icon\r",p:"给按钮添加icon=&quot;name&quot;属性,选择自己喜欢的name就可以在按钮上添加icon,如果icon想放在右侧只需要添加icon-position=&quot;right&quot ...",l:"components/button/normal.html#给按钮添加icon",a:"给按钮添加icon"},"57.0":{t:"# 输入框\r",p:"\r",l:"components/from/input.html",a:"输入框"},"57.1":{t:"普通输入框\r",p:`&lt;Linput  placeholder=&quot;请输入内容&quot;&gt;&lt;/Linput&gt;
&lt;Linput  placeholder=&quot;请输入内容&quo ...`,l:"components/from/input.html#普通输入框",a:"普通输入框"},"57.2":{t:"禁用\r",p:`disabled
&lt;Linput disabled placeholder=&quot;请输入内容&quot;&gt;&lt;/Linput&gt;
&lt;Linput disabled pl ...`,l:"components/from/input.html#禁用",a:"禁用"},"57.3":{t:"尺寸\r",p:`medium,small,mini,不传则默认
medium
&lt;Linput size=&quot;medium&quot; placeholder=&quot;请输入内容&quot;&gt;& ...`,l:"components/from/input.html#尺寸",a:"尺寸"},"57.4":{t:"一键清空\r",p:`当输入框有值时可一键清空
&lt;Linput size=&quot;medium&quot;  v-model=&quot;tel&quot; clearable placeholder=&quot ...`,l:"components/from/input.html#一键清空",a:"一键清空"},"57.5":{t:"密码框\r",p:"&lt;!-- &lt;Linput size=&quot;medium&quot; v-model=&quot;tel&quot; type=&quot;password&quot; showPas ...",l:"components/from/input.html#密码框",a:"密码框"},"57.6":{t:"带icon输入框\r",p:"&lt;Linput size=&quot;medium&quot; v-model=&quot;tel&quot; clearable prefixIcon=&quot;bianji&quot; p ...",l:"components/from/input.html#带icon输入框",a:"带icon输入框"},"57.7":{t:"复合输入框\r",p:`&lt;div class=&quot;upfile&quot;&gt;
&lt;Linput v-model=&quot;tel&quot; placeholder=&quot;请输入内容&quot ...`,l:"components/from/input.html#复合输入框",a:"复合输入框"},"57.8":{t:"自适应高度文本域\r",p:`设置autosize=&quot;{ minRows: 2, maxRows: 5 }最小行数为2，最大行数为5
&lt;Linput type=&quot;textarea&quot; :autos ...`,l:"components/from/input.html#自适应高度文本域",a:"自适应高度文本域"},"58.0":{t:"安装\r",p:`npm install ljt-btn

`,l:"components/guild/installation.html",a:"安装"},"59.0":{t:"# icon\r",p:"\r",l:"components/icon/icon.html",a:"icon"},"59.1":{t:"效果展示\r",p:`&lt;Licon name=&quot;apple-line&quot; color=&quot;red&quot;&gt;&lt;/Licon&gt;
&lt;Licon name=&quot;a ...`,l:"components/icon/icon.html#效果展示",a:"效果展示"},"59.2":{t:"全局挂载\r",p:`import { createApp } from 'vue'
import App from './App.vue'
import  LJT  from 'ljt-btn'
const app =  ...`,l:"components/icon/icon.html#全局挂载",a:"全局挂载"},"59.3":{t:"局部挂载\r",p:`import {Licon} from 'ljt-btn'

在组件内挂载之后只需要引用下面这行代码，选择你想要的图标name，你就可以看到图标啦！
&lt;Licon name=&quot;jinr ...`,l:"components/icon/icon.html#局部挂载",a:"局部挂载"},"59.4":{t:"徽标提示\r",p:`我们可以设置dot属性后，让我们图标右上角展示一个小红点；设置badge属性后，会在图标右上角展示相应的徽标,例如：
&lt;Licon name=&quot;apple-line&quot; dot ...`,l:"components/icon/icon.html#徽标提示",a:"徽标提示"},"59.5":{t:"颜色\r",p:`我们可以设置color属性更改你想要的颜色,例如：
&lt;Licon name=&quot;apple-line&quot; color=&quot;red&quot;/&gt;

说明：部分图标不 ...`,l:"components/icon/icon.html#颜色",a:"颜色"},"59.6":{t:"使用\r",p:"",l:"components/icon/icon.html#使用",a:"使用"},"59.7":{t:"logo\r",p:`&lt;Licon name=&quot;apple-line&quot; color=&quot;red&quot;/&gt;
&lt;Licon name=&quot;apple-fill&quo ...`,l:"components/icon/icon.html#logo",a:"logo"},"59.8":{t:"链接\r",p:`&lt;Licon name=&quot;attachment-2&quot; /&gt;
&lt;Licon name=&quot;attachment-line&quot; /&gt;
&lt;L ...`,l:"components/icon/icon.html#链接",a:"链接"},"59.9":{t:"筛选\r",p:`&lt;Licon name=&quot;apps-fill&quot; /&gt;
&lt;Licon name=&quot;shaixuan&quot; /&gt;
&lt;Licon name= ...`,l:"components/icon/icon.html#筛选",a:"筛选"},"59.10":{t:"点赞收藏\r",p:`&lt;Licon name=&quot;dianzan&quot; /&gt;
&lt;Licon name=&quot;shandian&quot; /&gt;
&lt;Licon name=&q ...`,l:"components/icon/icon.html#点赞收藏",a:"点赞收藏"},"59.11":{t:"声音\r",p:`&lt;Licon name=&quot;shengyinguanbi&quot; /&gt;
&lt;Licon name=&quot;shengyin&quot; /&gt;
&lt;Licon  ...`,l:"components/icon/icon.html#声音",a:"声音"},"59.12":{t:"箭头\r",p:`&lt;Licon name=&quot;a-xiala2&quot; /&gt;
&lt;Licon name=&quot;jinru&quot; /&gt;
&lt;Licon name=&quo ...`,l:"components/icon/icon.html#箭头",a:"箭头"},"59.13":{t:"分享\r",p:`&lt;Licon name=&quot;dianhua&quot; /&gt;
&lt;Licon name=&quot;a-fenxiang2&quot; /&gt;
&lt;Licon name ...`,l:"components/icon/icon.html#分享",a:"分享"},"59.14":{t:"删除\r",p:`&lt;Licon name=&quot;shanchu&quot; /&gt;
&lt;Licon name=&quot;guanbi&quot; /&gt;
&lt;Licon name=&quo ...`,l:"components/icon/icon.html#删除",a:"删除"},"59.15":{t:"编写文字\r",p:`&lt;Licon name=&quot;bianji&quot; /&gt;
&lt;Licon name=&quot;bofangjilu&quot; /&gt;
&lt;Licon name=& ...`,l:"components/icon/icon.html#编写文字",a:"编写文字"},"59.16":{t:"设置帮助\r",p:`&lt;Licon name=&quot;shezhi&quot; /&gt;
&lt;Licon name=&quot;saoyisao&quot; /&gt;
&lt;Licon name=&qu ...`,l:"components/icon/icon.html#设置帮助",a:"设置帮助"},"60.0":{t:"# 超链接\r",p:"\r",l:"components/link/link.html",a:"超链接"},"60.1":{t:"下划线\r",p:`underline属性添加下划线
&lt;Llink href=&quot;#&quot;  underline&gt;这是超链接&lt;/Llink&gt;
&lt;Llink href=&quot ...`,l:"components/link/link.html#下划线",a:"下划线"},"60.2":{t:"禁用\r",p:`disabled属性禁用
&lt;Llink href=&quot;#&quot;  disabled&gt;禁用超链接&lt;/Llink&gt;
&lt;Llink href=&quot;#&qu ...`,l:"components/link/link.html#禁用",a:"禁用"},"61.0":{t:"# 文件上传\r",p:"\r",l:"components/upload/upload.html",a:"文件上传"},"61.1":{t:"点击上传\r",p:`multiple可以上传多个文件 accept设置只允许上传文件类型
&lt;Lupload multiple accept=&quot;image/*&quot; @getFilesList=&qu ...`,l:"components/upload/upload.html#点击上传",a:"点击上传"},"61.2":{t:"拖拽上传\r",p:`添加drag属性
&lt;div class=&quot;upfile&quot;&gt;
&lt;Lupload multiple accept=&quot;image/*&quot; @getFi ...`,l:"components/upload/upload.html#拖拽上传",a:"拖拽上传"},"62.0":{t:"# bilibili错题\r",p:"\r",l:"fighting/bilibili/bilibili.html",a:"bilibili错题"},"62.1":{t:"定时器\r",p:`宏任务的定时器谁先到时间谁先执行
setTimeout(function(){
    console.log(1);
},2000)
setTimeout(function(){
    conso ...`,l:"fighting/bilibili/bilibili.html#定时器",a:"定时器"},"62.2":{t:"哪个样式在现代浏览器默认样式下设置宽度不生效`display:table-row`\r",p:`参考
table标签（display:table） 类似于 &lt;table&gt;
1. table可设置宽高、margin、border、padding等属性。属性值的单位可以使用px，百分比值 ...`,l:"fighting/bilibili/bilibili.html#哪个样式在现代浏览器默认样式下设置宽度不生效-display-table-row",a:"哪个样式在现代浏览器默认样式下设置宽度不生效-display-table-row"},"62.3":{t:"Object.prototype.toString.call(undefined)\r",p:`[object Undefined],object小写，Undefined首字母大写
`,l:"fighting/bilibili/bilibili.html#object-prototype-tostring-call-undefined",a:"object-prototype-tostring-call-undefined"},"62.4":{t:"obj对象里的箭头函数的this指向的是obj的上下文\r",p:`别再错了指向的是obj的上下文，指不到里面的
const obj = {
    a:1,
    foo:()=&gt;{
        console.log(this.a)
    }
}
o ...`,l:"fighting/bilibili/bilibili.html#obj对象里的箭头函数的this指向的是obj的上下文",a:"obj对象里的箭头函数的this指向的是obj的上下文"},"62.5":{t:"input标签的输入类型\r",p:`输入类型
没有telphone类型只有tel类型
`,l:"fighting/bilibili/bilibili.html#input标签的输入类型",a:"input标签的输入类型"},"62.6":{t:"状态码\r",p:`405：请求中的方法不允许使用
302：（临时移动）服务器目前从不同位置的网页响应请求，但请求者应继续使用原有位置来进行以后的请求。而不是拒绝处理该请求
`,l:"fighting/bilibili/bilibili.html#状态码",a:"状态码"},"62.7":{t:"影响原数组\r",p:`splice,push,pop,shift,unshift,reverse,sort会影响原数组
其他的不会
`,l:"fighting/bilibili/bilibili.html#影响原数组",a:"影响原数组"},"62.8":{t:"clip-path\r",p:`clip-path 属性使用裁剪方式创建元素的可显示区域。区域内的部分显示，区域外的隐藏。可以指定一些特定形状。
`,l:"fighting/bilibili/bilibili.html#clip-path",a:"clip-path"},"62.9":{t:"promise的catch\r",p:`promise的catch只会执行第一个，和then不同不会传递到最后
Promise.rehect(0).catch((e)=&gt;e).catch(console.log(e))

只会执行第一 ...`,l:"fighting/bilibili/bilibili.html#promise的catch",a:"promise的catch"},"62.10":{t:"对象键值\r",p:`var a={},b='123',c=123
a[b]='b'
a[c]='c'
console.log(a[b]) //c
var a={},b=Symbol('123'),c=Symbol('12 ...`,l:"fighting/bilibili/bilibili.html#对象键值",a:"对象键值"},"62.11":{t:"分析\r",p:`情况一转为字符串后相当于重复赋值，情况二Symbol是唯一的b和c不一样，情况三{key:'123'}和{key:'456'}转为字符串都是[object,Object]，所以和情况一一样重复赋值
`,l:"fighting/bilibili/bilibili.html#分析",a:"分析"},"62.12":{t:"总结\r",p:`
Object对象转换为字符串和判断数据类型都是直接调用 toStirng() 方法，得到的结果都是 [object Object]。
除了Obeject之外的其他类型，直接调用 toStirng() ...`,l:"fighting/bilibili/bilibili.html#总结",a:"总结"},"62.13":{t:"let var\r",p:`let块级作用域输出0-1-2
for(let i = 0; i &lt; 3; i++) {
    setTimeout(function(){
        console.log(i)},0 ...`,l:"fighting/bilibili/bilibili.html#let-var",a:"let-var"},"62.14":{t:"过渡效果transition\r",p:`若过渡起始值或过渡开始值为auto，则浏览器不会自己计算成具体数字值，而是不发生过渡效果。所以要过渡某些属性，首先需要将其重置成具体数字值
.box{
    transition: hight 1s ...`,l:"fighting/bilibili/bilibili.html#过渡效果transition",a:"过渡效果transition"},"62.15":{t:'`<input type="text" />`change事件和inpute事件\r',p:`用户键入内容改变时，触发inpute事件，且当标签失焦后触发change事件
`,l:"fighting/bilibili/bilibili.html#input-type-text-change事件和inpute事件",a:"input-type-text-change事件和inpute事件"},"62.16":{t:"定位的top属性\r",p:`top属性规定内部元素的顶部边缘，定义了一个定位元素的上外边距与其包含块的上内边距
`,l:"fighting/bilibili/bilibili.html#定位的top属性",a:"定位的top属性"},"62.17":{t:"取余\r",p:`1 % 6 = 1,2 % 6 = 2,3 % 6 = 3,4 % 6 = 4,-7 % 3 = -1
`,l:"fighting/bilibili/bilibili.html#取余",a:"取余"},"62.18":{t:"三栏布局\r",p:`flex方法时，display:flex应该设置在父元素上
使用浮动时先写left再写right再写中间的，顺序不能乱
`,l:"fighting/bilibili/bilibili.html#三栏布局",a:"三栏布局"},"62.19":{t:"leecode 279",p:"",l:"fighting/bilibili/bilibili.html#leecode-279",a:"leecode-279"},"63.0":{t:"# 日常错题\r",p:"\r",l:"fighting/date/date.html",a:"日常错题"},"63.1":{t:"箭头函数\r",p:`
箭头函数后面有{ }就需要return来返回里面的数据，不写return会undefined
箭头函数后面没有{ }，不需要return，直接返回

sum(1, 2)
    .then(res  ...`,l:"fighting/date/date.html#箭头函数",a:"箭头函数"},"63.2":{t:"构造函数\r",p:`构造函数里的箭头函数方法挂载在对象自身里，普通函数放在原型上
class Mypromise {
    constructor(executor) {
        executor(this.# ...`,l:"fighting/date/date.html#构造函数",a:"构造函数"},"64.0":{t:"# 错题集\r",p:`你可上点心吧
`,l:"fighting/introductor.html",a:"错题集"},"66.0":{t:"# 介绍\r",p:`通过vitepress和github pages在这里记录我的学习blog
这里有什么

面试题
代码手撕
封装好的组件库
错题集
...待更新

鹏之徙于南冥也,水击三千里,抟扶摇而上者九万里 —— ...`,l:"introduce/introduce.html",a:"介绍"},"67.0":{t:"快速开始\r",p:`从这里开始你的 面试题 之旅

等不及了从这里开始你的 代码手撕 之旅

等不及了从这里开始你的 组件库 之旅

温故而知新  错题集 长点心！
`,l:"introduce/quickstart.html",a:"快速开始"}},n={previewLength:100,buttonLabel:"搜索",placeholder:"情输入关键词",allow:[],ignore:[]},o={INDEX_DATA:t,PREVIEW_LOOKUP:e,Options:n};export{o as default};
